-- phpMyAdmin SQL Dump
-- version 4.6.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2018-09-10 09:39:33
-- 服务器版本： 5.7.14
-- PHP Version: 5.6.25

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `ceshi_jichudatabase`
--

-- --------------------------------------------------------

--
-- 表的结构 `t_heimingdan`
--

CREATE TABLE `t_heimingdan` (
  `id` int(11) NOT NULL,
  `nickname` varchar(100) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '0' COMMENT '状态 1白  0黑'
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `t_heimingdan`
--

INSERT INTO `t_heimingdan` (`id`, `nickname`, `status`) VALUES
(1, 'chen', 0);

-- --------------------------------------------------------

--
-- 表的结构 `t_system_auth`
--

CREATE TABLE `t_system_auth` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(20) NOT NULL COMMENT '权限名称',
  `status` tinyint(1) UNSIGNED DEFAULT '1' COMMENT '状态(1:禁用,2:启用)',
  `sort` smallint(6) UNSIGNED DEFAULT '0' COMMENT '排序权重',
  `desc` varchar(255) DEFAULT NULL COMMENT '备注说明',
  `create_by` bigint(11) UNSIGNED DEFAULT '0' COMMENT '创建人',
  `create_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统权限表';

--
-- 转存表中的数据 `t_system_auth`
--

INSERT INTO `t_system_auth` (`id`, `title`, `status`, `sort`, `desc`, `create_by`, `create_at`) VALUES
(1, 'test', 1, 0, 'test', 0, '2018-04-28 09:36:58'),
(2, 'test2', 1, 0, 'test2', 0, '2018-04-28 09:40:58'),
(3, '商务', 1, 0, 'sfd ', 0, '2018-09-10 00:54:12'),
(4, '超级黑名单', 1, 0, '超级黑名单', 0, '2018-09-10 00:54:23');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_auth_node`
--

CREATE TABLE `t_system_auth_node` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `auth` bigint(20) UNSIGNED DEFAULT NULL COMMENT '角色ID',
  `node` varchar(200) DEFAULT NULL COMMENT '节点路径'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统角色与节点绑定';

--
-- 转存表中的数据 `t_system_auth_node`
--

INSERT INTO `t_system_auth_node` (`id`, `auth`, `node`) VALUES
(106, 1, 'admin'),
(107, 1, 'admin/auth'),
(108, 1, 'admin/auth/index'),
(109, 1, 'admin/auth/apply'),
(110, 1, 'admin/auth/add'),
(111, 1, 'admin/auth/edit'),
(112, 1, 'admin/auth/forbid'),
(113, 1, 'admin/auth/resume'),
(114, 1, 'admin/auth/del'),
(115, 1, 'admin/config'),
(116, 1, 'admin/config/index'),
(117, 1, 'admin/config/file'),
(118, 1, 'admin/log'),
(119, 1, 'admin/log/index'),
(120, 1, 'admin/log/sms'),
(121, 1, 'admin/log/del'),
(122, 1, 'admin/menu'),
(123, 1, 'admin/menu/index'),
(124, 1, 'admin/menu/add'),
(125, 1, 'admin/menu/edit'),
(126, 1, 'admin/menu/del'),
(127, 1, 'admin/menu/forbid'),
(128, 1, 'admin/menu/resume'),
(129, 1, 'admin/node'),
(130, 1, 'admin/node/index'),
(131, 1, 'admin/node/clear'),
(132, 1, 'admin/node/save'),
(133, 1, 'admin/user'),
(134, 1, 'admin/user/index'),
(135, 1, 'admin/user/auth'),
(136, 1, 'admin/user/add'),
(137, 1, 'admin/user/edit'),
(138, 1, 'admin/user/pass'),
(139, 1, 'admin/user/del'),
(140, 1, 'admin/user/forbid'),
(141, 1, 'admin/user/resume'),
(142, 1, 'goods'),
(143, 1, 'goods/brand'),
(144, 1, 'goods/brand/index'),
(145, 1, 'goods/brand/add'),
(146, 1, 'goods/brand/edit'),
(147, 1, 'goods/brand/del'),
(148, 1, 'goods/brand/forbid'),
(149, 1, 'goods/brand/resume'),
(150, 1, 'goods/cate'),
(151, 1, 'goods/cate/index'),
(152, 1, 'goods/cate/add'),
(153, 1, 'goods/cate/edit'),
(154, 1, 'goods/cate/del'),
(155, 1, 'goods/cate/forbid'),
(156, 1, 'goods/cate/resume'),
(157, 1, 'goods/product'),
(158, 1, 'goods/product/index'),
(159, 1, 'goods/product/add'),
(160, 1, 'goods/product/edit'),
(161, 1, 'goods/product/del'),
(162, 1, 'goods/product/forbid'),
(163, 1, 'goods/product/resume'),
(164, 1, 'goods/spec'),
(165, 1, 'goods/spec/index'),
(166, 1, 'goods/spec/add'),
(167, 1, 'goods/spec/edit'),
(168, 1, 'goods/spec/del'),
(169, 1, 'goods/spec/forbid'),
(170, 1, 'goods/spec/resume'),
(171, 1, 'test'),
(172, 1, 'test/index'),
(173, 1, 'test/index/index'),
(174, 1, 'wechat'),
(175, 1, 'wechat/block'),
(176, 1, 'wechat/block/index'),
(177, 1, 'wechat/block/backdel'),
(178, 1, 'wechat/config'),
(179, 1, 'wechat/config/index'),
(180, 1, 'wechat/fans'),
(181, 1, 'wechat/fans/index'),
(182, 1, 'wechat/fans/backadd'),
(183, 1, 'wechat/fans/tagset'),
(184, 1, 'wechat/fans/tagadd'),
(185, 1, 'wechat/fans/tagdel'),
(186, 1, 'wechat/fans/sync'),
(187, 1, 'wechat/keys'),
(188, 1, 'wechat/keys/index'),
(189, 1, 'wechat/keys/add'),
(190, 1, 'wechat/keys/edit'),
(191, 1, 'wechat/keys/del'),
(192, 1, 'wechat/keys/forbid'),
(193, 1, 'wechat/keys/resume'),
(194, 1, 'wechat/keys/subscribe'),
(195, 1, 'wechat/keys/defaults'),
(196, 1, 'wechat/menu'),
(197, 1, 'wechat/menu/index'),
(198, 1, 'wechat/menu/edit'),
(199, 1, 'wechat/menu/cancel'),
(200, 1, 'wechat/news'),
(201, 1, 'wechat/news/index'),
(202, 1, 'wechat/news/select'),
(203, 1, 'wechat/news/image'),
(204, 1, 'wechat/news/add'),
(205, 1, 'wechat/news/edit'),
(206, 1, 'wechat/news/del'),
(207, 1, 'wechat/news/push'),
(208, 1, 'wechat/tags'),
(209, 1, 'wechat/tags/index'),
(210, 1, 'wechat/tags/add'),
(211, 1, 'wechat/tags/edit'),
(212, 1, 'wechat/tags/del'),
(213, 1, 'wechat/tags/sync'),
(214, 2, 'admin'),
(215, 2, 'admin/link'),
(216, 2, 'admin/link/index'),
(217, 2, 'admin/link/add'),
(218, 2, 'admin/link/edit'),
(219, 2, 'admin/link/forbid'),
(220, 2, 'admin/link/resume'),
(221, 2, 'admin/tpfig'),
(222, 2, 'admin/tpfig/index'),
(223, 2, 'admin/tpfig/add'),
(224, 2, 'admin/tpfig/edit'),
(225, 2, 'admin/tpfig/forbid'),
(226, 2, 'admin/tpfig/resume'),
(227, 2, 'admin/word'),
(228, 2, 'admin/word/index'),
(229, 2, 'admin/word/add'),
(230, 2, 'admin/word/edit'),
(231, 2, 'admin/word/forbid'),
(232, 2, 'admin/word/resume'),
(233, 4, 'nickname'),
(234, 4, 'nickname/nickname'),
(235, 4, 'nickname/nickname/index'),
(236, 4, 'nickname/nickname/add'),
(237, 4, 'nickname/nickname/edit'),
(238, 4, 'nickname/nickname/forbid'),
(239, 4, 'nickname/nickname/resume');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_config`
--

CREATE TABLE `t_system_config` (
  `id` int(11) UNSIGNED NOT NULL,
  `name` varchar(100) DEFAULT NULL COMMENT '配置编码',
  `value` varchar(500) DEFAULT NULL COMMENT '配置值'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统参数配置' ROW_FORMAT=COMPACT;

--
-- 转存表中的数据 `t_system_config`
--

INSERT INTO `t_system_config` (`id`, `name`, `value`) VALUES
(1, 'app_name', '本地拼音测试'),
(2, 'site_name', '本地拼音测试'),
(3, 'app_version', '3.0 dev'),
(4, 'site_copy', '©版权所有 2014-2018 楚才科技'),
(5, 'browser_icon', 'http://localhost/static/upload/d930246d14180a61/1d5ecc9b2b344f19.png'),
(6, 'tongji_baidu_key', ''),
(7, 'miitbeian', '粤ICP备16006642号-2'),
(8, 'storage_type', 'wangsu'),
(9, 'storage_local_exts', 'png,jpg,rar,doc,icon,mp4'),
(10, 'storage_qiniu_bucket', ''),
(11, 'storage_qiniu_domain', ''),
(12, 'storage_qiniu_access_key', ''),
(13, 'storage_qiniu_secret_key', ''),
(14, 'storage_oss_bucket', 'cuci'),
(15, 'storage_oss_endpoint', 'oss-cn-beijing.aliyuncs.com'),
(16, 'storage_oss_domain', 'cuci.oss-cn-beijing.aliyuncs.com'),
(17, 'storage_oss_keyid', '用你自己的吧'),
(18, 'storage_oss_secret', '用你自己的吧'),
(34, 'wechat_appid', 'wx60a43dd8161666d4'),
(35, 'wechat_appkey', '9890a0d7c91801a609d151099e95b61a'),
(36, 'storage_oss_is_https', 'http'),
(37, 'wechat_type', 'api'),
(38, 'wechat_token', 'test'),
(39, 'wechat_appsecret', 'a041bec98ed015d52b99acea5c6a16ef'),
(40, 'wechat_encodingaeskey', 'BJIUzE0gqlWy0GxfPp4J1oPTBmOrNDIGPNav1YFH5Z5'),
(41, 'wechat_thr_appid', 'wx60a43dd8161666d4'),
(42, 'wechat_thr_appkey', '05db2aa335382c66ab56d69b1a9ad0ee'),
(43, 'storage_qiniu_region', '华东'),
(44, 'storage_qiniu_is_https', 'auto'),
(45, 'wangsu_bucket', '454'),
(46, 'wangsu_domain', '4532453');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_log`
--

CREATE TABLE `t_system_log` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `ip` char(15) NOT NULL DEFAULT '' COMMENT '操作者IP地址',
  `node` char(200) NOT NULL DEFAULT '' COMMENT '当前操作节点',
  `username` varchar(32) NOT NULL DEFAULT '' COMMENT '操作人用户名',
  `action` varchar(200) NOT NULL DEFAULT '' COMMENT '操作行为',
  `content` text NOT NULL COMMENT '操作内容描述',
  `create_at` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统操作日志表';

--
-- 转存表中的数据 `t_system_log`
--

INSERT INTO `t_system_log` (`id`, `ip`, `node`, `username`, `action`, `content`, `create_at`) VALUES
(1, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-07-23 01:39:14'),
(2, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-08-03 01:38:17'),
(3, '192.168.2.116', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-08-21 08:48:47'),
(4, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-01 03:42:33'),
(5, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-01 06:10:39'),
(6, '127.0.0.1', 'admin/login/out', 'admin', '系统管理', '用户退出系统成功', '2018-09-01 06:13:36'),
(7, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-01 06:13:41'),
(8, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-01 06:14:08'),
(9, '127.0.0.1', 'admin/config/index', 'admin', '系统管理', '系统参数配置成功', '2018-09-01 06:14:35'),
(10, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-10 00:45:00'),
(11, '127.0.0.1', 'admin/login/out', 'admin', '系统管理', '用户退出系统成功', '2018-09-10 00:55:50'),
(12, '127.0.0.1', 'admin/login/index', 'shangwu', '系统管理', '用户登录系统成功', '2018-09-10 00:55:56'),
(13, '127.0.0.1', 'admin/login/out', 'shangwu', '系统管理', '用户退出系统成功', '2018-09-10 00:56:12'),
(14, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-10 00:56:15'),
(15, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-10 07:32:09'),
(16, '127.0.0.1', 'admin/login/index', 'admin', '系统管理', '用户登录系统成功', '2018-09-10 09:38:59');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_menu`
--

CREATE TABLE `t_system_menu` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `pid` bigint(20) UNSIGNED NOT NULL DEFAULT '0' COMMENT '父id',
  `title` varchar(100) NOT NULL DEFAULT '' COMMENT '名称',
  `node` varchar(200) NOT NULL DEFAULT '' COMMENT '节点代码',
  `icon` varchar(100) NOT NULL DEFAULT '' COMMENT '菜单图标',
  `url` varchar(400) NOT NULL DEFAULT '' COMMENT '链接',
  `params` varchar(500) DEFAULT '' COMMENT '链接参数',
  `target` varchar(20) NOT NULL DEFAULT '_self' COMMENT '链接打开方式',
  `sort` int(11) UNSIGNED DEFAULT '0' COMMENT '菜单排序',
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '1' COMMENT '状态(0:禁用,1:启用)',
  `create_by` bigint(20) UNSIGNED NOT NULL DEFAULT '0' COMMENT '创建人',
  `create_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统菜单表';

--
-- 转存表中的数据 `t_system_menu`
--

INSERT INTO `t_system_menu` (`id`, `pid`, `title`, `node`, `icon`, `url`, `params`, `target`, `sort`, `status`, `create_by`, `create_at`) VALUES
(1, 0, '系统设置', '', '', '#', '', '_self', 9000, 1, 10000, '2018-01-19 07:27:00'),
(2, 10, '后台菜单', '', 'fa fa-leaf', 'admin/menu/index', '', '_self', 10, 1, 10000, '2018-01-19 07:27:17'),
(3, 10, '系统参数', '', 'fa fa-modx', 'admin/config/index', '', '_self', 20, 1, 10000, '2018-01-19 07:27:57'),
(4, 11, '访问授权', '', 'fa fa-group', 'admin/auth/index', '', '_self', 20, 1, 10000, '2018-01-22 03:13:02'),
(5, 11, '用户管理', '', 'fa fa-user', 'admin/user/index', '', '_self', 10, 1, 0, '2018-01-23 04:15:12'),
(6, 11, '访问节点', '', 'fa fa-fort-awesome', 'admin/node/index', '', '_self', 30, 1, 0, '2018-01-23 04:36:54'),
(7, 0, '后台首页', '', '', 'admin/index/main', '', '_self', 1000, 1, 0, '2018-01-23 05:42:30'),
(8, 16, '系统日志', '', 'fa fa-code', 'admin/log/index', '', '_self', 10, 1, 0, '2018-01-24 05:52:58'),
(9, 10, '文件存储', '', 'fa fa-stop-circle', 'admin/config/file', '', '_self', 30, 1, 0, '2018-01-25 02:54:28'),
(10, 1, '系统管理', '', 'fa fa-scribd', '#', '', '_self', 200, 1, 0, '2018-01-25 10:14:28'),
(11, 1, '访问权限', '', 'fa fa-anchor', '#', '', '_self', 300, 1, 0, '2018-01-25 10:15:08'),
(16, 1, '日志管理', '', 'fa fa-hashtag', '#', '', '_self', 400, 1, 0, '2018-02-10 08:31:15'),
(73, 0, '小程序配置', '', '', '#', '', '_self', 9001, 1, 0, '2018-09-10 00:51:27'),
(74, 0, '其他小程序配置', '', '', '#', '', '_self', 9002, 1, 0, '2018-09-10 00:51:50'),
(75, 0, 'IP配置', '', '', '#', '', '_self', 9003, 1, 0, '2018-09-10 00:51:59'),
(76, 73, 'test', '', '', 'test', '', '_self', 0, 1, 0, '2018-09-10 00:52:57'),
(77, 74, '步数换奖', '', 'fa fa-circle-thin', '/bxdj/tpfig/index', '', '_self', 0, 1, 0, '2018-09-10 00:53:08'),
(78, 75, 'ip配置', '', 'fa fa-circle-thin', 'nickname/nick_name/index', '', '_self', 0, 1, 0, '2018-09-10 00:53:33'),
(79, 77, '配置管理', '', 'fa fa-circle-thin', '/bxdj/tpfig/index', '', '_self', 0, 1, 0, '2018-09-10 08:15:18');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_node`
--

CREATE TABLE `t_system_node` (
  `id` int(11) UNSIGNED NOT NULL,
  `node` varchar(100) DEFAULT NULL COMMENT '节点代码',
  `title` varchar(500) DEFAULT NULL COMMENT '节点标题',
  `is_menu` tinyint(1) UNSIGNED DEFAULT '0' COMMENT '是否可设置为菜单',
  `is_auth` tinyint(1) UNSIGNED DEFAULT '1' COMMENT '是否启动RBAC权限控制',
  `is_login` tinyint(1) UNSIGNED DEFAULT '1' COMMENT '是否启动登录控制',
  `create_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统节点表' ROW_FORMAT=COMPACT;

--
-- 转存表中的数据 `t_system_node`
--

INSERT INTO `t_system_node` (`id`, `node`, `title`, `is_menu`, `is_auth`, `is_login`, `create_at`) VALUES
(1, 'admin', '系统管理', 0, 1, 1, '2018-01-23 04:39:13'),
(2, 'admin/auth', '权限管理', 0, 1, 1, '2018-01-23 04:39:14'),
(3, 'admin/auth/index', '权限列表', 1, 1, 1, '2018-01-23 04:39:14'),
(4, 'admin/auth/apply', '访问授权', 0, 1, 1, '2018-01-23 04:39:19'),
(5, 'admin/auth/add', '添加权限', 0, 1, 1, '2018-01-23 04:39:22'),
(6, 'admin/auth/edit', '编辑权限', 0, 1, 1, '2018-01-23 04:39:23'),
(7, 'admin/auth/forbid', '禁用权限', 0, 1, 1, '2018-01-23 04:39:23'),
(8, 'admin/auth/resume', '启用权限', 0, 1, 1, '2018-01-23 04:39:24'),
(9, 'admin/auth/del', '删除权限', 0, 1, 1, '2018-01-23 04:39:25'),
(10, 'admin/config/index', '系统参数', 1, 1, 1, '2018-01-23 04:39:25'),
(11, 'admin/config/file', '文件存储', 0, 1, 1, '2018-01-23 04:39:26'),
(13, 'admin/log/index', '日志记录', 1, 1, 1, '2018-01-23 04:39:28'),
(14, 'admin/log/sms', '短信记录', 0, 1, 1, '2018-01-23 04:39:29'),
(15, 'admin/log/del', '日志删除', 0, 1, 1, '2018-01-23 04:39:29'),
(16, 'admin/menu/index', '系统菜单列表', 1, 1, 1, '2018-01-23 04:39:31'),
(17, 'admin/menu/add', '添加系统菜单', 0, 1, 1, '2018-01-23 04:39:31'),
(18, 'admin/menu/edit', '编辑系统菜单', 0, 1, 1, '2018-01-23 04:39:32'),
(19, 'admin/menu/del', '删除系统菜单', 0, 1, 1, '2018-01-23 04:39:33'),
(20, 'admin/menu/forbid', '禁用系统菜单', 0, 1, 1, '2018-01-23 04:39:33'),
(21, 'admin/menu/resume', '启用系统菜单', 0, 1, 1, '2018-01-23 04:39:34'),
(22, 'admin/node/index', '系统节点列表', 1, 1, 1, '2018-01-23 04:39:36'),
(23, 'admin/node/save', '保存节点信息', 0, 1, 1, '2018-01-23 04:39:36'),
(24, 'admin/user/index', '系统用户列表', 1, 1, 1, '2018-01-23 04:39:37'),
(25, 'admin/user/auth', '用户授权操作', 0, 1, 1, '2018-01-23 04:39:38'),
(26, 'admin/user/add', '添加系统用户', 0, 1, 1, '2018-01-23 04:39:39'),
(27, 'admin/user/edit', '编辑系统用户', 0, 1, 1, '2018-01-23 04:39:39'),
(28, 'admin/user/pass', '修改用户密码', 0, 1, 1, '2018-01-23 04:39:40'),
(29, 'admin/user/del', '删除系统用户', 0, 1, 1, '2018-01-23 04:39:41'),
(30, 'admin/user/forbid', '禁用系统用户', 0, 1, 1, '2018-01-23 04:39:41'),
(31, 'admin/user/resume', '启用系统用户', 0, 1, 1, '2018-01-23 04:39:42'),
(32, 'admin/config', '系统配置', 0, 1, 1, '2018-01-23 05:34:37'),
(33, 'admin/log', '日志管理', 0, 1, 1, '2018-01-23 05:34:48'),
(34, 'admin/menu', '系统菜单管理', 0, 1, 1, '2018-01-23 05:34:58'),
(35, 'admin/node', '系统节点管理', 0, 1, 1, '2018-01-23 05:35:17'),
(36, 'admin/user', '系统用户管理', 0, 1, 1, '2018-01-23 05:35:26'),
(229, 'admin/node/clear', '清理无效记录', 0, 1, 1, '2018-03-09 04:24:31'),
(294, 'hzdw', '汉字大王', 0, 1, 1, '2018-07-23 01:39:35'),
(295, 'zpszw', '最强识字王错误', 0, 1, 1, '2018-07-23 01:39:51'),
(296, 'hzkt', '汉字课堂', 0, 1, 1, '2018-07-23 06:59:01'),
(297, 'szdky', '识字大考验', 0, 1, 1, '2018-07-23 06:59:11'),
(298, 'zqszw', '最强识字王', 0, 1, 1, '2018-07-23 06:59:32');

-- --------------------------------------------------------

--
-- 表的结构 `t_system_sequence`
--

CREATE TABLE `t_system_sequence` (
  `id` bigint(20) NOT NULL,
  `type` varchar(20) DEFAULT NULL COMMENT '序号类型',
  `sequence` char(50) NOT NULL COMMENT '序号值',
  `create_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统序号表';

-- --------------------------------------------------------

--
-- 表的结构 `t_system_user`
--

CREATE TABLE `t_system_user` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `username` varchar(50) NOT NULL DEFAULT '' COMMENT '用户登录名',
  `password` char(32) NOT NULL DEFAULT '' COMMENT '用户登录密码',
  `qq` varchar(16) DEFAULT NULL COMMENT '联系QQ',
  `mail` varchar(32) DEFAULT NULL COMMENT '联系邮箱',
  `phone` varchar(16) DEFAULT NULL COMMENT '联系手机号',
  `desc` varchar(255) DEFAULT '' COMMENT '备注说明',
  `login_num` bigint(20) UNSIGNED DEFAULT '0' COMMENT '登录次数',
  `login_at` datetime DEFAULT NULL,
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '1' COMMENT '状态(0:禁用,1:启用)',
  `authorize` varchar(255) DEFAULT NULL,
  `is_deleted` tinyint(1) UNSIGNED DEFAULT '0' COMMENT '删除状态(1:删除,0:未删)',
  `create_by` bigint(20) UNSIGNED DEFAULT NULL COMMENT '创建人',
  `create_at` timestamp NULL DEFAULT CURRENT_TIMESTAMP COMMENT '创建时间'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='系统用户表';

--
-- 转存表中的数据 `t_system_user`
--

INSERT INTO `t_system_user` (`id`, `username`, `password`, `qq`, `mail`, `phone`, `desc`, `login_num`, `login_at`, `status`, `authorize`, `is_deleted`, `create_by`, `create_at`) VALUES
(10000, 'admin', '21232f297a57a5a743894a0e4a801fc3', '22222222', '', '18993368867', '', 23313, '2018-09-10 17:38:59', 1, '2,4', 0, NULL, '2015-11-13 07:14:22'),
(10001, 'test', 'e10adc3949ba59abbe56e057f20f883e', NULL, '121515@qq.com', '15214526555', 'test', 0, NULL, 1, '2', 0, NULL, '2018-04-28 09:19:21'),
(10002, 'shangwu', 'e10adc3949ba59abbe56e057f20f883e', NULL, '', '', '', 1, '2018-09-10 08:55:56', 1, '4', 0, NULL, '2018-09-10 00:55:32');

-- --------------------------------------------------------

--
-- 表的结构 `t_whitelist`
--

CREATE TABLE `t_whitelist` (
  `id` int(11) NOT NULL COMMENT '主键',
  `title` varchar(20) NOT NULL COMMENT '标题',
  `ips` varchar(256) CHARACTER SET utf8 NOT NULL COMMENT '白名单ip，可以设置多个中间用; 分割，也可以设置ip段，比如192.168.1.1/255',
  `appid` varchar(128) CHARACTER SET utf8 NOT NULL COMMENT '合作伙伴appid',
  `memo` varchar(100) CHARACTER SET utf8 NOT NULL COMMENT '备注',
  `app_secret` varchar(255) NOT NULL,
  `status` tinyint(1) NOT NULL DEFAULT '1' COMMENT '状态 1-正常 0-禁用',
  `admin_user_id` int(11) NOT NULL,
  `create_time` int(11) NOT NULL,
  `update_time` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1 COMMENT='接口IP白名单表';

--
-- 转存表中的数据 `t_whitelist`
--

INSERT INTO `t_whitelist` (`id`, `title`, `ips`, `appid`, `memo`, `app_secret`, `status`, `admin_user_id`, `create_time`, `update_time`) VALUES
(1, 'wx123', '175.10.237.195;127.0.0.1', 'wx123', 'x', 'wx123', 1, 1, 1, 1);

-- --------------------------------------------------------

--
-- 表的结构 `t_word`
--

CREATE TABLE `t_word` (
  `id` int(11) UNSIGNED NOT NULL COMMENT '主键',
  `word` varchar(16) NOT NULL COMMENT '词语内容',
  `mix_num` tinyint(1) UNSIGNED NOT NULL COMMENT '混淆第几个字',
  `mix_char` varchar(1) NOT NULL COMMENT '混淆字',
  `pinyin` varchar(100) NOT NULL COMMENT '词语拼音',
  `intro` varchar(100) NOT NULL COMMENT '词语释义',
  `caution` varchar(300) NOT NULL COMMENT '词语说明',
  `level` tinyint(1) UNSIGNED NOT NULL COMMENT '难度等级',
  `status` tinyint(1) UNSIGNED NOT NULL DEFAULT '1' COMMENT '词语状态[0:禁用,1:启用]'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COMMENT='词库表';

--
-- 转存表中的数据 `t_word`
--

INSERT INTO `t_word` (`id`, `word`, `mix_num`, `mix_char`, `pinyin`, `intro`, `caution`, `level`, `status`) VALUES
(1, '愚公移山', 2, '工', 'yú gōng yí shān', '比喻坚持不懈地改造自然和坚定不移地进行斗争2222。', '出 处清·黄宗羲《张苍水墓志铭》：“愚公移山；精卫填海；常人藐为说铃；贤圣指为血路也。”', 1, 1),
(2, '一目十行', 2, '木', 'yī mù shí háng', '形容看书的速度很快，出自《梁书·简文 帝纪》。', '出处\n宋·刘克庄《杂记六言五首》诗:“五更三点待漏，一目十行读书。”', 1, 1),
(3, '任人宰割', 4, '搁', 'rèn rén zǎi gē', '任凭别人宰杀与欺辱，没有反抗的能力', '近义词：人为刀俎、受制于人', 1, 1),
(4, '歌功颂德', 4, '得', 'gē gōng sòng dé', '颂扬功绩和德行', '出处\n《史记·周本纪》：“民皆歌乐之，颂其德。”', 2, 1),
(5, '张王赵李', 4, '里', 'zhāng wáng zhào lǐ', '泛指一些人。也指寻常之辈。', '出 处\n《梁书·范缜传》:“亦可张甲之情寄王乙之躯，李丙之性托赵丁之体。”', 2, 1),
(6, '掩耳盗铃', 4, '玲', 'yǎn ěr dào líng', '比喻自己欺骗自己，明明掩盖不住的事情偏要想法子掩盖。', '出 处\n《吕氏春秋·自知》：“恐人闻之而夺己也。遽揜（掩）其耳。恶人闻之；可也；恶己闻之；悖也。”', 1, 1),
(7, '气吞山河', 1, '汽', 'qì tūn shān hé', '气势可以吞没山河。形容气魄很大。', '出 处\n元·金仁杰《追韩信》：“背楚投江；气吞山河；知音未遇；弹琴空歌”。', 1, 1),
(8, '掩人耳目', 3, '饵', 'yǎn rén ěr mù', '堵住人的耳朵，遮住人的眼睛。比喻迷惑欺骗别人', '出 处\n《新刊大宋宣和遗事》：“事迹显然；虽欲掩人之耳目；不可得也。”', 1, 1),
(9, '一言九鼎', 2, '研', 'yī yán jiǔ dǐng', '形容所说的话分量很重，作用很大。', '出 处\n《史记·平原君列传》：“毛先生一至楚；而使赵重于九鼎大吕。”', 1, 1),
(10, '快人快语', 4, '羽', 'kuài rén kuài yǔ', '直爽的人说直爽的话', '出 处陈白尘、贾霁《宋景诗》第二十四章：“宋大师真是快人快语！来；干一大杯！”', 1, 1),
(11, '取长补短', 3, '卟', 'qǔ cháng bǔ duǎn', '吸取别人的长处，来弥补自己的不足之处。', '出 处\n《吕氏春秋·用众》：“物固莫不有长；莫不有短；人亦然。故善学者假人之长以补其短。”', 1, 1),
(12, '有名无实', 2, '铭', 'yǒu míng wú shí', '光有空名，实际上并不是那样。', '出 处\n《庄子·则阳》:“有名有实，是物之居；无名无实，在物之虚。”', 2, 1),
(13, '片甲不留', 2, '钾', 'piàn jiǎ bù liú', '一片铠甲都没留下来。形容全军覆没。', '出 处\n清·钱彩《说岳全传》第二十三回；“为足的在此扎营；意欲等候番兵来；杀他一个片甲不留。”', 2, 1),
(14, '干净利落', 3, '励', 'gān jìng lì luò', '形容没有多余的东西。令人爽心悦目。', '出 处\n赵树理《李家庄的变迁·十二》:“不是老人家，谁能这样干净利落。”', 1, 1),
(15, '世外桃源', 4, '原', 'shì wài táo yuán', '原指与现实社会隔绝、生活安乐的理想境界', '出 处\n清·孔尚任《桃花扇》：“且喜已到松凤阁；这是俺的世外桃源。”', 1, 1),
(16, '如狼似虎', 3, '是', 'rú láng sì hǔ', '像狼和虎一样凶狠。比喻非常凶暴残忍。', '出 处\n《尉缭子·武议》：“一人之兵；如狼如虎；如风如雨；如雷如霆；震震冥冥；天下皆惊。”', 2, 1),
(17, '狗屁不通', 4, '彤', 'gǒu pì bù tōng', '指责别人说话或文章极不通顺', '出 处\n清·石玉昆《三侠五义》第35回：“柳老赖婚狼心推测，冯生联句狗屁不通。”', 1, 1),
(18, '邪不胜正', 4, '证', 'xié bù shèng zhèng', '犹言邪不犯正。指邪妖之法不能压倒刚正之气。', '出 处\n唐·韦洵《刘宾客嘉话录》：“此邪法也，臣闻邪不干正，若使咒臣，必不能行。”', 2, 1),
(19, '一脉相承', 2, '迈', 'yī mài xiāng chéng', '从同一血统、派别世代相承流传下来。', '出 处\n清·李绿园《歧路灯》：“如今这两个侄儿；虽分鸿胪、宜宾两派；毕竟一脉相承；所以一个模样。”', 2, 1),
(20, '战战兢兢', 3, '惊', 'zhàn zhàn jīng jīng', '形容非常害怕而微微发抖的样子。', '出 处《诗经·小雅·小旻》：“战战兢兢；如临深渊；如履薄冰。”', 1, 1),
(21, '无坚不摧', 2, '监', 'wú jiān bù cuī', '形容力量非常强大，没有什么坚固的东西不能摧毁', '出 处《旧唐书·孔巢父传》：“（田）乃就宴；悦酒酣；自矜其骑射之艺；拳略之勇；因曰：‘若蒙见用；无坚不摧。’”', 1, 1),
(22, '见怪不怪', 1, '建', 'jiàn guài bù guài', '指遇到不常见的事物或意外情况，要沉着镇静。', '出 处\n宋·洪迈《夷坚三志·己·姜七家猪》：“见怪不怪；其怪自坏！”', 1, 1),
(23, '一针见血', 2, '帧', 'yī zhēn jiàn xiě', '比喻说话直截了当，切中要害。', '出 处\n南朝·宋·范晔《后汉书·郭玉传》：“一针即瘥。”', 1, 1),
(24, '杯盘狼藉', 3, '郎', 'bēi pán láng jí', '形容吃喝以后桌面杂乱的样子。', '出 处清·李绿园《歧路灯》第八十八回：“这桌子微醺；那桌子半酣；杯盘狼藉；言语喧哗。”', 2, 1),
(25, '大起大落', 2, '启', 'dà qǐ dà luò ', '大幅度地起落。形容变化大。', '出 处\n老舍《四世同堂》:“她的喜怒哀乐都是大起大落，整出整落的。”', 1, 1),
(26, '逢场做戏', 1, '缝', 'féng chǎng zuò xì', '后指遇到机会，偶尔凑凑热闹。', '出 处\n宋·释道原《景德传灯录》第六卷：“竿木随身；逢场作戏。”', 2, 1),
(27, '嘴上功夫', 2, '尚', 'zuǐ shàng gōng fū', '指没有实际本事，只是口头说说而已。', '近义词：口头功夫', 1, 1),
(28, '风吹草动', 2, '炊', 'fēng chuī cǎo dòng', '风稍一吹，草就摇晃。比喻微小的变动。', '出 处\n《敦煌变文集·伍子胥变文》：“偷踪窃道；饮气吞声；风吹草动；即便藏形。”', 1, 1),
(29, '胆大心细', 3, '新', 'dǎn dà xīn xì', '形容办事果断，考虑周密。', '出 处\n《旧唐书·孙思邈传》:“胆欲大而心欲小，智欲圆而行欲方。”', 1, 1),
(30, '心腹之患', 4, '换', 'xīn fù zhī huàn', '比喻要害。比喻隐藏在内部的严重祸害。也泛指最大的隐患。', '出 处\n《后汉书·陈蕃传》：“今寇贼在外；四肢之疾；内政不理；心腹之患。”', 2, 1),
(31, '干柴烈火', 3, '例', 'gān chái liè huǒ ', '形容男女之间强烈情欲要求，多用于不正当的男女关系。也形容情绪高涨。', '出 处清·曹雪芹《红楼梦》第69回：“今日天缘凑巧，竟赏了他，真是一对烈火干柴，如胶投漆，燕尔新婚，连日那里拆的开。', 1, 1),
(32, '油腔滑调', 4, '掉', 'yóu qiāng huá diào ', '形容说话轻浮油滑，不诚恳，不严肃。', '出 处\n清·王士祯《师友诗传录·卷一；郎廷槐问》：“若不多读书；多贯穿；而遽言性情；则开后学油腔滑调信口成章之恶习矣。”', 2, 1),
(33, '百里挑一', 3, '跳', 'bǎi lǐ tiāo yī', '一百个当中就挑出这一个来。形容人才出众。', '出 处清·曹雪芹《红楼梦》第一百二十回：“姑爷年纪略大几岁；并没有娶过的；况且人物儿长的是百里挑一的。”', 1, 1),
(34, '听之任之', 3, '刃', ' tīng zhī rèn zhī ', '任凭事物存在发展而不去过问', '出处\n毛泽东《反对自由主义》：“见损害群众利益的行为不愤恨，不劝告，不制止，不解释，听之任之。”', 2, 1),
(35, '不知轻重', 2, '只', ' bù zhī qīng zhòng', '不懂得事情要紧不要紧。', '出 处\n《吕氏春秋·本生》:“今世之人，惑者多以性养物，则不知轻重也。”', 1, 1),
(36, '智勇双全', 4, '荃', 'zhì yǒng shuāng quán', '又有智谋，又很勇敢。', '出 处元·关汉卿《五侯宴》第三折:“某文通三略，武解六韬，智勇双全 。”', 1, 1),
(37, '明知故问', 1, '名', 'míng zhī gù wèn', '明明知道了，还故意问人家', '出 处\n清·石玉昆《三侠五义》：“……见他这番光景；明知故问道：‘先生为着何事伤心呢？’”', 1, 1),
(38, '同流合污', 4, '巫', ' tóng liú hé wū', '指跟坏人一起干坏事。', '出 处\n《孟子·尽心下》:“同乎流俗，合乎污世。”', 2, 1),
(39, '废物利用', 2, '勿', 'èi wù lì yòng', '使失去原有使用价值的东西发挥其尚有的效用。', '反义词：暴殄天物', 1, 1),
(40, '好高骛远', 3, '務', 'hào gāo wù yuǎn', '比喻不切实际地追求过高过远的目标。', '出 处《宋史·道学传一·程灏传》：“病学者厌卑近而骛高远，卒无成焉。”', 2, 1),
(41, '大发雷霆', 2, '伐', 'dà fā léi tíng', '比喻大发脾气，大声斥责。', '出 处明·凌濛初《初刻拍案惊奇》第十五卷：“陈秀才大发雷霆。”', 1, 1),
(42, '辞旧迎新', 4, '心', 'cí jiù yíng xīn', '告别旧的一年，迎接新的一年的到来，即庆贺新年的意思', '春节是中国最隆重的传统节日。在民间习惯地称为“过年”。', 2, 1),
(43, '轰轰烈烈', 3, '列', 'hōng hōng liè liè', '形容事业的兴旺', '出 处\n宋·文天祥《沁园春·题张许双庙》词：“人生欻翕云亡；好烈烈轰轰一场。”', 1, 1),
(44, '缺一不可', 2, '易', 'quē yī bù kě ', '少一样也不行。', '出 处明·施耐庵《水浒传》第二十回:“林冲道:‘只今番克敌制胜，便见得先生妙法。正是鼎分三足，缺一不可，先生不必推却。’”', 1, 1),
(45, '一言难尽', 4, '近', ' yī yán nán jìn', '形容事情曲折复杂，不是一句话能说清楚的。', '出 处\n元·李直夫《虎头牌》第一折:“我一言难尽，来探望你这歹孩儿索是远路风尘。”', 1, 1),
(46, '口口相传', 3, '厢', 'kǒu kǒu xiāng chuán', '不著文字，口头相传。', '出 处\n宋·张君房《云笈七签》第七十二卷:“经云:‘知白守黑，神明自来。’是知玄为万物母，圣人秘之，不形文字，口口相传。”', 1, 1),
(47, '魂飞魄散', 3, '破', 'hún fēi pò sàn', '吓得连魂魄都离开人体飞散了。形容惊恐万分，极端害怕。', '出 处\n《左传·昭公二十五年》：“心之精爽；是谓魂魄；魂魄去之；何以能久？”', 2, 1),
(48, '虾兵蟹将', 4, '奖', 'xiā bīng xiè jiàng ', '比喻敌人的爪牙或不中用的大小娄罗。', '出 处\n明·吴承恩《西游记》：“东海龙王敖广急忙起身；与龙子龙孙、虾兵蟹将出宫。”', 2, 1),
(49, '不闻不问', 2, '雯', 'bù wén bù wèn', '形容对事情不关心。', '出 处\n清·文康《儿女英雄传》缘起首回：“（唐明皇）除了选色征歌之外；一概付之不闻不问。”', 1, 1),
(50, '废话连篇', 3, '联', ' fèi huà lián piān ', '形容文章或言谈中不必要的废话太多。', '近义词：冗词赘句、离题万里', 2, 1),
(51, '天下太平', 4, '凭', 'tiān xià tài píng', '处处平安无事。指大治之世。', '出 处\n《礼记·仲尼燕君》：“言而履之；礼也；行而乐之；乐也。君子为此二者；以南面而立；夫是以天下太平也。”', 1, 1),
(52, '断子绝孙', 4, '荪', 'duàn zǐ jué sūn', '没有儿子，也没有孙子。指没有后代。', '出 处\n明·柯丹邱《荆钗记》：“你再不娶亲；我只愁你断子绝孙谁拜坟。”', 1, 1),
(53, '男扮女装', 2, '分', 'nán bàn nǚ zhuāng', '男人装扮成女人的样子。', '出处金敬迈《欧阳海之歌》第一章：“缺盐少米的穷苦人，独子也要抓丁。男扮女装也没得用呵。”', 1, 1),
(54, '在所不辞', 4, '磁', 'zài suǒ bù cí', '决不推辞（多用在冒险犯难）。', '出 处\n郭沫若《郑成功》第二章:“国姓爷和你是我的重生父母，只要能够为你们效劳，我就献出生命，在所不辞。”', 2, 1),
(55, '柔中有刚', 1, '揉', ' róu zhōng yǒu gāng', '形容人的性格温柔中带有刚强。', '近义词：刚柔并济', 1, 1),
(56, '死皮赖脸', 3, '癞', 'sǐ pí lài liǎn', '形容厚着脸皮，胡搅蛮缠。', '出 处\n《红楼梦》二十四回：“还亏是我呢；要是别个；死皮赖脸的三日两头儿来缠舅舅；要三升米两升豆子的；舅舅也就没有法儿呢。”', 1, 1),
(57, '有眼无珠', 4, '朱', ' yǒu yǎn wú zhū', '用来责骂人瞎了眼，看不见某人或某事物的伟大或重要。', '出 处\n元·无名氏《举案齐眉》第一　折：“常言道；贤者自贤；愚者自愚；就似那薰莸般各别难同处；怎比你有眼似无珠。”', 1, 1),
(58, '回光返照', 3, '反', 'huí guāng fǎn zhào', '比喻人死前精神突然兴奋。也比喻事物灭亡前夕的表面兴旺', '出 处\n宋·释道原《景德传灯录》第二十六卷：“方便呼为佛；回光返照；看身心是何物。”', 2, 1),
(59, '尔虞我诈', 2, '与', 'ěr yú wǒ zhà', '表示彼此互相欺骗。', '出 处\n先秦·左丘明《左传·宣公十五年》：“我无尔诈，尔无我虞。”', 2, 1),
(60, '一身是胆', 2, '生', 'yī shēn shì dǎn', '形容胆量大，无所畏惧。', '出 处\n晋·陈寿《三国志·蜀志·赵云传》：“以云为翊军将军”裴松之注引《赵云别传》：“先主明旦自来，至云营围视昨战处，曰：‘子龙一身都是胆也！’”', 2, 1),
(61, '趁火打劫', 1, '乘', 'chèn huǒ dǎ jié ', '趁人家失火时去抢劫。比喻乘人之危谋取私利。', '出 处清·颐琐《黄绣球》第三回：“这一天见来的很是不少；黄通理更代为踌躇；怕的是越来越多；容不下去；而且难免有趁火打劫；顺手牵羊的事。”', 2, 1),
(62, '明抢暗偷', 3, '安', 'míng qiǎng àn tōu', '公开抢劫，暗中偷盗。', '出 处碧野《大巴山人》：“最使她痛恨的是，有些坏人滥伐森林，把木材明抢暗偷运出山去贩卖。”', 1, 1),
(63, '臭名昭著', 3, '招', 'chòu míng zhāo zhù', '坏名声人人都知道', '出 处\n郭沫若《洪波曲》第十章：“他们是贺衷寒系统的人；在前方打狗吃；臭名昭著。”', 2, 1),
(64, '小题大做', 4, '故', 'xiǎo tí dà zuò ', '比喻不恰当地把小事当作大事来处理，有故意夸张的意思。', '出 处明·杨聪《玉堂荟记》：“成既被提入京；欲伸前志；每为范木渐所阻；迨苋以艰去；而成遂奏揭纷出；小题大作矣。”', 1, 1),
(65, '层出不穷', 2, '初', 'céng chū bù qióng', '接连不断地出现，没有穷尽。', '出 处\n《宋史·何基传》：“虽一本于（朱）熹；然就其发明；则精义新意；愈出不穷。', 1, 1),
(66, '五体投地', 3, '头', 'wǔ tǐ tóu dì', '是佛教一种最恭敬的行礼仪式。比喻佩服到了极点。', '近义词：心悦诚服、甘拜下风', 1, 1),
(67, '自鸣得意', 2, '名', 'zì míng dé yì', '自以为了不起，表示很得意。', '出 处\n清·蒲松龄《聊斋志异·江城》:“姊妹相逢无他语，惟各以阃威自鸣得意。”', 2, 1),
(68, '不能自拔', 4, '笆', 'bù néng zì bá', '不能主动地从痛苦、错误或罪恶中解脱出来。', '出 处\n《宋书·刘义恭传》:“世祖前锋至新亭，劭挟义恭出战，恒录在左右，故不能自拔。”', 1, 1),
(69, '无微不至', 4, '支', ' wú wēi bù zhì', '没有一处细微的地方不照顾到。形容关怀、照顾得非常细心周到。', '近义词：精细入微、关怀备至', 1, 1),
(70, '旁敲侧击', 3, '测', ' páng qiāo cè jī', '比喻说话、写文章不从正面直接点明，而是从侧面曲折地加以讽刺或抨击。', '出 处\n清·吴趼人《二十年目睹之怪现状》第二十回：“只不过不应该这样旁敲侧击。”', 1, 1),
(71, '知书达礼', 3, '打', 'zhī shū dá lǐ ', '有文化，懂礼仪。', '近义词： 知书识礼、知书明理、通情达理', 1, 1),
(72, '度日如年', 1, '杜', 'dù rì rú nián', '过一天像过一年那样长。形容日子很不好过。', '出 处\n《魏书·苻坚传》：“勋旧亲戚；杀害略尽；王公在者以疾苦归；得度一日如过十年。”', 1, 1),
(73, '曲突徙薪', 4, '鑫', 'qū tū xǐ xīn', '曲：弯；突：烟囱；徙：迁移；薪：柴草。把烟囱改建成弯的，把灶旁的柴草搬走。比喻事先采取措施，才能防止灾祸。', '出 处《汉书·霍光传》：“曲突徙薪无恩泽；焦头烂额为上客。”', 3, 1),
(74, '知足常乐', 3, '长', 'zhī zú cháng lè', '知道满足，就总是快乐。形容安于已经得到的利益、地位。', '出 处先秦·李耳《老子》:“祸莫大于不知足，咎莫大于欲得，故知足之足常足矣。”', 3, 1),
(75, '见异思迁', 4, '干', 'jiàn yì sī qiān', '看见另一个事物就想改变原来的主意。指意志不坚定，喜爱不专一。', '出 处《管子·小匡》：“少而习焉；其心安焉；不见异物而迁焉。”', 1, 1),
(76, '寡言少语', 2, '研', 'guǎ yán shǎo yǔ', '言语很少。形容性格内向，不善言辞。', '近义词：沉默寡言、憨厚寡言', 2, 1),
(77, '遥相呼应', 3, '忽', ' yáo xiāng hū yìng', '远远地互相联系，互相配合。', '出 处《清史稿·许友信传》：“且郑成功出没闽、浙；奉其为号；遥相应和；声势颇张。”', 1, 1),
(78, '饿殍枕藉', 4, '籍', 'è piǎo zhěn jí', '饿殍：饿死的人；枕藉：交叠而卧。饿死的人纵横交叠，形容饥荒之年的悲惨景象。', '出 处\n清·西周生《醒世姻缘传》第32回:“那个庄上不饿殍枕藉。”', 3, 1),
(79, '洗心革面', 2, '信', 'xǐ xīn gé miàn', '清除旧思想，改变旧面貌。比喻彻底悔改。', '出 处晋·葛洪《抱朴子》：“洗心而革面者；必若清波之涤轻尘。”', 1, 1),
(80, '举一反三', 1, '狙', 'ǔ yī fǎn sān', '比喻从一件事情类推而知道其他许多事情。', '出 处\n《论语·述而》：“举一隅不以三隅反；则不复也。”', 1, 1),
(81, '死心塌地', 4, '递', 'sǐ xīn tā dì', '原指死了心，不作别的打算。后常形容打定了主意，决不改变。', '出 处\n元·乔孟符《鸳鸯被》：“这洛阳城刘员外；他是个有钱贼；只要你还了时；方才死心塌地。”', 1, 1),
(82, '筚路蓝缕', 4, '蒌', 'bì lù lán lǚ', '筚路：柴车；蓝缕：破衣服。驾着简陋的车，穿着破烂的衣服去开辟山林。形容创业的艰苦。', '出 处\n《左传·宣公十二年》：“筚路蓝缕；以启山林。”', 3, 1),
(83, '人心不古', 4, '谷', 'rén xīn bù gǔ', '古：指古代的社会风尚。旧时指人心奸诈、刻薄，没有古人淳厚', '出 处\n清·李汝珍《镜花缘》第五十五回:“奈近来人心不古，都尚奢华。”', 2, 1),
(84, '可见一斑', 4, '班', 'kě jiàn yī bān', '斑：杂色的花纹或斑点。比喻见到事物的一少部分也能推知事物的整体。', '出 处清·李汝珍《镜花缘》：“诸如此类；虽未得其皮毛；也就略见一斑了。”', 2, 1),
(85, '头头是道', 3, '事', ' tóu tóu shì dào', '本为佛家语，指道无所不在。后多形容说话做事很有条理。', '出 处\n《续传灯录·慧力洞源禅师》:“方知头头皆是道，法法本圆成。”', 2, 1),
(86, '夫唱妇随', 4, '髓', 'fū chàng fù suí', '随：附和。原指封建社会认为妻子必须服从丈夫，后比喻夫妻和好相处。', '出 处\n元·马致远《马丹阳三度任风子》：“你道是夫唱妇随；夫荣妻贵。”', 1, 1),
(87, '刻舟求剑', 2, '周', 'kè zhōu qiú jiàn', '舟：船。求：寻找。比喻拘泥不知变通，不懂得根据实际情况处理问题。', '近义词：按图索骥、缘木求鱼', 1, 1),
(88, '九死一生', 4, '升', 'jiǔ sǐ yī shēng', '九：表示极多。形容经历很大危险而幸存。也形容处在生死关头，情况十分危急。', '出 处\n战国·楚·屈原《离骚》：“亦余心之所善兮；虽九死其犹未悔。”唐·刘良注：“虽九死无一生；未足悔恨。”', 1, 1),
(89, '万象更新', 4, '心', 'wàn xiàng gēng xīn', '万象：宇宙间一切景象；更：变更。事物或景象改换了样子，出现了一番新气象。', '出 处\n清·曹雪芹《红楼梦》：“如今正是初春时节；万物更新；正该鼓舞另立起来才好。”', 2, 1),
(90, '螳臂挡车', 3, '档', 'táng bì dǎng chē', '比喻自不量力，招致失败。同“螳臂当车”。', '同“螳臂当车”', 2, 1),
(91, '痛心疾首', 4, '收', 'tòng xīn jí shǒu', '疾首：头痛。形容痛恨到了极点。', '出处《左传·成公十三年》：“诸侯备闻此言；斯是痛心疾首；昵就寡人。”', 1, 1),
(92, '不出所料', 4, '廖', 'bù chū suǒ liào', '事由变化，在预料之中。形容原先预料的准确。', '近义词：果不其然、料事如神', 1, 1),
(93, '横扫千军', 1, '恒', 'héng sǎo qiān jūn', '横扫：扫荡、扫除。把大量敌军象扫地似地一阵子扫除掉。', '出 处\n唐·杜甫《醉歌行》:“词源倒流三峡水，笔阵独扫千人军。”', 1, 1),
(94, '巾帼英雄', 2, '掴', 'jīn guó yīng xióng', '巾帼：古代妇女配戴的头巾和发饰，后借指妇女。指女子中的英雄。', '出处\n《晋书》：“亮遗懿巾帼妇人之饰以辱之。”', 2, 1),
(95, '自惭形秽', 4, '岁', 'zì cán xíng huì', '形秽：形态丑陋，引伸为缺点。因为自己不如别人而感到惭愧。', '出处\n南北朝·刘义庆《世说新语·容止》：“珠玉在侧；觉我形秽。”', 3, 1),
(96, '壮士断腕', 3, '端', 'zhuàng shì duàn wàn', '指勇士手腕被蝮蛇咬伤，就立即截断，以免毒性扩散全身。比喻作事要当机立断，不可迟疑、姑息。', '出处\n唐·窦皐《述书赋下》:“君子弃瑕以拔才，壮士断腕以全质。”', 3, 1),
(97, '分道扬镳', 4, '镖', ' fēn dào yáng biāo', '分路而行。比喻目标不同，各走各的路或各干各的事。', '出处\n《北史·河间公齐传》：孝文曰：‘洛阳；我之丰沛；自应分路扬镳。', 2, 1),
(98, '得陇望蜀', 2, '垄', 'dé lǒng wàng shǔ', '陇：指甘肃一带；蜀：指四川一带。已经取得陇右，还想攻取西蜀。比喻贪得无厌。', '唐·李白《古风》诗：“物苦不知足；～”。', 2, 1),
(99, '断袖之癖', 4, '僻', 'duàn xiù zhī pǐ', '原指男子的同性恋行为，现男女不限。', '出处\n《汉书·董贤传》:“常与上卧起。尝昼寝，偏藉上袖，上欲起，贤未觉，不欲动贤，乃断袖而起。”', 2, 1),
(100, '虎视眈眈', 2, '噬', 'hǔ shì dān dān', '虎视：像老虎那样看着。眈眈：注视的样子。形容凶狠而贪婪地注视着，伺机攫取。', '出处\n《周易·颐》：“虎视眈眈；其欲逐逐”', 2, 1),
(101, '胡服骑射', 3, '奇', 'hú fú qí shè', '胡：古代指北方和西文的少数民族。指学习胡人的短打服饰，同时也学习他们的骑马、射箭等武艺。', '出处\n《战国策·赵策二》:“今吾（赵武灵王）将胡服骑射以教百姓。”', 2, 1),
(102, '诚惶诚恐', 2, '慌', 'chéng huáng chéng kǒng', '诚：实在，的确；惶：害怕；恐：畏惧。非常小心谨慎以至达到害怕不安的程度。', '出处\n汉·许冲《上说文解字书》：“臣冲诚惶诚恐；顿首顿首；死罪死罪。”', 2, 1),
(103, '横行霸道', 2, '衍', 'héng xíng bà dào', '横行：行动蛮横仗势做坏事；霸道：蛮不讲理。依仗权势为非作歹。', '出 处\n清·曹雪芹《红楼梦》：“（贾瑞）又助着薛蟠图些银钱酒肉；一任薛蟠～；他不但不去管约；反‘助纣为虐’讨好儿。”', 2, 1),
(104, '病入膏肓', 3, '髙', 'bìng rù gāo huāng', '膏肓：古人把心尖脂肪叫“膏”，心脏与膈膜之间叫“肓”。形容病情十分严重，无法医治。比喻事情到了无法挽救的地步。', '出处\n《左传·成公十年》：“医生；曰：‘疾不可为也。在肓之上；膏之下；攻之不可；达之不及；药不至焉；不可为也。’”', 2, 1),
(105, '开源节流', 3, '截', 'kāi yuán jié liú', '开：劝课；源：水源。开发水源，节制水流。比喻增加收入，节省开支。', '出处\n《荀子·富国》：“故明主必谨养其和；节其流；开其源；而时斟酌焉。”', 2, 1),
(106, '五子登科', 4, '柯', 'wǔ zǐ dēng kē', '用作结婚的祝福词或吉祥语。', '出处\n《宋史·窦仪传》记载:宋代窦禹钧的五个儿子仪、俨、侃、偁、僖相继及第，故称“五子登科”。', 2, 1),
(107, '三阳开泰', 2, '洋', 'sān yáng kāi tài', '《周易》称爻连的为阳卦，断的为阴爻，正月为泰卦，三阳生于下；冬去春来，阴消阳长，有吉亨之象。常用以称颂岁首或寓意吉祥。', '出处\n《易·泰》：“泰，小往大来，吉亨。”《宋史·乐志》：“三阳交泰，日新惟良。”', 2, 1),
(108, '休戚相关', 2, '息', 'xiū qī xiāng guān', '休：欢乐，吉庆；戚：悲哀，忧愁。忧喜、福祸彼此相关联。形容关系密切，利害相关。', '出处\n宋·陈亮《送陈给事去国启》：“眷此设心；无非体国；然用舍之际；休戚相关。”', 2, 1),
(109, '聊胜于无', 1, '了', 'liáo shèng yú wú', '聊：略微。比没有要好一点。', '出处\n晋·陶潜《和刘柴桑》：“弱女虽非男；慰情聊胜无。”', 3, 1),
(110, '人情世故', 3, '事', 'rén qíng shì gù', '为人处世的道理。', '出处\n宋·文天祥《送僧了敬序》:“姑与之委曲于人情世故之内。”', 2, 1),
(111, '玩世不恭', 2, '事', 'wán shì bù gōng', '玩世：以消极、玩弄的态度对待生活；不恭：不严肃。因对现实不满而采取的一种不严肃、不认真的生活态度。', '出处\n明·李开先《雪蓑道人传》：“醉后高歌起舞；更有风韵；只是玩世不恭；人难亲近耳。”', 2, 1),
(112, '小时了了', 3, '寥', 'xiǎo shí liǎo liǎo', '指人不能因为少年时聪明而断定他日后定有作为。', '出处\n南朝·宋·刘义庆《世说新语·言语》：“小时了了，大未必佳。”', 3, 1),
(113, '朝令夕改', 3, '昔', 'zhāo lìng xī gǎi', '早晨发布的命令，晚上就改了。比喻经常改变主张和办法，一会儿一个样。', '出处\n《汉书·食货志上》：“急政暴虐；赋敛不时；朝令而暮改。”', 2, 1),
(114, '青山不老', 1, '菁', 'qīng shān bù lǎo', '比喻永存。也比喻时间久长。', '出处\n明·罗贯中《三国演义》第六十回:“青山不老，绿水长存。他日事成，必当后报。”', 2, 1),
(115, '王侯将相', 2, '候', 'wáng hóu jiàng xiàng', '泛指封建社会中位尊、禄厚、权重、势大的贵族。', '出处\n《史记·陈涉世家》:“且壮士不死即已，死即举大名耳，王侯将相宁有种乎！”', 2, 1),
(116, '走马观花', 3, '管', 'zǒu mǎ guān huā', '走马：骑着马跑。骑在奔跑的马上看花。原形容事情如意，心境愉快。后多指大略地观察一下。', '出 处\n唐·孟郊《登科后》诗:“春风得意马蹄疾，一日看尽长安花。”', 2, 1),
(117, '人生如梦', 2, '笙', 'rén shēng rú mèng', '人生如同一场梦。形容世事无定，人生短促。', '出处\n宋·苏轼《念奴娇·赤壁怀古》词:“人生如梦，一樽还酹江月。”', 2, 1),
(118, '不言而喻', 4, '瑜', 'bù yán ér yù', '喻：了解，明白。不用说话就能明白。形容道理很明显。', '出 处\n《孟子·尽心上》：“君子所性……施于四体；四体不言而喻。”', 2, 1),
(119, '念念不忘', 4, '望', 'niàn niàn bù wàng', '念念：时刻思念着。形容牢记于心，时刻不忘。', '出 处\n宋·朱熹《朱子全书·论语》：“其言于忠信笃敬；念念不忘。”', 2, 1),
(120, '时过境迁', 3, '竟', 'shí guò jìng qiān', '迁：变动。随着时间的推移，情况发生变化。', '出 处\n清·梁启超《新中国未来记》：“到现在时过境迁；这部书自然没甚用处……”', 2, 1),
(121, '义愤填膺', 4, '鹰', ' yì fèn tián yīng', '义愤：对违反正义的事情所产生的愤怒；膺：胸。发于正义的愤懑充满胸中。', '出处\n南北朝·江淹《恨赋》：“置酒欲饮；悲来填膺。”', 2, 1),
(122, '不惑之年', 2, '或', ' bù huò zhī nián', '不惑：遇到事情能明辨不疑。以此作为40岁的代称。', '出 处\n先秦·孔子《论语·为政》：“四十而不惑。”', 2, 1),
(123, '克己复礼', 2, '已', 'kè jǐ fù lǐ', '克：克制。儒家指约束自己，使每件事都归于“礼”。', '出处\n《论语·颜渊》:“颜渊问仁。子曰:‘克己复礼为仁。一日克己复礼，天下归仁焉！为仁由己，而由人乎哉？’”', 2, 1),
(124, '回眸一笑', 2, '哞', 'huí móu yī xiào', '眸：眼珠。转动眼珠，嫣然一笑。常用以形容女子妩媚的表情。', '出 处\n唐·白居易《长恨歌》:“回眸一笑百媚生，六宫粉黛无颜色。”', 2, 1),
(125, '所向披靡', 4, '糜', 'suǒ xiàng pī mǐ ', '所向：指力所到达的地方；披靡：溃败。比喻力量所达到的地方，一切障碍全被扫除。', '出处\n《梁书·萧确传》：“钟山之役；确苦战；所向披靡；群虏惮之。”', 2, 1),
(126, '义薄云天', 2, '簿', 'yì bó yún tiān', '正义之气直上高空。形容为正义而斗争的精神极其崇高。', '出 处\n《宋书·谢灵运传论》：“屈平、宋玉，导清源于前，贾谊、相如，振芳尘于后，英辞润金石，高义薄云天。”', 2, 1),
(127, '鞭辟入里', 2, '噼', 'biān pì rù lǐ ', '鞭辟：鞭策，激励；里：最里层。形容作学问切实。也形容分析透彻，切中要害。', '出 处\n盛宣怀《上张香帅书》：“侄忝承付托，责无旁贷，必当鞭辟入里，成一完全商办大厂，为天下创。”', 2, 1),
(128, '夜郎自大', 2, '狼', 'yè láng zì dà', '夜郎：汉代西南地区的一个小国。比喻人无知而又狂妄自大。', '出 处\n清·蒲松龄《聊斋志异·卷六·绛妃》：“驾炮车之狂云；遂以夜郎自大；恃贪狼之逆气；漫以河伯为尊。”', 2, 1),
(129, '天网恢恢', 1, '枉', 'tiān wǎng huī huī', '天网：天道之网；恢恢：宽广的样子。指天道如大网，坏人是逃不过这个网的，作恶必受到惩罚。', '出 处\n《老子》:“天网恢恢，疏而不失。”', 1, 1),
(130, '噤若寒蝉', 1, '禁', 'jìn ruò hán chán', '噤：闭口不作声。像深秋的蝉那样一声不吭。比喻因害怕有所顾虑而不敢说话。', '出 处\n宋·张守《题锁树谏图后》：“尝怪士处明时；事贤主；履高位；噤如寒蝉；或至导谀以误国。”', 2, 1),
(131, '荦荦大端', 4, '段', ' luò luò dà duān', '荦荦：清楚、分明的样子。指主要的项目，明显的要点。', '出 处\n《史记·天官书》：“此其荦荦大者，若至委曲小变，不可胜道。”', 3, 1),
(132, '心照不宣', 2, '昭', 'xīn zhào bù xuān', '照：知道；宣：公开说出。彼此心里明白，而不公开说出来。', '出 处\n清·曾朴《孽海花》：“张夫人吩咐尽管照旧开轮；大家也都心照不宣了。”', 2, 1),
(133, '耿耿于怀', 4, '淮', 'gěng gěng yú huái', '耿耿：有心事的样子。不能忘怀，牵萦于心。', '出 处\n宋·慕容彦逢《摛文堂集》：“公圭侯印人所忧；利锁名韁吾所羞；耿耿有怀非隐忧；思得佳士从之游。”', 2, 1),
(134, '丧心病狂', 1, '伤', 'sàng xīn bìng kuáng', '丧失理智,像发了疯一样。形容言行昏乱而荒谬,或残忍可恶到了极点。', '出 处\n《宋史·范如圭传》：“如圭独以书责桧以曲学倍师；忘仇辱国之罪；且曰：‘公不丧心病狂；奈何为此？必遗臭万世矣。’”', 2, 1),
(135, '望尘莫及', 1, '忘', 'wàng chén mò jí ', '莫：不；及：赶上。望见前面骑马的人走过扬起的尘土而不能赶上。比喻远远落在后面。', '出 处\n《后汉书·赵咨传》：“复拜东海相；之官；道经荥阳；令敦煌曹暠；咨之故孝廉也。迎路谒候；咨不为留。暠送至亭次；望尘不及。”', 2, 1),
(136, '气喘吁吁', 2, '瑞', 'qì chuǎn xū xū', '形容呼吸急促，大声喘气。', '出 处\n明·冯梦龙《醒世恒言》：“李勉向一条板凳上坐下；觉得气喘吁吁。”', 1, 1),
(137, '戛然而止', 1, '夹', ' jiá rán ér zhǐ', '戛：象声词。形容声音突然终止。', '出 处\n《歧路灯》：“忽得锣鼓戛然而止；戏已煞却。”', 2, 1),
(138, '分庭抗礼', 4, '理', 'fēn tíng kàng lǐ', '庭：庭院；抗礼：平等行礼。原指宾主相见，分站在庭的两边，相对行礼。现比喻平起平坐，彼此对等的关系。', '出 处\n《庄子·渔父》：“万乖之主；千乖之君；见天子未尝不分庭伉礼；夫子犹有倨敖之容。”', 2, 1),
(139, '至理名言', 1, '致', 'zhì lǐ míng yán', '至：最；名：有名声的。最正确的道理，最精辟的言论。', '出 处\n老舍《鼓书艺人》十二:“‘你不自轻自贱，人家就不能看轻你’。这话倒说得不错，这也是至理名言。”', 2, 1),
(140, '秀色可餐', 4, '馋', 'xiù sè kě cān', '秀色：美女姿容或自然美景；餐：吃。原形容妇女美貌。后也形容景物秀丽。', '出 处\n晋·陆机《日出东南隅行》：“鲜肤一何润；秀色若可餐。”', 2, 1),
(141, '觥筹交错', 4, '措', 'gōng chóu jiāo cuò', '觥：古代的一种酒器；筹：行酒令的筹码。酒杯和酒筹杂乱地放着。形容许多人聚会喝酒时的热闹场景。', '出 处\n宋·欧阳修《醉翁亭记》：“射者中；奕者胜；觥筹交错；坐起而喧哗者；众宾欢也。”', 2, 1),
(142, '卧冰求鲤', 4, '鱼', 'wò bīng qiú lǐ', '讲述晋人王祥冬天为继母在冰上捕鱼的事情，被后世奉为奉行孝道的经典故事。', '出处\n晋 干宝《搜神记》卷十一：“﹝ 王祥 ﹞母常欲生魚，時天寒冰凍，祥 解衣，將剖冰求之，冰忽自解，雙鯉躍出。”', 2, 1),
(143, '防微杜渐', 3, '社', 'fáng wēi dù jiàn', '微：微小；杜：堵住；渐：指事物的开端。比喻在坏事情坏思想萌芽的时候就加以制止，不让它发展。', '出 处\n《后汉书·丁鸿传》：“若敕政责躬；杜渐防萌；则凶妖销灭；害除福凑矣。”', 2, 1),
(144, '钟灵毓秀', 2, '炅', 'zhōng líng yù xiù', '钟：凝聚，集中；毓：养育。凝聚了天地间的灵气，孕育着优秀的人物。指山川秀美，人才辈出。', '出 处\n清·曹雪芹《红楼梦》第三十六回：“真真有负天地钟灵毓秀之德了。”', 2, 1),
(145, '沁人心脾', 1, '泌', 'qìn rén xīn pí', '沁：渗入。原指芳香凉爽的空气或饮料使人感到舒适。也形容诗歌和文章优美动人，给人清新爽朗的感觉。', '出 处\n宋·林洪《冷泉亭》诗:“一泓清可沁诗脾。”', 2, 1),
(146, '义无反顾', 4, '故', 'yì wú fǎn gù', '义：道义；反顾：向后看。从道义上只有勇往直前，不能犹豫回顾。', '出 处\n汉·司马相如《喻巴蜀檄》:“触白刃，冒流矢，义不反顾，计不旋踵。”', 2, 1),
(147, '字字珠玑', 4, '叽', 'zì zì zhū jī', '珠玑：珠子。每个字都像珍珠一样。比喻说话、文章的词句十分优美。', '出 处\n清·文康《儿女英雄传》：“任凭是篇篇锦锈；字字珠玑；会不上一名进士。”', 2, 1),
(148, '穷兵黩武', 3, '牍', 'qióng bīng dú wǔ', '穷：竭尽；黩：随便，任意。随意使用武力，不断发动侵略战争。形容极其好战。', '出 处三国·曹丕《车驾临江还诏三公》：“三世为将；道家所忌；穷兵黩武；古有成戒。”', 3, 1),
(149, '左右逢源', 4, '原', 'zuǒ yòu féng yuán', '逢：遇到；源：水源。到处遇到充足的水源。原指赏识广博，应付裕如。后也比喻做事得心应手，非常顺利。', '“左右逢源”为谜底的谜语\n1.舍南舍北皆春水（打一成语谜）\n2.两个逢字头对头（打一成语', 2, 1),
(150, '墨守成规', 1, '默', 'mò shǒu chéng guī ', '墨守：战国时墨翟善于守城；成规：现成的或久已通行的规则、方法。指思想保守，守着老规矩不肯改变。', '出 处明·黄宗羲《钱退山诗文序》：“如钟嵘之《诗品》；辨体明宗；固朱尝墨守以为准的也。”', 3, 1),
(151, '颐指气使', 4, '吏', 'yí zhǐ qì shǐ', '颐指：动下巴示意，指挥别人；气使：用神情气色支使人。不说话而用面部表示表情示意。形容有权势的人指挥别人的傲慢态度。', '出 处\n唐·元稹《追封李逊母崔氏博陵郡太君》：“今逊等有地千里；有禄万钟；颐指气使；无不随顺；所不足者；其唯风树寒泉之思乎！”', 2, 1),
(152, '人心不古', 2, '生', 'rén xīn bù gǔ', '古：指古代的社会风尚。旧时指人心奸诈、刻薄，没有古人淳厚。', '出 处\n清·李汝珍《镜花缘》第五十五回:“奈近来人心不古，都尚奢华。”', 1, 1),
(153, '甘之如饴', 4, '怡', 'gān zhī rú yí ', '甘：甜；饴：麦芽糖浆。感到像糖那样甜。指为了从事某种工作，甘愿承受艰难、痛苦。', '出 处\n宋·真德秀《送周天骥序》：“非义之富贵；远之如垢污；不幸而贱贫；甘之如饴蜜。”', 2, 1),
(154, '进退维谷', 3, '潍', 'jìn tuì wéi gǔ', '维：相当于“是”；谷：比喻困境。无论是进还是退，都是处在困境之中。形容进退两难。', '“进退维谷”为谜底的谜语\n1.只缘身在此山中（打一成语）', 2, 1),
(155, '嗤之以鼻', 4, '擤', 'chī zhī yǐ bí ', '嗤：讥笑。用鼻子吭声冷笑。表示轻蔑。', '“嗤之以鼻”为谜底的谜语\n1.鼻嗤（打一成语）', 2, 1),
(156, '敬谢不敏', 4, '明', 'jìng xiè bù mǐn', '谢：推辞；不敏：不聪明，没有才能。恭敬地表示能力不够或不能接受。多作推辞做某事的婉辞。', '出处\n《左传·襄公三十一年》：“使士文伯谢不敏焉。”', 2, 1),
(157, '身体力行', 3, '立', 'shēn tǐ lì xíng', '身：亲身；体：体验。亲身体验，努力实行。', '出 处\n《淮南子·氾论训》:“圣人以身体之。”《礼记·中庸》:“力行近乎仁。”', 2, 1),
(158, '司空见惯', 3, '贝', 'sī kōng jiàn guàn', '司空：古代官名。指某事常见，不足为奇。', '出 处\n唐·孟棨《本事诗·情感》：“刘于席上赋诗；曰……司空见惯浑闲事；断尽江南刺史肠。”', 2, 1),
(159, '怙恶不悛', 4, '俊', 'hù è bù quān', '怙：依靠，依仗；悛：改过，悔改。坚持作恶，不肯悔改。', '出 处先秦《左传·隐公六年》：“长恶不悛；从自及也虽欲救之；其将能乎？”', 3, 1),
(160, '不落窠臼', 3, '巢', 'bù luò kē jiù', '窠：鸟巢；臼：舂米的石器。比喻有独创风格，不落旧套。', '出 处明·胡应麟《诗薮》：“初学必从此入门；庶不落小家窠臼。”', 3, 1),
(161, '秦晋之好', 3, '致', 'qín jìn zhī hǎo', '春秋时，秦晋两国不止一代互相婚嫁。泛指两家联姻。', '“秦晋之好”为谜底的谜语\n1.秦和晋结婚（打一成语）', 2, 1),
(162, '周而复始', 3, '覆', 'zhōu ér fù shǐ', '周：环绕一圈；复：又，再。转了一圈又一圈，不断循环。', '“周而复始”为谜底的谜语\n1.又逢星期一（打一成语）', 2, 1),
(163, '居安思危', 4, '威', ' jū ān sī wēi', '居：处于；思：想。虽然处在平安的环境里，也想到有出现危险的可能。指随时有应付意外事件的思想准备。', '出处\n春秋·左丘明《左传·襄公十一年》：“居安思危，思则有备，有备无患，敢以此规。”', 2, 1),
(164, '宠辱不惊', 4, '敬', 'chǒng rǔ bù jīng', '宠：宠爱。受宠受辱都不在乎。指不因个人得失而动心。', '出 处《新唐书·卢承庆传》：“宠辱不惊；考中上。其能著人善类此。”', 2, 1),
(165, '集腋成裘', 1, '积', 'jí yè chéng qiú', '腋：腋下，指狐狸腋下的皮毛；裘：皮衣。狐狸腋下的皮虽很小，但聚集起来就能制一件皮袍。比喻积少成多。', '出 处《慎之·知忠》：“狐白之裘；盖非一狐之腋也。”', 3, 1),
(166, '重见天日', 4, '目', 'chóng jiàn tiān rì', '重新看到了天和太阳。比喻脱离黑暗，重见光明。', '出 处\n明·冯梦龙《古今小说》：“幸天兵得胜；倭贼败亡；我等指望重见天日；不期老将军不行细审；一概捆吊。”', 1, 1),
(167, '朝秦暮楚', 3, '慕', 'zhāo qín mù chǔ', '战国时期，秦楚两个诸侯大国相互对立，经常作战。有的诸侯小国为了自身的利益与安全，时而倾向秦，时而倾向楚。比喻人反复无常。', '出 处\n明·毕魏《竹叶舟》：“因见贵戚王恺；富堪敌国；比太仆更觉奢华；为此我心未免朝秦暮楚。”', 2, 1),
(168, '同仇敌忾', 2, '愁', 'tóng chóu dí kài', '同仇：共同对敌；敌：对抗，抵拒；忾：愤怒。指全体一致痛恨敌人。', '出 处\n《诗经·秦风·无衣》:“修我戈矛，与子同仇。”《左传·文公四年》:“诸侯敌王所忾，而献其功。”', 2, 1),
(169, '逝者如斯', 4, '厮', 'shì zhě rú sī', '用以形容光阴如流水一去不返。', '出 处\n《论语·子罕》：“子在川上曰：‘逝者如斯夫！不舍昼夜。’”', 2, 1),
(170, '劝百讽一', 2, '伯', 'quàn bǎi fěng yī', '形容规讽正道的言辞远远及不上劝诱奢靡的言辞。意在使人警戒，但结果却适得其反。', '出 处\n《史记·司马相如列传》:“扬雄以为靡丽之赋，劝百而讽一，犹驰骋郑卫之声，曲终而奏雅，不已亏乎？”', 2, 1),
(171, '九关虎豹', 2, '官', ' jiǔ guān hǔ bào', '比喻凶残的权臣。', '出 处语出《楚辞·招魂》:“虎豹九关，啄害下人些。”', 3, 1),
(172, '和光同尘', 1, '合', 'hé guāng tóng chén', '和、同：混合。和光：混合各种光彩；同尘：与尘俗相同。指不露锋芒，与世无争的和平处事方法。', '出 处\n《老子》：“和其光；同其尘。”', 3, 1),
(173, '物竞天择', 2, '竟', 'wù jìng tiān zé', '物竞：生物的生存竞争；天择：自然选择。生物相互竞争，能适应者生存下来。原指生物进化的一般规律，后也用于人类社会的发展。', '出 处\n清·梁启超《新中国未来记》第三回:“因为物竞天择的公理，必要顺应著那时势的，才能够生存。”', 2, 1),
(174, '潸然泪下', 1, '衫', 'shān rán lèi xià', '潸然：流泪的样子。形容眼泪流下来。', '出 处\n宋·马廷鸾《题汪水云诗》：“余展读甲子初作；微有汗出；读至丙子诸作；潸然泪下。”', 2, 1),
(175, '闻过则喜', 1, '问', 'wén guò zé xǐ', '过：过失；则：就。听到别人批评自己的缺点或错误，表示欢迎和高兴。指虚心接受意见。', '出 处\n唐·韩愈《答冯宿书》：“然子路闻其过则喜；禹闻昌言则下车拜。”', 2, 1),
(176, '不法之徒', 4, '徙', 'bù fǎ zhī tú', '1.歹徒或逃犯，流窜或犯有暴力行为罪行的亡命之徒。2.对抗或违反法律的人。', '近义词：不轨之徒、不逞之徒', 2, 1),
(177, '历历在目', 4, '日', 'lì lì zài mù', '历历：清楚，分明的样子。指远方的景物看得清清楚楚，或过去的事情清清楚楚地重现在眼前。', '出 处\n明·冯梦龙《醒世恒言》：“一座青州城正临在北窗之下；见州里人家；历历在目。”', 2, 1),
(178, '钟鸣鼎食', 3, '钉', 'zhōng míng dǐng shí ', '钟：古代乐器；鼎：古代炊器。击钟列鼎而食。形容贵族的豪华排场。', '出 处\n汉·张衡《西京赋》：“击钟鼎食；连骑相过。”', 2, 1),
(179, '根深蒂固', 3, '帝', 'gēn shēn dì gù', '比喻基础深厚，不容易动摇。', '出 处\n《韩非子·解老》：“柢固则生长；根深则视久。”', 2, 1),
(180, '今非昔比', 3, '夕', 'jīn fēi xī bǐ', '昔：过去。现在不是过去能比得上的。多指形势、自然面貌等发生了巨大的变化。', '出 处\n宋·崔与之《崔清献公集·与循州宋守书》：“循南中佳郡；今非昔比矣。”', 1, 1),
(181, '众矢之的', 4, '地', 'zhòng shǐ zhī dì', '矢：箭；的：箭靶的中心。众箭所射的靶子。比喻大家攻击的对象。', '出 处\n清·谭嗣同《报贝元徵》：“今之原祸始音；必以合肥为丛矢之的。”', 2, 1),
(182, '粉墨登场', 4, '畅', ' fěn mò dēng chǎng', '粉、墨：搽脸和画眉用的化妆品。原指演员化妆上台演戏。比喻坏人经过一番打扮，登上政治舞台。', '出 处\n明·张岱《祭义伶文》：“汝生前；傅粉登场努眼张舌；喜笑鬼浑；观者绝倒；听者喷饭。”', 2, 1),
(183, '火中取栗', 4, '粟', 'huǒ zhōng qǔ lì', '偷取炉中烤熟的栗子。比喻受人利用，冒险出力却一无所得。', '出 处\n故事见十七世纪法国寓言诗人拉·封登的寓言《猴子与猫》。', 2, 1),
(184, '不可名状', 3, '明', 'bù kě míng zhuàng', '名：用言语说出；状：描绘，形容。无法用语言来形容。', '出 处\n晋·葛洪《神仙传》：“光彩耀目；不可名状。”', 2, 1),
(185, '颠倒乾坤', 2, '到', ' diān dǎo qián kūn', '比喻本领十分高强。', '近义词：颠倒是非、混淆黑白、指鹿为马、颠倒阴阳', 1, 1),
(186, '目无全牛', 1, '日', 'mù wú quán niú', '全牛：整个一头牛。眼中没有完整的牛，只有牛的筋骨结构。比喻技术熟练到了得心应手的境地。', '出 处\n《庄子·养生说》:“始臣之解牛之时，所见无非牛者；三年之后，未尝见全牛也。”', 2, 1),
(187, '以儆效尤', 2, '敬', 'yǐ jǐng xiào yóu', '儆：使人警醒，不犯错误；效：仿效，效法；尤：过失。指处理一个坏人或一件坏事，用来警告那些学着做坏事的人。', '出 处\n清·李绿园《歧路灯》：“自宜按律究办；以儆效尤。”', 2, 1),
(188, '本末倒置', 2, '未', ' běn mò dào zhì ', '本：树根；末：树梢；置：放。比喻把主次、轻重的位置弄颠倒了。', '出 处\n宋·朱熹《朱文公文集》：“昨所献疑；本末倒置之病。”', 2, 1),
(189, '安然无恙', 4, '羊', 'ān rán wú yàng', '恙：病。原指人平安没有疾病。现泛指事物平安未遭损害。', '出 处\n明·冯梦龙《醒世恒言》第二十九卷：“按院照旧供职；陆公安然无恙。”', 1, 1),
(190, '万马齐喑', 4, '暗', 'wàn mǎ qí yīn ', '喑：哑。所有的马都沉寂无声。旧时形容人民不敢讲话。现也比喻沉闷的政治局面。', '出 处\n宋·苏轼《三马图赞》序:“时西域贡马……振鬣长鸣，万马皆瘖。”', 2, 1),
(192, '岂有此理', 4, '埋', 'qǐ yǒu cǐ lǐ', '哪有这个道理。指别人的言行或某一事物极其荒谬。', '出 处\n《南齐书·虞悰传》：“悰窃叹曰：‘王、徐遂缚袴废天子；天下岂有此理邪？’”', 1, 1),
(193, '绿树成荫', 4, '茵', 'lǜ shù chéng yīn', '形容树木枝叶茂密，遮蔽了阳光。', '近义词：绿叶成阴', 2, 1),
(194, '自欺欺人', 1, '白', 'zì qī qī rén', '欺骗自己，也欺骗别人。', '出 处\n宋·朱熹《朱子语类》：“因说自欺欺人；曰：‘欺人也是自欺；此又是自欺之甚者。’”', 1, 1),
(195, '惊涛骇浪', 3, '赅', 'jīng tāo hài làng', '涛：大波浪；骇：使惊怕。汹涌吓人的浪涛。比喻险恶的环境或尖锐激烈的斗争。', '出 处\n唐·田颖《玉山常文集·海云楼记》（抄本）：“人当既静之时；每思及前此所经履之惊涛骇浪；未尝不惕然。”', 2, 1),
(196, '登峰造极', 2, '锋', 'dēng fēng zào jí', '登：上；峰：山顶；造：到达；极：最高点。比喻学问、技能等达到最高的境界或成就。', '出 处\n南朝·宋·刘义庆《世说新语·文学》：“不知便可登峰造极否？”', 2, 1),
(197, '无动于衷', 4, '忠', 'wú dòng yú zhōng', '衷：内心。心里一点儿也没有触动。指对应该关心、注意的事情毫不关心，置之不理。', '出 处\n清·蒲松龄《聊斋志异》：“闻之默然良久；若不能无动于衷者。”', 2, 1),
(198, '文过饰非', 3, '是', 'wén guò shì fēi', '文、饰：掩饰；过、非：错误。用漂亮的言词掩饰自己的过失和错误。', '近义词：饰非掩过、怙恶不悛', 2, 1),
(199, '喜出望外', 3, '忘', 'xǐ chū wàng wài', '望：希望，意料。由于没有想到的好事而非常高兴。', '出 处\n宋·苏轼《与李之仪书》:“契阔八年，岂谓复有见日？渐近中原，辱书尤数，喜出望外。”', 1, 1),
(200, '数典忘祖', 4, '租', 'shǔ diǎn wàng zǔ', '数：数着说；典：指历来的制度、事迹。谈论历来的制度、事迹时，把自己祖先的职守都忘了。比喻忘本。也比喻对于本国历史的无知。', '出 处\n清·袁枚《小仓山房尺牍》：“枚祖籍慈溪；为兄部民；因生长杭州；数典忘祖。”', 2, 1),
(201, '心有余悸', 4, '季', 'xīn yǒu yú jì', '悸：因害怕而心跳得厉害。危险的事情虽然过去了，回想起来心里还害怕。', '出 处\n孙犁《奋勇地前进、战斗—在一次座谈会上的发言》:“如果他第一次在路上遇到的只是井绳，他就不会心有余悸了。”', 2, 1),
(202, '参差不齐', 1, '叁', 'cēn cī bù qí', '参差：长短、高低不齐。形容水平不一或很不整齐。', '出 处\n汉·扬雄《法言·序目》：“因君将相；卿士名臣；参差不齐；一概诸圣。”', 2, 1),
(203, '开门见山', 3, '贝', 'kāi mén jiàn shān', '打开门就能看见山。比喻说话或写文章直截了当谈本题，不拐弯抹角。', '出 处\n唐·刘得仁《青龙寺僧院》:“此地堪终日，开门见数峰。”', 1, 1),
(204, '优柔寡断', 1, '忧', 'yōu róu guǎ duàn', '优柔：犹豫不决；寡：少。指做事犹豫，缺乏决断。', '出 处\n《韩非子·亡征》：“缓心而无成；柔茹而寡断；好恶无决；而无所定立者；可亡也。”', 2, 1),
(205, '抛砖引玉', 4, '珏', 'pāo zhuān yǐn yù', '抛出砖去，引回玉来。比喻用自己不成熟的意见或作品引出别人更好的意见或好作品。', '出 处\n时有一僧便出；礼拜；师曰：‘比来抛砖引玉；却引得个鯈子。’”', 1, 1),
(206, '梨花带雨', 3, '戴', 'lí huā dài yǔ', '像沾着雨点的梨花一样。原形容杨贵妃哭泣时的姿态。后用以形容女子的娇美。', '出 处\n唐·白居易《长恨歌》：“玉容寂寞泪阑干，梨花一枝春带雨。”', 1, 1),
(207, '焚膏继晷', 4, '咎', 'fén gāo jì guǐ', '膏：油脂，指灯烛；继：继续，接替；晷：日光。点上油灯，接续日光。形容勤奋地工作或读书。', '出 处\n唐·韩愈《进学解》：“焚膏油以继晷；恒兀兀以穷年。”', 2, 1),
(208, '惺惺相惜', 4, '借', 'xīng xīng xiāng xī', '性格、志趣、境遇相同的人互相爱护、同情、支持。', '出 处\n元·王实甫《西厢记》：“他若是共小生；厮觑定；隔墙儿酬和到天明；方信道惺惺的自古惜惺惺。”', 1, 1),
(209, '醉生梦死', 1, '醒', 'zuì shēng mèng sǐ', '像喝醉酒和做梦那样，昏昏沉沉，糊里糊涂地过日子。', '出 处\n宋·程颐《明道先生行状》：“虽高才明智；胶于见闻；醉生梦死；不自觉也。”', 1, 1),
(210, '前仆后继', 2, '圤', 'qián pū hòu jì', '仆：倒下；继：接着，跟上。前面的倒下了，后面的紧跟上去。形容斗争的英勇壮烈。', '出 处\n清·秋瑾《吊吴烈士樾》：“前仆后继人应在；如君不愧轩辕孙！”', 1, 1),
(211, '首鼠两端', 4, '段', 'shǒu shǔ liǎng duān', '首鼠：鼠性多疑，出洞时一进一退，不能自决；两端：拿不定主意。在两者之间犹豫不决又动摇不定。', '出 处\n召韩御史大夫载；怒曰：‘与长儒共一老秃翁；何为首鼠两端？’”', 2, 1),
(212, '白虹贯日', 3, '惯', 'bái hóng guàn rì', '白色的长虹穿日而过。古人认为人间有不平凡的事，就会引起这种天象的变化。实际上这不是虹而是晕，是一种大气光学现象。', '出 处\n《史记·鲁仲连邹阳列传》：“昔荆轲慕燕丹之义；白虹贯日；太子畏之。”', 2, 1),
(213, '不知所措', 4, '借', 'bù zhī suǒ cuò', '措：安置，处理。不知道怎么办才好。形容处境为难或心神慌乱', '出 处\n《三国志·吴书·诸葛恪传》：“哀喜交并；不知所措。”', 1, 1),
(214, '移花接木', 1, '侈', 'yí huā jiē mù', '把一种花木的枝条或嫩芽嫁接在另一种花木上。比喻暗中用手段更换人或事物来欺骗别人。', '出 处\n明·凌濛初《二刻拍案惊奇》卷十七:“同窗友认假作真，女秀才移花接木。”', 1, 1),
(215, '循循善诱', 4, '绣', 'xún xún shàn yòu', '循循：有次序的样子；善：善于；诱：引导。指善于引导别人进行学习。', '出 处《论语·子罕》：“夫子循循然善诱人；博我以文；约我以礼；欲罢不能。”', 2, 1),
(216, '任重道远', 4, '阮', 'rèn zhòng dào yuǎn', '任：负担；道：路途。担子很重，路很远。比喻责任重大，要经历长期的奋斗。', '出 处\n《商君书·弱民》：“背法而治；此任重道远而无牛马；济大川而无舡楫也。”', 1, 1),
(217, '一网打尽', 4, '净', 'yī wǎng dǎ jìn', '比喻一个不漏地全部抓住或彻底肃清。', '出 处宋·魏泰《东轩笔录》第四卷：“刘见宰相曰：‘聊为相公一网打尽。’”', 2, 1),
(218, '珠联璧合', 3, '壁', 'zhū lián bì hé', '璧：平圆形中间有孔的玉。珍珠联串在一起，美玉结合在一块。比喻杰出的人才或美好的事物结合在一起。', '出 处\n《汉书·律历志》：“日月如合璧；五星如连珠。”', 2, 1),
(219, '安居乐业', 2, '踞', 'ān jū lè yè', '安：安定；乐：喜爱，愉快；业：职业。指安定愉快地生活和劳动。', '出 处\n《后汉书·仲长统传》：“安居乐业；长养子孙；天下晏然；皆归心于我矣。”', 1, 1),
(221, '人浮于事', 2, '孚', 'rén fú yú shì', '浮：超过。原指人的才德高过所得俸禄的等级。后指工作中人员过多或人多事少。', '出 处\n清·张春帆《宦海》：“老兄还没有晓得这里的情形；实在人浮于事；安插不来。”', 2, 1),
(222, '求全责备', 4, '惫', 'qiú quán zé bèi', '求、责：要求；全、备：完备，完美。对人对事物要求十全十美，毫无缺点。', '出 处\n宋·刘克庄《后村全集》：“窃谓天下不能皆绝类离伦之材；君子未尝持求全责备之论。”', 2, 1),
(223, '淋漓尽致', 4, '至', 'lín lí jìn zhì', '淋漓：形容湿淋淋往下滴，比喻尽情，酣畅；尽致：达到极点。形容文章或说话表达得非常充分、透彻，或非常痛快。', '出 处\n明·李清《三垣笔记·崇祯补遗》：“叙次大内规制井井；而所纪客氏、魏忠贤骄横状；亦淋漓尽致；其为史家必采无疑。”', 2, 1),
(224, '蔚然成风', 4, '凤', 'wèi rán chéng fēng', '蔚然：草木茂盛的样子。指一件事情逐渐发展盛行，形成一种良好风气。', '出 处\n范文澜《中国通史》第三编第七章第八节:“日本国内，自望族以至一般文士，摹仿唐诗蔚然成风。”', 2, 1),
(225, '马首是瞻', 4, '詹', 'mǎ shǒu shì zhān', '瞻：往前或向上看。看着我马头的方向，决定进退。比喻追随某人行动。', '出 处\n《左传·襄公十四年》：“荀偃令曰：‘鸡鸣而驾；塞井夷灶；唯余马首是瞻。’”', 2, 1),
(226, '物极必反', 4, '返', 'wù jí bì fǎn', '极：顶点；反：向反面转化。事物发展到极点，会向相反方向转化。', '出 处\n《吕氏春秋·博志》:“全则必缺，极则必反。”《鹖冠子·环流》:“物极则反，命曰环流。”', 1, 1),
(227, '东张西望', 3, '酉', 'dōng zhāng xī wàng', '张：看。形容这里那里地到处看。', '出 处\n明·冯梦龙《喻世明言》：“三巧儿只为信了卖卦先生之语；一心只想丈夫回来；此时经常走向前楼；在帘内东张西望。”', 1, 1),
(229, '耳提面命', 2, '题', 'ěr tí miàn mìng', '不仅是当面告诉他，而且是提着他的耳朵向他讲。形容长辈教导热心恳切。', '出 处\n《诗经·大雅·抑》：“於呼小子；未知臧否。匪乎携之；言示之事；匪面命之；言提其耳。”', 2, 1),
(230, '待字闺中', 3, '闰', 'dài zì guī zhōng', '字：许配；闺：女子卧室。留在闺房之中，等待许嫁。旧指女子成年待聘。', '出 处《礼记·曲礼上》：“好许嫁；笄而字。”', 2, 1),
(231, '众志成城', 4, '诚', 'zhòng zhì chéng chéng', '万众一心，像坚固的城墙一样不可摧毁。比喻团结一致，力量无比强大。', '出 处\n《国语·周语下》：“众志成城；众口铄金。”', 1, 1),
(232, '不胫而走', 2, '径', 'bù jìng ér zǒu', '胫：小腿；走：跑。没有腿却能跑。比喻事物无需推行，就已迅速地传播开去。', '出 处\n北齐·刘昼《新论·荐贤》：“玉无翼而飞；珠无胫而行。”', 2, 1),
(233, '齐大非偶', 4, '遇', 'qí dà fēi ǒu', '指辞婚者表示自己门第或势位卑微，不敢高攀。', '出 处\n先秦·左丘明《左传·桓公六年》:“齐侯欲以文姜妻郑大子忽，大子忽辞。人问其故，大子曰:‘人各有耦，齐大，非吾耦也。’”', 3, 1),
(234, '助人为乐', 1, '肋', 'zhù rén wéi lè', '帮助人就是快乐。', '出 处\n冰心《咱们的五个孩子》:“在我们的新社会里，这种助人为乐的新风尚，可以说是天天在发生，处处在发生。”', 1, 1),
(235, '正襟危坐', 2, '禁', 'zhèng jīn wēi zuò', '襟：衣襟；危坐：端正地坐着。整一整衣服，端正地坐着。形容严肃或拘谨的样子。', '出 处\n《史记·日者列传》：“宋忠贾谊瞿然而悟；猎缨（揽着帽缨）正襟危坐。”', 2, 1),
(236, '苟延残喘', 1, '荀', 'gǒu yán cán chuǎn', '苟：暂且，勉强；延：延续；残喘：临死前的喘息。勉强延续临死前的喘息。比喻暂时勉强维持生存。', '出 处\n宋·陈亮《与范东叔龙图》：“亮自七八月之交；一病垂死；今幸苟存延喘；百念皆已灰灭。”', 2, 1),
(237, '蠢蠢欲动', 4, '冻', 'chǔn chǔn yù dòng', '蠢蠢：爬虫蠕动的样子。比喻敌人准备进攻或坏人阴谋捣乱。', '出 处\n南朝·宋·刘敬叔《异苑·句容水脉》：“掘得一黑物；无有首尾；形如数百斛舡；长数十丈；蠢蠢而动。”', 1, 1),
(238, '时不我待', 4, '侍', 'shí bù wǒ dài', '我待：“待我”的倒装，等待我。时间不会等待我们。指要抓紧时间。', '出 处\n清·秋瑾《赠蒋鹿珊先生言志且为他日成功之鸿爪也》：“事机一失应难再；时乎时乎不我待！”', 2, 1),
(239, '信手拈来', 3, '捻', 'xìn shǒu niān lái', '信手：随手；拈：用手指捏取东西。随手拿来。多指写文章时能自由纯熟的选用词语或应用典故，用不着怎么思考。', '出 处\n宋·苏轼《次韵孔毅甫集古人句见赠》：“前身子美只君是；信手拈得俱天成。”', 2, 1),
(240, '爱莫能助', 2, '末', 'ài mò néng zhù', '爱：爱惜；莫：不。虽然心中关切同情，却没有力量帮助。', '出 处《诗经·大雅·烝民》：“维仲山甫举之；爱莫助之。”', 2, 1),
(241, '因材施教', 2, '才', 'yīn cái shī jiào', '因：根据；材：资质；施：施加；教：教育。指针对学习的人的志趣、能力等具体情况进行不同的教育。', '出 处\n清·郑观应《盛世危言》：“别类分门；因材施教。”', 2, 1),
(242, '兔死狗烹', 1, '免', 'tù sǐ gǒu pēng', '烹：烧煮。兔子死了，猎狗就被人烹食。比喻给统治者效劳的人事成后被抛弃或杀掉。', '出 处\n《史记·越王勾践世家》：“飞鸟尽；良弓藏；狡兔死；走狗烹。”', 1, 1),
(243, '吴下阿蒙', 4, '盟', 'wú xià ā méng', '吴下：现江苏长江以南；阿蒙：指吕蒙。居处吴下一隅的吕蒙。比喻人学识尚浅。', '出 处\n晋·虞溥《江表传》：“至于今者，学识英博，非复吴下阿蒙。”', 2, 1),
(244, '一往无前', 2, '住', 'yī wǎng wú qián', '一直往前，无所阻挡。形容勇猛无畏地前进。', '出 处\n明·孙传庭《官兵苦战斩获疏》：“曹变蛟遵臣指画，与北兵转战冲突，臣之步兵莫不一往无前。”', 1, 1),
(245, '新亭对泣', 2, '葶', 'xīn tíng duì qì', '新亭：古地名，故址在今南京市的南面；泣：小声哭。表示痛心国难而无可奈何的心情。', '出 处\n南朝·宋·刘义庆《世说新语·言语》周侯中坐而叹曰：‘风景不殊，正自有山河之异！’皆相视流泪。”', 2, 1),
(246, '亭亭玉立', 3, '王', 'tíng tíng yù lì', '亭亭：高耸直立的样子。形容女子身材细长。也形容花木等形体挺拔。', '出 处\n《北齐书·徐之才传》：“白云初见空中有五色物；稍近；变成一美妇人；去地数丈；亭亭而立。”', 1, 1),
(247, '涸辙之鲋', 2, '澈', 'hé zhé zhī fù', '涸：干；辙：车轮辗过的痕迹；鲋：鲫鱼。水干了的车沟里的小鱼。比喻在困境中急待援救的人。', '出 处\n《庄子·外物》：“周昨来；有中道而呼声。周顾视车辙中；有鲋鱼焉。周问之曰：‘鲋鱼来；子何为者耶？’', 3, 1),
(248, '闭门造车', 3, '作', 'bì mén zào chē', '关起门来造车子。比喻脱离实际，只凭主观办事。', '出处\n宋·朱熹《或问》第五卷：“古语所谓‘闭门造车，出门合辙’，盖言其法之同。”', 2, 1),
(249, '横扫千军', 3, '干', 'héng sǎo qiān jūn', '横扫：扫荡、扫除。把大量敌军象扫地似地一阵子扫除掉。', '出 处\n唐·杜甫《醉歌行》:“词源倒流三峡水，笔阵独扫千人军。”', 1, 1),
(250, '提纲挈领', 3, '擎', 'tí gāng qiè lǐng', '纲：鱼网的总绳；挈：提起。抓住网的总绳，提住衣的领子。比喻抓住要领，简明扼要。', '出处\n《荀子·劝学》：“若挈裘领；诎五指而顿之；顺者不可胜数也。”', 2, 1),
(251, '上行下效', 4, '校', 'shàng xíng xià xiào', '效：仿效，跟着学。上面的人怎么做，下面的人就跟着怎么干。', '出 处\n《旧唐书·贾曾传》：“上行下效；淫俗将成；败国乱人；实由兹起。”', 2, 1),
(252, '戎马倥偬', 3, '硿', 'róng mǎ kǒng zǒng', '戎马：本指战马，借指军事；倥偬：繁忙。形容军务繁忙。', '出 处\n清·百一居士《壶天录》：“然至于戎马倥偬；大势已烈；只手难撑；不得不以一死报国家。”', 3, 1),
(253, '落英缤纷', 1, '络', 'luò yīng bīn fēn', '\n形容落花纷纷飘落的美丽情景。', '出 处\n晋·陶渊明《桃花源记》：“芳草鲜美；落英缤纷。”', 1, 1),
(254, '词不达意', 1, '语', 'cí bù dá yì', '词：言词；意：意思。指词句不能确切地表达出意思和感情。', '出 处\n宋·释惠洪《石门文字禅·高安城隍庙记》：“盖五百年而书功烈者；词不达意；余尝叹息之。”', 2, 1),
(255, '尾大不掉', 4, '吊', 'wěi dà bù diào', '掉：摇动。尾巴太大，掉转不灵。旧时比喻部下的势力很大，无法指挥调度。现比喻机构庞大，指挥不灵。', '出 处\n先秦·左丘明《左传·昭公十一年》：“末大必折，尾大不掉。”', 2, 1),
(256, '精打细算', 3, '明', 'jīng dǎ xì suàn', '打：规划。精密地计划，详细地计算。指在使用人力物力时计算得很精细。', '近义词：精兵简政、克勤克俭', 2, 1),
(257, '破瓜之年', 1, '剖', 'pò guā zhī nián', '瓜字可以分割成两个八字，所以旧诗文称女子十六岁时为“破瓜之年”。', '出 处\n宋·陆游《无题》诗:“碧玉当年未破瓜，学成歌舞入侯家。”', 2, 1),
(258, '器二不匮', 4, '溃', 'qì èr bù kuì', '比喻东西有储备，就不怕短缺。', '出 处\n《左传·哀公六年》:“器二不匮，君二多难。”', 3, 1),
(259, '迁兰变鲍', 4, '豹', 'qiān lán biàn bào', '比喻潜移默化。', '出 处\n语出《孔子家语·六本》:“与不善人居，如入鲍鱼之肆，久而不闻其臭，亦与之化矣。”', 3, 1),
(260, '如埙如篪', 4, '俿', 'rú xūn rú chí', '埙、篪、乐器名。这两种乐器合奏时，埙唱而篪和，用以比喻两物之响应、应和。', '近义词：如埙如箎', 3, 1),
(261, '山肤水豢', 4, '篆', 'shān fū shuǐ huàn', '本指山上水中出产的美味食物。后泛称美味。', '出 处\n《乐府诗集·燕射歌辞三·隋元会大飨歌》：“道高物备食多方，山肤既善水豢良。”', 3, 1),
(262, '尺树寸泓', 4, '鸿', 'chǐ shù cùn hóng', '泓：水深。泛指地方虽小，却有花草树木、清泉流水的景区。', '', 3, 1),
(263, '尺泽之鲵', 4, '睨', 'chǐ zé zhī ní', '尺泽：一尺见方的水面；鲵：一种小鱼。小水洼中的小鱼。比喻见识短浅的人。', '出 处\n战国·楚·宋玉《对楚王问》:“夫尺泽之鲵，岂能与之量江海之大哉。”', 3, 1),
(264, '痴鼠拖姜', 3, '托', 'chī shǔ tuō jiāng', '亦作“痴鼠拖薑”。比喻不聪明的人自找麻烦。', '出处\n《儿女英雄传》第二二回：“按俗語説便叫作‘賣盆的自尋的’；掉句文便叫作‘痴鼠拖薑，春蠶自縛’！”', 3, 1),
(265, '鸱鸮弄舌', 2, '鸪', 'chī xiāo nòng shé', '鸱鸮：猫头鹰一类的鸟，比喻小人。鸱鸮卖弄口舌。比喻小人拨弄是非，得以逞强。', '出 处\n元·无名氏《连环计》第三折：“枉了你扬威耀武，尽忠竭节，定国安邦，偏容他鸱鸮弄舌，乌鸦展翅，强配鸾凰。', 3, 1),
(266, '惩羹吹齑', 4, '斉', 'chéng gēng chuī jī', '羹：用肉、菜等煮成的汤；齑：细切的冷食肉菜。被热汤烫过嘴，吃冷食时也要吹一吹。比喻受到过教训，遇事过分小心。', '出 处\n战国·楚·屈原《九章·惜诵》：“惩于羹者而吹齑兮，何不变此志也？”', 3, 1),
(267, '鸱目虎吻', 3, '俿', 'chī mù hǔ wěn', '鸱：鹞鹰，一种猛禽；吻：嘴唇边。形容人相貌阴险凶恶。', '出 处\n东汉·班固《汉书·王莽传中》：“莽所谓鸱目虎吻豺狼之声者也，故能食人，亦当为人所食。”', 3, 1),
(268, '乘舆播越', 3, '潘', 'chéng yú bō yuè', '指天子流亡在外。', '近义词：乘舆播迁', 3, 1),
(269, '扯空砑光', 3, '伢', 'chě kōng yà guāng', '扯空：说假话。砑光：纸及布匹用石头磨光，使发光泽，叫“砑光”；比喻沾别人光。指花言巧语，骗人钱财。', '出 处\n清·艾衲居士《豆棚闲话》第十则:“那一带沿河临水住的，俱是靠着虎丘山上，养活不知多多少少扯空砑光的人。”', 3, 1),
(270, '朝客高流', 4, '鎏', 'cháo kè gāo liú', '旧指职位高而声执势显赫的人物。', '出 处\n《扬州梦》', 3, 1),
(271, '畅叫扬疾', 3, '杨', 'chàng jiào yáng jí', '指大吵大闹。“暢叫”即“唱叫”，吵闹之意。“扬疾”犹嚷唧，亦吵闹之意。', '出 处\n元·杨暹《刘行首》第四折：“可笑愚痴，不辨个高低，畅叫扬疾。”', 3, 1),
(272, '残尸败蜕', 4, '娧', 'cán shī bài tuì', '腐烂的骸骨。', '出处\n清·洪升《长生殿·冥追》:就是果然埋下呵，还只怕这残尸败蜕……', 3, 1),
(273, '布衣韦带', 4, '戴', 'bù yī wéi dài', '原是古代贫民的服装，后指没有做官的读书人。', '出 处\n东汉·班固《汉书·贾山传》：“布衣韦带之士，修身于内，成名于外，而使后世不绝息。”', 3, 1),
(274, '粒米狼戾', 4, '唳', 'lì mǐ láng lì', '谷粒撒得满地都是。形容粮食充盈。', '出 处\n先秦·孟轲《孟子·滕文公上》：“乐岁，粒米狼戾。”', 3, 1),
(275, '波流茅靡', 4, '糜', 'bō liú máo mǐ', '随波逐流，随风而倒。比喻胸无定见，趋势而行。', '出 处\n《明史·赵炳然传》：“世宗朝，璁、萼、言、嵩相继用事，六卿之长不得其职。大都波流茅靡，淟涊取容。”', 3, 1),
(276, '十夫楺椎', 4, '锥', 'shí fū róu zhuī', '指十个人的力量能使椎弯曲。椎，槌。比喻人多力大，足以改变原状。', '出处\n《战国策·秦策三》：“闻三人成虎，十夫楺椎，众口所移，毋翼而飞。”', 3, 1),
(277, '轮扁斫轮', 3, '圻', 'lún biǎn zhuó lún', '轮扁：春秋时齐国有名的的造车工人；斫轮：用刀斧砍木制造车轮。指精湛的技艺。', '出 处\n《庄子·天道》:“桓公读书于堂上，轮扁斫轮于堂下。”', 3, 1),
(278, '下乔入幽', 2, '桥', 'xià qiáo rù yōu', '冬季鸟躲在深山穷谷，到春天出来飞鸣于乔木，用来比喻人舍弃黑暗而接近光明，或者从劣境而进入良好的处境。相反则叫“下乔入幽”。', '出 处\n《孟子·滕文公上》:“吾闻出於幽谷，迁于乔木者，未闻下乔木而入于幽谷者。”', 3, 1),
(279, '令原之戚', 1, '邻', 'líng yuán zhī qī', '指兄、弟去世。', '出 处\n《诗经·小雅·常棣》：“脊令在原，兄弟急难，每有良朋，况也永叹。”', 3, 1),
(280, '煮粥焚须', 4, '絮', 'zhǔ zhōu fén xū', '比喻兄弟友爱。', '出 处\n《新唐书·李勣传》：“性友爱，其姊病，尝自为粥而燎其须。”', 3, 1),
(281, '其道亡繇', 4, '鹞', 'qí dào wáng yáo', '找不到门径；无法办到。亦作“其道无由”。', '近义词：其道无由', 3, 1),
(282, '吉祥止止', 2, '相', 'jí xiáng zhǐ zhǐ', '第一个止字是留止的意思，第二个止字是助词。指喜庆。', '出 处\n《庄子·人间世》:“瞻彼阕者，虚室生白，吉祥止止。”', 3, 1),
(283, '盈车嘉穗', 3, '稼', 'yíng chē jiā suì', '盈：满。稻子长得茁壮，一棵就能装满一车。形容粮食丰收。', '出 处\n晋·王嘉《拾遗记·周》：“成王五年，有因祗之国，去王都九万里，又贡嘉禾，一茎盈车。”', 3, 1),
(284, '秉轴持钧', 4, '筠', 'bǐng zhóu chí jūn', '掌握事物运转的中心和关键。', '近义词：秉政当轴', 3, 1),
(285, '凿石索玉', 4, '珏', 'záo shí suǒ yù', '凿：打孔；索：求。为了找到玉而凿石头。比喻只顾眼前利益而忽视长远利益。', '出 处\n《三国志·镯志·秦宓传》：“甫欲凿石索玉，剖蚌求珠，今乃随、和炳然，有如皎日，复何疑哉！”', 3, 1),
(286, '兵为邦捍', 4, '撼', 'bīng wéi bāng hàn', '兵：军队；邦：国家；捍：捍卫。军队是国家的保障。', '出 处\n清·刘亚《将略要论》：“兵为邦捍，国家之威望，将吏之用权，民间之保护，皆借于兵。”', 3, 1),
(287, '兵燹之祸', 2, '螽', 'bīng xiǎn zhī huò', '指因战乱而遭受焚烧破坏的灾祸。', '出处\n《宋史·神宗纪二》：“诏岷州界经鬼章兵燹者赐钱。”', 3, 1),
(288, '幺弦孤韵', 1, '吆', 'yāo xián gū yùn', '指小曲的音韵，与具备各种乐曲乐器的大乐相对。', '出处\n唐·刘禹锡《澈上人文集纪》：“如幺弦孤韵，瞥入人耳，非大乐之音。”', 3, 1),
(289, '黄尘清水', 3, '青', 'huáng chén qīng shuǐ', '比喻变化迅速。', '出处\n唐·李贺《梦天》诗：“黄尘清水三山下，更变千年如走马。”', 3, 1),
(290, '青蓝冰水', 1, '清', 'qīng lán bīng shuǐ', '“青出于蓝，冰寒于水”的略语。比喻学生超过老师或后人胜过前人。', '出 处\n清·陈康祺《燕下乡脞录》卷四:“惜抱出于刘门，世几有青蓝冰水之喻。”', 3, 1),
(291, '鬓丝禅榻', 3, '椫', 'bìn sī chán tà', '鬓丝：鬓发如丝；禅榻：僧床。本指老僧的生活。也指老年人所过的近似僧徒的清静生活。', '出 处\n唐·杜牧《题禅院》：“今日鬓丝禅榻畔，茶烟轻飏落花风。”', 3, 1),
(292, '沈腰潘鬓', 2, '偠', 'shěn yāo pān bìn', '沈腰，沈约因病日瘦，腰带逐渐宽松。潘鬓，潘岳的鬓发中年已斑白。沈腰潘鬓比喻男子的身体瘦弱，早生白发。', '出 处\n南·李煜《破阵子》词：“一旦归为臣虏，沈腰潘鬓销磨。最是仓皇辞庙日，教坊犹奏别离歌，垂泪对宫娥！”', 3, 1),
(293, '悬榻留宾', 4, '鬓', 'xuán tà liú bīn', '榻：狭长而矮的床，特指待客留宿的床。把平日悬起的床放下来，留客人住下。比喻对客人以礼相待，格外尊敬。', '出 处\n《后汉书·徐稚传》:“在郡不接宾客，惟稚来，特设一榻，去则悬之。”', 3, 1),
(294, '传柄移藉', 2, '炳', 'chuán bǐng yí jiè', '指权势转移。', '出 处\n《韩非子·三守》:“恶自治之劳惮，使君辐凑之变，因传柄移藉，使杀生之机，夺予之要在大臣。”', 3, 1),
(295, '玄圃积玉', 2, '埔', 'xuán pǔ jī yù', '传说玄圃多美玉。故以之比喻精华荟萃。', '出处\n《晋书·陆机传》：“葛洪著书称机文，犹玄圃之积玉，无非夜光焉。”', 3, 1),
(296, '变醨养瘠', 2, '離', 'biàn lí yǎng jí', '使薄酒变醇，瘠土变得肥沃。比喻改变贫穷落后面貌。', '出 处\n清·袁枚《随园诗话》卷十一：“公所到处，便能变醨养瘠，元气昭回：古今人若合一辙。”', 3, 1),
(297, '瘠牛偾豚', 3, '愤', 'jí niú fèn tún', '谓瘦弱的牛覆压在小猪上，小猪必死。比喻强国虽德衰，兵临弱国，弱国亦亡。', '出处\n《左传·昭公十三年》：“牛雖瘠，僨於豚上，其畏不死。”', 3, 1),
(298, '哺糟啜醨', 4, '篱', 'bǔ zāo chuò lí', '吃酒糟，喝薄酒。指追求一醉。亦比喻屈志从俗；随波逐流。亦比喻文字优美，令人陶醉。', '近义词：哺糟歠醨、餔糟歠漓', 3, 1),
(299, '祝鮀之佞', 4, '侫', 'zhù tuó zhī nìng', '祝鮀，春秋卫人，能言善辩，或指其善以巧言媚人，后因以为佞人的典型。', '出 处\n《论语·雍也》:“不有祝鮀之佞，而有宋朝之美，难乎免於今之世矣。”', 3, 1),
(300, '尸鸠之平', 2, '鸩', 'shī jiū zhī píng', '尸鸠：亦作“鸤鸠”，即布谷鸟，传说它哺育群雏时能平均如一。比喻一视同仁。亦作“尸鸠之仁”。', '出处\n《诗经·曹风·鸤鸠》：“鸤鸠在桑，其子七兮。”/毛亨传：“鸤鸠之养其子，朝从上下，暮从下上，平均如一。”', 3, 1),
(301, '风鬟雾鬓', 3, '露', 'fēng huán wù bìn', '鬟：环形发髻；鬓：脸旁靠近耳朵的头发。形容女子头发的美。也形容女子头发蓬松散乱。', '出 处\n宋·李清照《永遇乐》词：“如今憔悴，风鬟雾鬓，怕见夜间出去。”', 3, 1),
(302, '恶紫夺朱', 4, '珠', 'wù zǐ duó zhū', '紫：古人认为紫是杂色；夺：乱；朱：大红色，古人认为红是正色。原指厌恶以邪代正。后以喻以邪胜正，以异端充正理。', '出 处\n《论语·阳货》:“恶紫之夺朱也；恶郑声之乱雅乐也；恶利口之覆邦家者。”', 3, 1),
(303, '比屋可封', 4, '卦', 'bǐ wū kě fēng', '意思是在唐、虞时代，贤人很多，差不多每家都有可受封爵的德行。后比喻社会安定，民俗淳朴。也形容教育感化的成就。', '出 处\n《汉书·王莽传上》:“明圣之世，国多贤人，故唐虞之时，可彼屋而封。”', 3, 1),
(304, '果行育德', 1, '裹', 'guǒ xíng yù dé', '以果断的行动培养高尚的道德。', '出 处\n《易·蒙》:“君子以果行育德。”', 3, 1),
(305, '五窦联珠', 2, '椟', 'wǔ dòu lián zhū', '用以称誉兄弟辈皆工诗文者。', '出处\n《新唐书·窦群传》：“﹝ 群 ﹞兄 常、牟，弟 庠、巩 皆为郎，工词章，为《联珠集》行於时，义取昆弟若五星然。”', 3, 1),
(306, '卑以自牧', 4, '枚', 'bēi yǐ zì mù', '指以谦卑自守。', '出 处\n语出《易·谦》：“谦谦君子，卑以自牧也。”', 3, 1),
(307, '霜露之辰', 1, '雨', 'shuāng lù zhī chén', '指父母先人的生日。', '出处\n清 蒲松龄 《聊斋志异·白于玉》：“值霜露之辰，辄问父所，母具告之。”', 3, 1),
(308, '衣锦褧衣', 3, '裘', 'yì jǐn jiǒng yī', '锦衣外面再加上麻纱单罩衣，以掩盖其华丽。比喻不炫耀于人。', '出 处\n《诗·卫风·硕人》:“硕人其颀，衣锦褧衣。”又《诗·郑风·丰》:“裳锦褧裳，衣锦褧衣。叔兮伯兮，驾予与归。”', 3, 1),
(309, '轩鹤冠猴', 1, '炫', 'xuān hè guàn hóu', '乘轩之鹤，戴帽之猴。比喻滥厕禄位、虚有其表的人。', '出 处\n明·刘基《驿传杭台消息石末公有诗见寄次韵奉和并寓悲感》之一:“池鱼幕燕依栖浅，轩鹤冠猴宠渥新。”', 3, 1),
(310, '指水盟松', 1, '诣', 'zhǐ shuǐ méng sōng', '盟：盟誓。指着流水、松树以为盟誓。形容情谊之深。', '出 处\n明·陈汝元《金莲记·诟奸》：“章相与学士，初方指水盟誓，后反操戈入室，不免乘此机会，嘲他几句，有何不可？”', 3, 1),
(311, '怖鸽获安', 2, '鹤', 'bù gē huò ān', '比喻走投无路的人又获得了安身地。', '出 处\n南朝·梁·萧纲《谢赐钱启》', 3, 1),
(312, '取青媲白', 3, '毗', 'qǔ qīng pì bái', '以青配白，比喻诗文讲求对仗。', '近义词：取青妃白', 3, 1),
(313, '松柏寒盟', 4, '朦', 'sōng bǎi hán méng', '比喻患难之交。', '出处\n清·李渔《怜香伴·斋访》：“虽则是梅花冷淡，也甘守松柏寒盟。”', 3, 1),
(314, '于飞之乐', 1, '与', 'yú fēi zhī lè', '于飞：比翼齐飞。比喻夫妻间亲密和谐。', '出处\n《诗经·大雅·卷阿》：“凤凰于飞，翩翩其羽。” ', 2, 1),
(315, '白毫之赐', 2, '豪', 'bái háo zhī cì', '指供养僧徒之物。', '白毫：佛家指如来三十二相之一，其眉间白色毫毛，放有光明，称白毫相。', 3, 1),
(316, '凤毛济美', 3, '计', 'fèng máo jì měi', '旧时比喻父亲做官，儿子能继承父业。', '出 处\n清·李宝嘉《官场现形记》第三十四回:“你不听见说他们世兄即日也要保道台？真正是凤毛济美，可钦可敬。”', 3, 1),
(317, '不啻天渊', 2, '蒂', 'bù chì tiān yuān', '不啻：无异于。渊：深潭。无异于从云天之上到深潭之底。比喻差别极大。', '出 处\n清·李渔《闲情偶寄·宾白第四》：“吴有吴音，越有越语，相去不啻天渊。”', 3, 1),
(318, '五羖大夫', 2, '垟', 'wǔ gǔ dà fū', '羖：公羊。特指春秋虞有贤才的大夫百里奚。', '出处\n缪公大说，授之国政，号早曰‘五羖大夫’。”', 3, 1),
(319, '龙标夺归', 4, '桂', 'lóng biāo duó guī', '科举时代指状元及第。', '出处\n宋·胡继宗《书言故事·科第类》。', 3, 1),
(320, '巨鳌戴山', 3, '带', 'jù áo dài shān', '鳌是古代中国传说的大海龟；戴用头顶着。大鳌的头上顶着山。比喻承受深重的恩情。', '出处\n《列子·汤问》：“渤海之东不知几亿万万里，有……帝恐流于西权，失群先圣之居，及命禹强使巨鳌十五举首而戴之。”', 3, 1),
(321, '暗牖空梁', 4, '粱', 'àn yǒu kōng liáng', '房子空无一人。', '出 处\n隋·薛道衡《昔昔盐》', 3, 1),
(322, '桑枢瓮牖', 4, '囿', 'sāng shū wèng yǒu', '枢：门上的转轴；瓮牖：简陋的窗户。用桑树做门轴，用瓦罐做窗户，比喻贫苦之家。', '出 处\n《庄子·让王》：“蓬户不完，桑以为枢机而瓮牖。”', 3, 1),
(323, '牝牡骊黄', 3, '郦', 'pìn mǔ lí huáng', '骊：黑色。原意是观察事物要注重本质，不在乎外表怎样，后比喻事物的表面现象。', '出 处\n宋·陈亮《祭潘叔度文》：“叔度独略其牝牡骊黄而友其人，关其休戚，悯其不自容于世。”', 3, 1),
(324, '汲引忘疲', 4, '陂', 'jí yǐn wàng pí', '汲引：从井里提水，比喻引荐和提拔人才。引荐和提拔人才而忘记了疲劳。', '出 处\n唐·骆宾王《上衮州刺史启》：“汲引忘疲，奖题不倦。”', 3, 1),
(325, '弯弓饮羽', 3, '引', 'wān gōng yǐn yǔ', '形容勇猛善射。', '近义词：射石饮羽', 3, 1),
(326, '不失圭撮', 4, '措', 'bù shī guī cuō', '圭撮：容量词，六栗为一圭，十圭为一撮。形容数量准确。', '出 处\n东汉·班固《汉书·律历志上》：“量多少者不失圭撮。”', 3, 1),
(327, '丹漆随梦', 3, '遂', 'dān qī suí mèng', '指追随前哲。', '出 处\n南朝·梁·刘勰《文心雕龙·序志》:“齿在逾立，则尝梦执丹漆之礼器，随仲尼而南行。”', 3, 1),
(328, '墨突不黔', 4, '黯', 'mò tū bù qián', '原指墨翟东奔西走，每至一地，烟囱尚未熏黑，又到别处去了。后用其事为典。形容事情繁忙，犹言席不睱暖。', '近义词：孔席不暖、席不暇暖', 3, 1),
(330, '虎背熊腰', 3, '能', 'hǔ bèi xióng yāo', '背宽厚如虎，腰粗壮如熊。形容人身体魁梧健壮。', '出 处\n元·无名氏《飞刀对箭》一折：“这厮倒是一条好汉……哦，是虎背熊腰。”', 1, 1),
(331, '鼠目寸光', 3, '尺', 'shǔ mù cùn guāng', '形容目光短浅，没有远见。', '出 处清·蒋士铨《临川梦》：“吓得那一班鼠目寸光的时文朋友；拜到辕门；盲称瞎赞。”', 2, 1),
(332, '画龙点睛', 1, '化', 'huà lóng diǎn jīng', '原形容梁代画家张僧繇作画的神妙。后多比喻写文章或讲话时，在关键处用几句话点明实质，使内容生动有力。', '出 处\n唐·张彦远《历代名画记》：“人以为妄诞；固请点之。须臾；雷电破壁；两龙乘云腾去上天；二龙未点睛者见在。”', 1, 1),
(333, '黔驴技穷', 2, '马', 'qián lǘ jì qióng', '黔：今贵州省一带；技：技能；穷：尽。比喻有限的一点本领也已经用完了。', '出 处\n寓言故事见唐·柳宗元《黔之驴》。', 2, 1),
(334, '为虎作伥', 4, '涨', 'wèi hǔ zuò chāng', '伥：伥鬼，古时传说被老虎吃掉的人，死后变成伥鬼，专门引诱人来给老虎吃。替老虎做伥鬼。比喻充当恶人的帮凶。', '出 处\n宋·苏轼《渔樵闲话》：“猎者曰：此伥鬼也；昔为虎食之人；既已鬼矣；遂为虎之役。”', 2, 1),
(335, '鸟语花香', 2, '宇', 'niǎo yǔ huā xiāng', '鸟叫得好听，花开得喷香。形容春天的美好景象。', '出 处\n清·李渔《比目鱼·肥遁》：“一路行来；山青水绿；鸟语花香；真个好风景也。”', 1, 1),
(336, '如鱼得水', 4, '冰', 'rú yú dé shuǐ', '好像鱼得到水一样。比喻有所凭借。也比喻得到跟自己十分投合的人或对自己很合适的环境。', '出 处\n《三国志·蜀书·诸葛亮传》:“孤之有孔明，犹鱼之有水也。”', 1, 1),
(337, '对牛弹琴', 4, '情', 'duì niú tán qín', '讥笑听话的人不懂对方说得是什么。用以讥笑说话的人不看对象。', '出 处\n汉·牟融《理惑论》：“公明仪为牛弹清角之操；伏食如故；非牛不闻；不合其耳矣。”', 1, 1),
(338, '鹤立鸡群', 1, '鸽', 'hè lì jī qún', '像鹤站在鸡群中一样。比喻一个人的仪表或才能在周围一群人里显得很突出。', '出 处\n南朝·宋·刘义庆《世说新语·容止》：“有人语王戎曰：‘嵇延祖（嵇绍）卓卓如野鹤之在鸡群。’”', 2, 1),
(339, '杯弓蛇影', 4, '因', 'bēi gōng shé yǐng', '将映在酒杯里的弓影误认为蛇。比喻因疑神疑鬼而引起恐惧。', '出 处\n清·黄遵宪《感事》：“金玦庞凉舍隐痛；杯弓蛇影负奇冤。”', 2, 1),
(340, '亡羊补牢', 1, '王', 'wáng yáng bǔ láo', '亡：逃亡，丢失；牢：关牲口的圈。羊逃跑了再去修补羊圈，还不算晚。比喻出了问题以后想办法补救，可以防止继续受损失。', '出 处\n《战国策·楚策四》：“见兔而顾犬；未为晚也；亡羊而补牢；未为迟也。”', 1, 1),
(341, '千军万马', 2, '君', 'qiān jūn wàn mǎ', '形容雄壮的队伍或浩大的声势。', '出 处\n《梁书·陈庆之传》：“先是洛阳童谣曰：‘名师大将莫自牢；千兵万马避白袍。’”', 1, 1),
(342, '鸡鸣狗盗', 4, '道', 'jī míng gǒu dào', '鸣：叫；盗：偷东西。指微不足道的本领。也指偷偷摸摸的行为。', '近义词：偷偷摸摸、鸡鸣狗盗', 2, 1),
(343, '抱头鼠窜', 4, '串', 'bào tóu shǔ cuàn', '抱着头，像老鼠那样惊慌逃跑。形容受到打击后狼狈逃跑。', '出 处\n宋·苏轼《拟侯公说项羽辞》：“夫陆贾天下之辩士；吾前日遣之；智穷辞屈；抱头鼠窜；颠狈而归。”', 2, 1),
(344, '心猿意马', 2, '原', 'xīn yuán yì mǎ', '心意好像猴子跳、马奔跑一样控制不住。形容心里东想西想，安静不下来。', '出 处\n《敦煌变文集·维摩诘经讲经文》：“卓定深沉莫测量；心猿意马罢颠狂。”', 2, 1),
(345, '鸡犬不宁', 4, '柠', 'jī quǎn bù níng', '宁：安宁。形容骚扰得厉害，连鸡狗都不得安宁。', '出 处\n明·凌濛初《二刻拍案惊奇》：“把一个地方搅得齑菜不生；鸡犬不宁。”', 1, 1),
(346, '兔死狐悲', 3, '胡', 'tù sǐ hú bēi', '兔子死了，狐狸感到悲伤。比喻因同类的死亡而感到悲伤。', '出 处\n元·马钰《苏幕遮·看送孝》：“有微言；深可说。兔死狐悲；伤类声凄切。”', 1, 1),
(347, '车水马龙', 4, '农', 'chē shuǐ mǎ lóng', '车像流水，马像游龙。形容来往车马很多，连续不断的热闹情景。', '出 处\n南唐·李煜《望江南》词：“还似旧时游上苑；车如流水马似龙。”', 1, 1),
(348, '龙潭虎穴', 3, '唬', 'lóng tán hǔ xué', '龙潜居的深水坑，老虎藏身的巢穴。比喻极险恶的地方。', '出 处\n元·无名氏《昊天塔》第三折：“不甫能撞开了天关地户，跳出这龙潭虎窟。”', 1, 1),
(349, '龙腾虎跃', 2, '藤', 'lóng téng hǔ yuè', '像龙在飞腾，虎在跳跃。形容跑跳时动作矫健有力。也比喻奋起行动，有所作为。', '出 处\n唐·严从《拟三国名臣赞序》：“圣人受命；贤人受任；龙腾虎跃；风流云蒸；求之精微；其道莫不咸系乎天者也。”', 2, 1),
(350, '龙飞凤舞', 3, '风', 'lóng fēi fèng wǔ', '原形容山势的蜿蜒雄壮，后也形容书法笔势有力，灵活舒展。', '出 处\n宋·苏轼《表忠观碑》：“天目之山；苕水出焉；龙飞凤舞；萃于临安。”', 1, 1),
(351, '龙马精神', 3, '经', 'lóng mǎ jīng shén', '龙马：古代传说中形状像龙的骏马。比喻人精神旺盛。', '出 处\n唐·李郢《上裴晋公》诗:“四朝忧国鬓如丝，龙马精神海鹤姿。”', 1, 1),
(352, '龙争虎斗', 4, '逗', 'lóng zhēng hǔ dòu', '形容斗争或竞赛很激烈。', '出 处\n元·马致远《汉宫秋》：“我不信你敢差排吕太后；枉以后龙争虎斗；都是俺鸾交凤友。”', 1, 1),
(353, '蛛丝马迹', 4, '计', 'zhū sī mǎ jì', '从挂下来的蜘蛛丝可以找到蜘蛛的所在，从马蹄的印子可以查出马的去向。比喻事情所留下的隐约可寻的痕迹和线索。', '出 处\n唐·杨筠松《龙经·武曲星》：“抛梭马迹；蛛丝长；梭中自有丝不断。”', 1, 1),
(354, '蚕食鲸吞', 4, '囤', 'cán shí jīng tūn', '像蚕吃桑叶那样一步步侵占，像鲸吞食那样一下子吞并。比喻用各种方式侵占吞并别国的领土。', '出 处\n清·纪昀《阅微草堂笔记·滦阳消夏录六》：“汝先遗二孤侄；汝蚕食鲸吞；几无余沥。”', 2, 1),
(355, '鹬蚌相争', 4, '筝', 'yù bàng xiāng zhēng', '“鹬蚌相争，渔翁得利”的省语。比喻双方相持不下，而使第三者从中得利。', '出 处\n清·湘灵子《轩亭冤·哭墓》：“波翻血海全球悯，问谁敢野蛮法律骂强秦？笑他鹬蚌相争演出风云阵。”', 2, 1),
(356, '画蛇添足', 3, '天', 'huà shé tiān zú', '画蛇时给蛇添上脚。比喻做了多余的事，非但无益，反而不合适。也比喻虚构事实，无中生有。', '近义词：弄巧成拙、适得其反、多此一举', 1, 1),
(357, '盲人摸象', 4, '项', 'máng rén mō xiàng', '比喻对事物只凭片面的了解或局部的经验，就乱加猜测，想做出全面的判断。', '出 处\n宋·释道原《景德传灯录·洪进禅师》：“有僧问：‘众盲摸象；各说异端；忽遇明眼人又作么生？’”', 2, 1),
(358, '狗急跳墙', 1, '苟', 'gǒu jí tiào qiáng', '狗急了也能跳过墙去。比喻坏人在走投无路时豁出去，不顾一切地捣乱。', '出 处\n《敦煌变文集·燕子赋》：“人急烧香；狗急蓦墙。”', 1, 1),
(359, '鹤发童颜', 4, '烟', 'hè fà tóng yán', '仙鹤羽毛般雪白的头发，儿童般红润的面色。形容老年人气色好。', '出 处\n唐·田颖《玉山堂诗文集·梦游罗浮》：“自言非神亦非仙；鹤发童颜古无比。”', 2, 1),
(360, '守株待兔', 2, '猪', 'shǒu zhū dài tù', '株：露出地面的树根。原比喻希图不经过努力而得到成功的侥幸心理。现也比喻死守狭隘经验，不知变通。', '出 处\n汉·王充《论衡》：“犹守株待兔之蹊；藏身破置之路也。”', 1, 1),
(361, '左顾右盼', 2, '故', 'zuǒ gù yòu pàn', '顾、盼：看。向左右两边看。形容人骄傲得意的神情。', '出 处\n三国·曹植《与吴季重书》：“左顾右盼；谓若无人；岂非君子壮志哉！”', 1, 1),
(362, '高瞻远瞩', 2, '詹', 'gāo zhān yuǎn zhǔ', '瞻：视，望；瞩：注视。站得高，看得远。比喻眼光远大。', '出 处\n清·夏敬渠《野叟曝言》二回：“遂把这些粉白黛绿；莺声燕语；都付之不见不闻；一路高瞻远瞩；要领略湖山真景。”', 2, 1),
(363, '察言观色', 1, '差', 'chá yán guān sè', '察：详审。观察别人的说话或脸色。多指揣摸别人的心意。', '出 处\n《论语·颜渊》：“夫达也者；质直而好义；察言而观色；虑以下人。”', 1, 1),
(364, '见多识广', 4, '庄', 'jiàn duō shí guǎng', '识：知道。见过的多，知道的广。形容阅历深，经验多。', '出 处\n明·冯梦龙《古今小说：蒋兴哥重会珍珠衫》：“还是大家宝眷；见多识广；比男子汉眼力倒胜十倍。”', 1, 1),
(365, '蜻蜓点水', 4, '冰', 'qīng tíng diǎn shuǐ', '指蜻蜓在水面飞行时用尾部轻触水面的动作。比喻做事肤浅不深入。', '出 处\n唐·杜甫《曲江二首》诗：“穿花蛱蝶深深见；点水蜻蜓款款飞。”', 1, 1),
(366, '蟾宫折桂', 4, '龟', 'chán gōng zhé guì', '蟾宫：月宫。攀折月宫桂花。科举时代比喻应考得中。', '出 处\n《晋书·郤诜传》：“武帝于东堂会送，问诜曰：‘卿自以为如何？’诜对曰：‘臣举贤良封策，为天下第一，犹桂林之一枝，昆山之片玉。’”', 2, 1),
(367, '金蝉脱壳', 1, '今', 'jīn chán tuō qiào', '蝉变为成虫时要脱去一层壳。比喻用计脱身，使人不能及时发觉。', '出 处\n元·马致远《任风子》：“唬得我玉魂销；怎提防笑里刀；……天也我几时能够金蝉脱壳。”', 1, 1),
(368, '飞蛾扑火', 2, '我', 'fēi é pū huǒ', '飞蛾扑到火上，比喻自取灭亡。', '出 处\n《梁书·到溉传》：“如飞蛾之赴火；岂焚身之可吝。”', 1, 1),
(369, '口出不逊', 2, '处', 'kǒu chū bù xùn', '逊：谦逊、恭顺。说出的话非常不谦逊。', '近义词：破口大骂、出言不逊', 2, 1),
(370, '眉清目秀', 2, '青', 'méi qīng mù xiù', '眉、目：眉毛和眼睛，泛指容貌。形容人容貌清秀不俗气。', '出 处\n元·李真夫《合同文字》：“有个孩儿唤做安住；今年三岁；生得眉清目秀；是好一个孩儿也。”', 1, 1),
(371, '头破血流', 2, '陂', 'tóu pò xuè liú', '头打破了，血流满面。多用来形容惨败。', '出 处\n明·吴承恩《西游记》第四十四回:“照道士脸上一刮，可怜就打得头破血流身倒地，皮开颈折脑浆倾。”', 1, 1),
(372, '耳闻目睹', 2, '问', 'ěr wén mù dǔ', '闻：听见；睹：看见。亲耳听到，亲眼看见。', '出 处\n汉·刘向《说苑·政理》：“夫耳闻之；不如目见之。”', 2, 1),
(373, '手疾眼快', 2, '病', 'shǒu jí yǎn kuài', '疾：迅速。动作迅速，眼光敏捷。形容机灵敏捷。\n', '出 处\n明·吴承恩《西游记》：“原来悟空手疾眼快；正在那混乱之时……赶至哪吒脑后；着左膊上一棒打来。”', 1, 1),
(374, '口是心非', 2, '试', 'kǒu shì xīn fēi', '嘴里说得很好，心里想的却是另一套。指心口不一致。', '出 处\n汉·桓谭《新论·辨惑》:“如非其人，口是而心非者，虽寸断支解，而道犹不出也。”', 1, 1),
(375, '头重脚轻', 4, '径', 'tóu zhòng jiǎo qīng', '头脑发胀，脚下无力。形容身体不适。也比喻基础不牢固。', '出 处\n明·天然痴叟《石点头·侯官县烈女歼仇》:“他的酒量原不济，三瓯落肚，渐觉头重脚轻。”', 1, 1),
(376, '胸无点墨', 4, '磨', 'xiōng wú diǎn mò', '肚子里没有一点墨水。指人没有文化。', '出 处\n宋·释普济《五灯会元》：“师自赞曰：‘匙桃不上个村夫；文墨胸中一点无；曾把空虚揣出骨；恶声赢得满江湖。’”', 2, 1),
(377, '目瞪口呆', 2, '蹬', 'mù dèng kǒu dāi', '形容因吃惊或害怕而发愣的样子。', '出 处\n《敦煌变文集》：“朱解低头亲看札；口呿目瞪忘收唇。”', 1, 1),
(378, '眼高手低', 1, '睛', 'yǎn gāo shǒu dī', '眼力过高，手法过低。指要求的标准很高（甚至不切实际），但实际上自己也做不到。', '出 处\n清·陈确《与吴仲木书》：“譬操觚家一味研穷体理；不轻下笔；终是眼高手生；鲜能入彀。”', 1, 1),
(379, '狼吞虎咽', 4, '厌', 'láng tūn hǔ yàn', '形容吃东西又猛又急的样子。', '出 处\n清·李宝嘉《官场现形记》：“不上刻工夫；狼吞虎咽；居然吃个精光。”', 1, 1),
(380, '半信半疑', 4, '凝', 'bàn xìn bàn yí', '有点相信，又有点怀疑。表示对真假是非不能肯定。', '出 处\n宋·朱熹《朱子语类》：“若他们听过了；半信半疑；若存若亡；安得不惰？”', 1, 1),
(381, '同甘共苦', 4, '莘', 'tóng gān gòng kǔ', '甘：甜。共同享受幸福，共同担当艰苦。', '出 处\n《战国策·燕策一》:“燕王吊死问生，与百姓同其甘苦。”', 1, 1),
(382, '积少成多', 3, '诚', 'jī shǎo chéng duō', '积累少量的东西，能成为巨大的数量。', '出 处\n《汉书·董仲舒传》：“聚少成多；积小致巨。”', 1, 1),
(383, '前倨后恭', 2, '据', 'qián jù hòu gōng', '倨：傲慢；恭：恭敬。以前傲慢，后来恭敬。形容对人的态度改变。', '出 处\n明·吴承恩《西游记》：“行者道：‘不敢！不敢！不是甚前倨后恭；老孙于今是没棒弄了。’”', 2, 1),
(384, '有头无尾', 4, '委', 'yǒu tóu wú wěi', '有开头没有收尾。指没有把事情做完。', '出 处\n宋·释普济《五灯会元》卷五:“曰:‘有头无尾时如何？’师曰:‘吐得黄金堪作什么？’”', 1, 1),
(385, '东倒西歪', 2, '到', 'dōng dǎo xī wāi', '指行走不稳，身不由主。也形容物体倾斜不正。', '出 处\n元·萧德祥《杨氏女杀狗劝夫》：“他两个把盏儿吞；直喝得醉醺醺的；吃得东倒西歪。”', 1, 1),
(386, '前呼后拥', 4, '用', 'qián hū hòu yōng', '前面有人吆喝开路，后面有人围着保护。旧时形容官员出行，随从的人很多。', '出 处\n宋·李焘《续资治通鉴长编》：“士之学古入官；遭时得位；纡金拖紫；跃马食肉；前呼后拥；延赏宗族；此足以为荣矣。”', 1, 1),
(387, '道听途说', 3, '涂', 'dào tīng tú shuō', '道、途：路。路上听来的、路上传播的话。泛指没有根据的传闻。', '出 处\n《论语·阳货》：“道听而涂（途）说；德之弃也。”', 2, 1),
(388, '改朝换代', 4, '戴', 'gǎi cháo huàn dài', '旧的朝代为新的朝代所代替。', '近义词：取而代之、更姓改物', 1, 1),
(389, '胡言乱语', 4, '吾', 'hú yán luàn yǔ', '指没有根据，不符实际的瞎说，或说胡话。', '近义词：信口雌黄、课语讹言', 1, 1),
(390, '七拼八凑', 4, '揍', 'qī pīn bā còu', '指把零碎的东西拼凑起来。引申为胡乱凑合。', '近义词：东拉西扯、东拼西凑', 1, 1),
(391, '惊天动地', 1, '敬', 'jīng tiān dòng dì', '惊：惊动；动：震撼。使天地惊动。形容某个事件的声势或意义极大。', '出 处\n唐·白居易《李白墓》诗:“可怜荒冢穷泉骨，曾有惊天动地文。”', 1, 1),
(392, '生龙活虎', 3, '泼', 'shēng lóng huó hǔ', '形容活泼矫健，富有生气。', '出 处\n宋·朱熹《朱子语类》九五：“只见得他如生龙活虎相似　；便把捉不得。”', 1, 1),
(393, '眼疾手快', 4, '决', 'yǎn jí shǒu kuài', '形容做事机警敏捷。', '出 处\n明·施耐庵《水浒传》第四十三回:“倘或被眼疾手快的拿了送官，如之奈何？”', 1, 1),
(394, '千辛万苦', 2, '莘', 'qiān xīn wàn kǔ', '各种各样的艰难困苦。', '出 处\n元·无名氏《飞刀对箭》：“我受了些热血相喷；万苦千辛；恰便似翻滚滚的雪浪里逃生。”', 1, 1),
(395, '旁敲侧击', 2, '则', 'páng qiāo cè jī', '比喻说话、写文章不从正面直接点明，而是从侧面曲折地加以讽刺或抨击。', '出 处\n清·吴趼人《二十年目睹之怪现状》第二十回：“只不过不应该这样旁敲侧击。”', 2, 1),
(396, '狂风暴雨', 3, '曝', 'kuáng fēng bào yǔ', '指大风大雨。亦比喻猛烈的声势或处境险恶。', '出 处\n宋·梅尧臣《惜春三月》之二：“前日看花心未足；狂风暴雨忽无凭。”', 1, 1),
(397, '粉身碎骨', 1, '纷', 'fěn shēn suì gǔ', '身体粉碎而死。比喻为了某种目的或遭到什么危险而丧失生命。', '出 处\n唐·蒋防《霍小玉传》：“平生志愿；今日获从；粉骨碎身；誓不相舍。”', 1, 1),
(398, '调兵遣将', 2, '冰', 'diào bīng qiǎn jiàng', '调动兵力，派遣将领。泛指调动安排人力。', '出 处\n明·施耐庵《水浒传》：“写书教太师知道；早早调兵遣将；剿除贼寇报仇。”', 1, 1),
(399, '心平气和', 2, '苹', 'xīn píng qì hé', '心情平静，态度温和。指不急躁，不生气。', '出 处\n宋·苏轼《菜羹赋》:“先生心平而气和，故虽老而体胖。”', 1, 1),
(400, '心旷神怡', 1, '新', 'xīn kuàng shén yí', '旷：开阔；怡：愉快。心境开阔，精神愉快。', '出 处\n宋·范仲淹《岳阳楼记》：“登斯楼也；则有心旷神怡；宠辱皆忘；把酒临风；其喜洋洋者矣。”', 1, 1),
(401, '燃眉之急', 1, '染', 'rán méi zhī jí', '燃：烧。火烧眉毛那样紧急。形容事情非常急迫。', '出 处\n明·李开先《亡妹卢氏妇墓志铭》：“妹言：‘吾所手制；将鬻之以救燃眉之急。’”', 1, 1),
(402, '火烧眉毛', 2, '饶', 'huǒ shāo méi mao', '火烧到眉毛。比喻事到眼前，非常急迫。', '出 处\n\n宋·释普济《五灯会元》卷十六：“问：‘如何是急切一句？’师曰：‘火烧眉毛。’”\n', 1, 1),
(403, '十万火急', 4, '集', 'shí wàn huǒ jí', '形容事情紧急到了极点（多用于公文、电报等）。', '出 处\n《老舍文集·赵子曰·第三（3）》：“赵子曰的脑府连发十万火急的电报警告全国。”', 1, 1),
(404, '迫不及待', 3, '急', 'pò bù jí dài', '迫：紧急。急迫得不能等待。形容心情急切。', '出 处清·李汝珍《镜花缘》第六回：“且系酒后游戏；该仙子何以迫不及待。”', 3, 1),
(405, '刻不容缓', 4, '媛', 'kè bù róng huǎn', '刻：指短暂的时间；缓：延迟。指形势紧迫，一刻也不允许拖延。', '出 处\n清·李汝珍《镜花缘》：“胎前产后以及难产各症；不独刻不容缓；并且两命攸关。”', 2, 1),
(406, '千钧一发', 2, '均', 'qiān jūn yī fà ', '比喻情况万分危急。', '出 处\n宋·程珌《程端明公洛水集·丙子轮对札子》第十一卷：“肆我祖宗得请于上帝；假手鞑靼；连岁屏除；岌岌之千钧一发矣。”', 2, 1),
(407, '由此及彼', 4, '破', 'yóu cǐ jí bǐ ', '此：这个；彼：那个。由这一现象联系到那一现象。', '出 处清·夏敬渠《野叟曝言》第66回:“遇着通晓之人，就虚心请问，由此及彼，铢积寸累，自然日有进益。”', 2, 1),
(408, '以少胜多', 3, '剩', 'yǐ shǎo shèng duō', '用少量兵力战胜强大的敌人。', '出 处\n邓小平《我们有信心把中国的事情做得更好》：“抗日战争打了八年，抗美援朝打了三年，我们有以少胜多、以弱胜强的传统。”', 1, 1),
(409, '反败为胜', 1, '返', 'fǎn bài wéi shèng', '扭转败局，变为胜利。', '出 处\n明·罗贯中《三国演义》第十六回:“将军在匆忙之中，能整兵坚垒，任谤任劳，使反败为胜，虽古之名将，何以加兹！”', 1, 1),
(410, '转危为安', 2, '威', 'zhuǎn wēi wéi ān', '由危险转为平安（多指局势或病情）。', '出 处\n《晋书·谢安传》:“隐居会稽东山，年逾四十复出为桓温司马，累迁中书、司徒等要职，晋室赖以转危为安。”', 1, 1),
(411, '声东击西', 4, '酉', 'shēng dōng jī xī', '声：声张。指造成要攻打东边的声势，实际上却攻打西边。是使对方产生错觉以出奇制胜的一种战术。', '出 处\n宋·张纲《乞修战船札子》：“况虏情难测；左实右伪；声东击西。”', 1, 1),
(412, '南腔北调', 4, '绸', 'nán qiāng běi diào', '原指戏曲的南北腔调。现形容说话口音不纯，搀杂着方言。', '出 处\n清·吴敬梓《儒林外史》：“两边一幅笺纸的联；上写着：三间东倒西歪屋；一个南腔北调人。”', 1, 1),
(413, '举足轻重', 3, '径', 'jǔ zú qīng zhòng', '只要脚移动一下，就会影响两边的轻重。指处于重要地位，一举一动都足以影响全局。', '出 处\n《后汉书·窦融传》：“方蜀汉相攻；权在将军；举足左右；便有轻重。”', 1, 1),
(414, '弄假成真', 2, '瑕', 'nòng jiǎ chéng zhēn', '', '出 处\n元·无名氏《隔江斗智》：“那个掌亲的；怎知道弄假成真；那一个说亲的早做了藏头露尾。”', 1, 1),
(415, '天经地义', 4, '意', 'tiān jīng dì yì', '经：规范，原则；义：正理。天地间历久不变的常道。指绝对正确，不能改变的道理。也指理所当然的事。', '出 处《左传·昭公二十五年》：“夫理；天之经也；地之义也；民之行也。”', 2, 1),
(416, '有口无心', 3, '吾', 'yǒu kǒu wú xīn', '嘴上说了，心里可没那样想。指不是有心说的。', '出 处\n清·张南庄《何典·序》:“总属有口无心，安用设身处地。”', 1, 1),
(417, '先人后己', 4, '已', 'xiān rén hòu jǐ', '首先考虑别人，然后想到自己。', '出 处\n《礼记·坊记》:“子云:‘君子贵人而贱己，先人而后己。’”', 1, 1),
(418, '大材小用', 4, '拥', 'dà cái xiǎo yòng', '把大的材料当成小的材料用。比喻使用不当，浪费人才。', '出 处\n宋·陆游《送辛幼安殿撰造朝》诗：“大材小用古所叹；管仲、萧何实流亚。”', 1, 1),
(419, '春色满园', 4, '圆', 'chūn sè mǎn yuán', '园内到处都是春天美丽的景色。比喻欣欣向荣的景象。', '出 处\n宋·叶绍翁《游园不值》：“应怜屐齿印苍苔；小扣柴扉久不开。春色满园关不住；一枝红杏出墙来。”', 1, 1),
(420, '生机勃勃', 1, '声', 'shēng jī bó bó', '形容自然界充满生命力，或社会生活活跃。', '出 处\n张天民《创业》：“油田一片生机勃勃，繁忙兴旺的景象。”', 1, 1),
(421, '春雨如油', 4, '由', 'chūn yǔ rú yóu', '春雨贵如油。形容春雨可贵。', '出 处\n宋·释道原《景德传灯录》：“春雨一滴滑如油。”', 1, 1),
(422, '万紫千红', 2, '子', 'wàn zǐ qiān hóng', '形容百花齐放，色彩艳丽。也比喻事物丰富多彩。', '出 处\n宋·朱熹《春日》：“等闲识得东风面；万紫千红总是春。”', 1, 1);
INSERT INTO `t_word` (`id`, `word`, `mix_num`, `mix_char`, `pinyin`, `intro`, `caution`, `level`, `status`) VALUES
(423, '春光明媚', 4, '眉', 'chūn guāng míng mèi', '明媚:美好，可爱。形容春天的景物鲜明可爱。', '出 处\n元·杨文奎《儿女团圆》第一折：“莫不是春光明媚！即不沙可怎生有梨花落；在这满空飞？”', 1, 1),
(424, '化险为夷', 4, '姨', 'huà xiǎn wéi yí', '险：险阻；夷：平坦，平安。化危险为平安。比喻转危为安。', '出 处\n唐·韩云卿《平蛮颂序》：“变氛罈为阳煦；化险阻为夷途。”', 1, 1),
(425, '镇定自若', 3, '白', 'zhèn dìng zì ruò', '遇到紧急情况不慌不乱。', '近义词：从容自若、处之泰然', 1, 1),
(426, '仰不愧天', 3, '槐', 'yǎng bù kuì tiān', '抬头仰望，对天无愧。指没有做过坏事，问心无愧。', '出 处\n唐·韩愈《昌黎集·卷十八·与孟尚书书》：“仰不愧天；俯不愧人；内不愧心。”', 1, 1),
(427, '急中生智', 4, '质', ' jí zhōng shēng zhì ', '智：智谋。紧急的时候，猛然想出办法。', '近义词：计上心头、人急智生', 1, 1),
(428, '力挽狂澜', 4, '斓', 'lì wǎn kuáng lán', '挽：挽回；狂澜：猛烈的大波浪。比喻尽力挽回危险的局势。', '出 处\n清·秋瑾《失题》：“中流砥柱；力挽狂澜；具天才；立大业；拯斯民于衽席；奠国运如磐石；非大英雄无以任之。”', 2, 1),
(429, '大智大勇', 2, '质', 'dà zhì dà yǒng ', '指非凡的才智和勇气。', '近义词：智勇双全、骁勇善战', 1, 1),
(430, '堂堂正正', 1, '糖', 'táng táng zhèng zhèng', '\n堂堂：盛大的样子；正正：整齐的样子。原形容强大整齐的样子，现也形容光明正大。也形容身材威武，仪表出众。', '出 处\n《孙子·军争》:“无要正正之旗，勿击堂堂之陈，此治变者也。”', 1, 1),
(431, '光明磊落', 4, '络', 'guāng míng lěi luò', '磊落：心地光明坦白。胸怀坦白，正大光明。', '出 处宋·朱熹《朱子语类》：“譬如人；光明磊落底便是好人；昏昧迷暗底便不是好人。”', 2, 1),
(432, '临危不惧', 2, '威', 'lín wēi bù jù ', '临：遇到；危：危险；惧：怕。遇到危难的时候，一点也不怕。', '出 处\n《邓析子·无厚》：“死生有命；贪富有时。怨夭折者；不知命也；怨贫贱者；不知时也。故临难不惧。”', 2, 1),
(433, '嬉皮笑脸', 1, '喜', 'xī pí xiào liǎn ', '形容嬉笑不严肃的样子。', '出 处\n清·曹雪芹《红楼梦》第三十回:“你见我和谁玩过！有和你素日嬉皮笑脸的那些姑娘们，你该问他们去！”', 2, 1),
(434, '垂头丧气', 3, '伤', 'chuí tóu sàng qì', '\n垂头：耷拉着脑袋；丧气：神情沮丧。形容因失败或不顺利而情绪低落、萎靡不振的样子。', '出 处\n唐·韩愈《送穷文》：“主人于是垂头丧气；　上手称谢。”', 1, 1),
(435, '愁眉苦脸', 1, '仇', 'chóu méi kǔ liǎn', '皱着眉头，哭丧着脸。形容愁苦的神色。', '出 处元·王实甫《西厢记》第三本第二折:“对人前巧语花言，背地里愁眉泪脸。”', 2, 1),
(436, '眉开眼笑', 2, '关', 'méi kāi yǎn xiào', '眉头舒展，眼含笑意。形容高兴愉快的样子。', '出 处\n元·王实甫《西厢记》第二本第二折:“彼见昨日惊魂魂魄，今日眉花眼笑。”', 1, 1),
(437, '呆若木鸡', 3, '目', 'dāi ruò mù jī ', '呆：傻，发愣的样子。呆得像木头鸡一样。形容因恐惧或惊异而发愣的样子。', '出 处\n《庄子·达生》:“几矣。鸡虽有鸣者，已无变矣，望之似木鸡矣，其德全矣；异鸡无敢应者，反走矣。”', 1, 1),
(438, '目不转睛', 1, '木', 'mù bù zhuǎn jīng', '眼珠子一动不动地盯着看。形容注意力集中。', '出 处\n晋·杨泉《物理论》：“子义燃烛危坐通晓；目不转睛；膝不移处。”', 1, 1),
(439, '滔滔不绝', 4, '决', 'tāo tāo bù jué', '滔滔：形容流水不断。像流水那样毫不间断。指话很多，说起来没个完。', '出 处\n五代后周·王仁裕《开元天宝遗事·走丸之辩》:“张九龄善谈论，每与宾客议论经旨，滔滔不竭，如下阪走丸也。”', 2, 1),
(440, '千差万别', 4, '捌', ' qiān chā wàn bié ', '形容各类多，差别大。', '出 处\n宋·释普济《五灯会元》：“从来姿韵爱风流；几笑时人向外求；万别千差无觅处；得来元在鼻尖头。”', 1, 1),
(441, '五彩缤纷', 1, '伍', 'wǔ cǎi bīn fēn', '五彩：各种颜色；缤纷：繁多交错的样子。指颜色繁多，非常好看。', '出 处\n清·吴趼人《二十年目睹之怪现状》：“铺设得五彩缤纷；当中摆了姊姊画的那一堂寿屏；两旁点着五六对青烛。”', 1, 1),
(442, '林林总总', 1, '木', 'lín lín zǒng zǒng', '林林：众多的样子；总总：众多而杂乱的样子。形容众多。', '出 处\n明·朱舜水《忠孝辩》：“举天下林林总总；夫非尽人之子与？然何以孝子如晨星；不可多得也？”', 1, 1),
(443, '人才济济', 2, '裁', 'rén cái jǐ jǐ', '济济：众多的样子。形容有才能的人很多。', '出 处\n《镜花缘》六十二回；“闰臣见人才济济；十分欢悦。”', 1, 1),
(444, '摩肩接踵', 4, '重', 'mó jiān jiē zhǒng ', '肩碰着肩，脚碰着脚。形容人多拥挤。', '出 处\n《战国策·齐策一》：“临淄之途。车毂击；人肩摩。”', 2, 1),
(811, '高朋满座', 4, '坐', 'gāo péng mǎn zuò', '高：高贵。高贵的朋友坐满了席位。形容宾客很多。', '出 处\n唐·王勃《滕王阁序》：“十旬休假，胜友如云；千里逢迎，高朋满座。”', 2, 1),
(812, '座无虚席', 3, '虎', 'zuò wú xū xí', '虚：空。座位没有空着的。形容出席的人很多。', '出 处\n\n《晋书·王浑传》：“军抚循羁旅；虚怀绥纳；座无虚席；门不停宾。”', 1, 1),
(813, '朝思暮想', 3, '慕', 'zhāo sī mù xiǎng', '朝：早晨；暮：晚上。早晚都想念。形容非常想念或经常想着某一件事。', '出 处\n宋·柳永《大石调·倾杯乐》：“追旧事；一饷凭阑久。如何婿容艳态；抵死孤欢偶。朝思暮想；自家空凭添清瘦。”', 2, 1),
(814, '异想天开', 1, '导', 'yì xiǎng tiān kāi', '异：奇异；天开：比喻凭空的、根本没有的事情。指想法很不切实际，非常奇怪。', '出 处\n清·李汝珍《镜花缘》第八十一回:“这可谓异想天开了。”', 1, 1),
(815, '痴心妄想', 3, '忘', 'chī xīn wàng xiǎng', '痴心：沉迷于某人或某事的心思；妄想：荒诞的打算。一心想着不可能实现的事。也指愚蠢荒唐的想法。', '出 处\n明·冯梦龙《古今小说·蒋兴哥重会珍珠衫》：“大凡人不做指望；到也不在心上；一做指望；便痴心妄想；时刻难过。”', 2, 1),
(816, '左思右想', 2, '恩', 'zuǒ sī yòu xiǎng', '多方面想了又想。', '出 处\n明·冯梦龙《喻世明言》：“左思右想；放心不下。”', 1, 1),
(817, '浮想联翩', 4, '偏', 'fú xiǎng lián piān', '浮想：飘浮不定的想象；联翩：鸟飞的样子，比喻连续不断。指许许多多的想象不断涌现出来。', '出 处\n晋·陆机《文赋》：“沈辞怫悦；若游鱼衔钩而出重渊之深；浮藻联翩；若翰鸟缨缴而坠曾云之峻。”', 2, 1),
(818, '胡思乱想', 2, '恩', 'hú sī luàn xiǎng', '指没有根据，不切实际的瞎想。', '出 处\n宋·朱熹《朱子全书·文》：“苦心未能静安；则总是胡思乱想；如何是能虑！”', 1, 1),
(819, '深思熟虑', 4, '虚', 'shēn sī shú lǜ', '反复深入地考虑。', '出 处《魏书·程骏传》：“且攻难守易；则力悬百倍；不可不深思；不可不熟虑。”', 2, 1),
(820, '苦思冥想', 3, '明', 'kǔ sī míng xiǎng', '尽心地思索和想象。', '近义词：冥思苦想、绞尽脑汁', 2, 1),
(821, '和风细雨', 3, '佃', 'hé fēng xì yǔ', '和风：指春天的风。温和的风，细小的雨。比喻方式和缓，不粗暴。', '出 处\n南朝·陈·张正见《陪衡阳游耆阇诗》：“清风吹麦垄；细雨濯梅林。”', 2, 1),
(822, '百花齐放', 4, '芳', 'bǎi huā qí fàng', '形容百花盛开，丰富多彩。比喻各种不同形式和风格的艺术自由发展。也形容艺术界的繁荣景象。', '出 处\n清·李汝珍《镜花缘》第三回：“百花仙子只顾在此著棋；哪知下界帝王忽有御旨命他百花齐放。”', 2, 1),
(823, '春暖花开', 2, '缓', 'chūn nuǎn huā kāi', '春天气候温暖，百花盛开，景色优美。比喻游览、观赏的大好时机。', '出 处\n明·朱国祯《涌幢小品·南内》：“春暖花开；命中贵陪内阁儒臣宴赏。”', 1, 1),
(824, '春意盎然', 3, '昂', 'chūn yì àng rán', '意：意味；盎然：洋溢，深厚。春天的意味正浓。', '近义词：春色满园、绿意盎然', 2, 1),
(825, '程门立雪', 1, '城', 'chéng mén lì xuě', '旧指学生恭敬受教。比喻尊师。', '出 处\n《宋史·道学传二·杨时》：“一日见颐，颐偶瞑坐，时与游酢侍立不去。颐既觉，则门外雪深一尺矣。”', 2, 1),
(826, '按图索骥', 4, '冀', 'àn tú suǒ jì', '索：找；骥：良马。按照画像去寻求好马。比喻墨守成规办事；也比喻按照线索去寻求。', '出 处\n元·袁桷《清容居士集·示从子瑛》诗：“隔竹引龟心有想；按图索骥术难灵。”', 2, 1),
(827, '暗渡陈仓', 4, '沧', 'àn dù chén cāng', '渡：越过；陈仓：古县名，在今陕西省宝鸡市东。比喻用造假象的手段来达到某种目的。也隐喻男女私通。', '出 处\n明·罗贯中《三国演义》第六十九回：“臣已算定今番诸葛亮必效韩信暗渡陈仓之计。”', 2, 1),
(828, '安步当车', 3, '档', 'ān bù dàng chē', '安：安详，不慌忙；安步：缓缓步行。以从容的步行代替乘车。', '出 处\n《战国策·齐策四》：“晚食以当肉；安步以当车。”', 2, 1),
(829, '抱薪救火', 2, '新', ' bào xīn jiù huǒ', '薪：柴草。抱着柴草去救火。比喻用错误的方法去消除灾祸，结果使灾祸反而扩大。', '出 处\n《三国演义》第四十三回：“若听诸葛亮之言；妄动甲兵；此所谓负薪救火也。”', 2, 1),
(830, '惊弓之鸟', 4, '乌', 'jīng gōng zhī niǎo', '被弓箭吓怕了的鸟不容易安定。比喻经过惊吓的人碰到一点动静就非常害怕。', '出 处\n《战国策·楚策四》；《晋书·王鉴传》:“黩武之众易动，惊弓之鸟难安。”', 1, 1),
(831, '鹏程万里', 2, '诚', 'péng chéng wàn lǐ', '相传鹏鸟能飞万里路程。比喻前程远大。', '出 处\n《庄子·逍遥游》：“鹏之徒于南冥也；水击三千里；抟扶摇而上者九万里。”', 2, 1),
(832, '管中窥豹', 3, '规', 'guǎn zhōng kuī bào', '从竹管的小孔里看豹，只看到豹身上的一块斑纹。比喻只看到事物的一部分，指所见不全面或略有所得。', '近义词：坐进观天、一隅之见', 2, 1),
(833, '举世瞩目', 3, '属', 'jǔ shì zhǔ mù', '全世界的人都注视着。', '出 处战国·楚·屈原《渔夫》：“举世皆浊我独清。”《国语·晋语》：“则恐国人这瞩目于我也。”', 2, 1),
(834, '坐井观天', 3, '关', 'zuò jǐng guān tiān', '坐在井底看天。比喻眼界小，见识少。', '出 处\n唐·韩愈《原道》:“坐井而观天，曰天小者，非天小也。”', 1, 1),
(835, '一览无余', 4, '涂', 'yī lǎn wú yú', '览：看；余：剩余。一眼看去，所有的景物全看见了。形容建筑物的结构没有曲折变化，或诗文内容平淡，没有回味。', '出 处\n清·李绿园《歧路灯》：“这十行俱下的眼睛；看那一览无余的诗文。”', 1, 1),
(836, '一视同仁', 4, '人', 'yī shì tóng rén', '原指圣人对百姓一样看待，同施仁爱。后多表示对人同样看待，不分厚薄。', '出 处\n唐·韩愈《原人》：“是故圣人一视而同仁；笃近而举远。”', 2, 1),
(837, '望而生畏', 4, '喂', 'wàng ér shēng wèi', '畏：恐惧，害怕。看见了就害怕。', '出 处\n清·吴趼人《痛史》：“卷帙浩繁；望而生畏。”', 1, 1),
(838, '五花八门', 4, '闰', 'wǔ huā bā mén', '原指五行阵和八门阵。这是古代两种战术变化很多的阵势。比喻变化多端或花样繁多。', '出 处\n《虞初新志·孙嘉淦》:“伏龙以西，群峰乱峙，四布罗列，如平沙万幕，八门五花。”', 1, 1),
(839, '五颜六色', 2, '言', 'wǔ yán liù sè', '形容色彩复杂或花样繁多。引申为各色各样。', '出 处\n清·李汝珍《镜花缘》第14回：“惟各人所登之云，五颜六色，其形不一。”', 1, 1),
(840, '走南闯北', 1, '徒', 'zǒu nán chuǎng běi', '指走过南方北方不少地方。也泛指闯荡。', '出 处\n老舍《龙须沟》第二幕：“这年月呀，女人尊贵啦，跟男人一样可以走南闯北的。”', 1, 1),
(841, '千变万化', 4, '画', 'qiān biàn wàn huà', '形容变化极多。', '出 处\n《庄子·田子方》：“独有一丈夫；儒服而立乎公门。公即召而问以国事；千变万化而不穷。”', 1, 1),
(842, '博览群书', 3, '裙', 'bó lǎn qún shū', '博：广泛。广泛地阅读各种书。形容读书很多。', '出 处《周书·庾信传》：“庾信；字子山；南阳新野人也。……幼而俊迈；聪敏绝伦；博览群书；尤善《春秋左氏传》。”', 2, 1),
(843, '不耻下问', 2, '止', 'bù chǐ xià wèn', '不以向学问比自己差或辈分，地位比自己低的人请教为可耻。', '出 处\n《论语·公冶长》：“敏而好学，不耻下问。”', 1, 1),
(844, '鹤发鸡皮', 4, '破', 'hè fà jī pí', '鹤发：白发；鸡皮：形容皮肤有皱纹。皮肤发皱，头发苍白。形容老人年迈的相貌。', '出 处北周·庾信《竹杖赋》:“子老矣，鹤发鸡皮，蓬头历齿。”唐玄宗《傀儡吟》:“刻木牵丝作老翁，鸡皮鹤发与真同。”', 2, 1),
(845, '风声鹤唳', 4, '戾', 'fēng shēng hè lì', '唳：鹤叫声。形容惊慌失措，或自相惊忧。', '出 处\n唐·房玄龄等《晋书·谢玄传》：“余众甲宵遁；闻风声鹤唳；皆以为王师已至。”', 2, 1),
(846, '一箭双雕', 4, '貂', 'yī jiàn shuāng diāo', '原指射箭技术高超，一箭射中两只雕。后比喻做一件事达到两个目的。', '出 处\n唐·崔致远《桂苑笔耕录》：“能将一箭落双雕；万里胡尘当日销。”', 1, 1),
(847, '鸦雀无声', 2, '鹊', 'yā què wú shēng', '连乌鸦麻雀的声音都没有。形容非常静。', '出 处\n宋·释道原《景德传灯录》第四卷：“公曰‘鸦去无声；云何言闻？’”', 2, 1),
(848, '三顾茅庐', 4, '卢', 'sān gù máo lú', '顾：拜访；茅庐：草屋。原为汉末刘备访聘诸葛亮的故事。比喻真心诚意，一再邀请。', '出 处\n元·马致远《荐福碑》：“我信着半间儿草舍；再谁承望三顾茅庐。”', 1, 1),
(849, '欢呼雀跃', 3, '鹊', 'huān hū què yuè', '高兴得像麻雀一样跳跃。形容非常欢乐。', '出 处\n《庄子·在宥》：“鸿蒙方将拊髀雀跃而游。”', 2, 1),
(850, '闻所未闻', 3, '末', 'wén suǒ wèi wén', '闻：听到。听到了从来没有听到过的事。形容事物新奇罕见。', '出 处\n《史记·郦生陆贾列传》:“越中无足与语，至生来，令我日闻所未闻。”', 2, 1),
(851, '忍无可忍', 3, '克', 'rěn wú kě rěn', '再也忍受不下去了。', '出 处\n《三国志·孙礼传》：“宣王曰：‘且止；忍不可忍！’”', 1, 1),
(852, '防不胜防', 3, '剩', 'fáng bù shèng fáng', '防：防备；胜：尽。形容防备不过来。', '出 处\n清·吴趼人《二十年目睹之怪现状》第四十七回：“这种小人；真是防不胜防。”', 1, 1),
(853, '举不胜举', 3, '省', 'jǔ bù shèng jǔ', '胜：尽。列举也列举不完。形容数量很多。', '出 处\n鲁迅《伪自由书·后记》引谷春帆《谈“文人先行”》:“公开告密，卖友求荣，卖身投靠的勾当，举不胜举。”', 1, 1),
(854, '数不胜数', 4, '属', 'shǔ bù shèng shǔ', '数：计算。数都数不过来。形容数量极多，很难计算。', '出 处\n《方岩记静》：“类似这样的奇迹灵异；还数不胜数；所以一年四季；方岩香火不绝；而尤以春秋为盛。”', 1, 1),
(855, '痛定思痛', 2, '订', 'tòng dìng sī tòng', '指悲痛的心情平静以后，再追想当时所受的痛苦。常含有警惕未来之意。', '出 处\n宋·文天祥《指南录后序》：“呜呼！死生昼夜事也；死而死矣；而境界危恶；层见错出；非人世所堪；痛定思痛；痛何如哉！”', 2, 1),
(856, '天外有天', 2, '卦', 'tiān wài yǒu tiān', '指某一境界之外更有无穷无尽的境界。多用来表示人的眼界受客观条件的限制，认识的领域需要不断扩大。也表示美好的境界阅历不尽。', '出 处\n《敦煌曲·何满子四首》其四:“金河一去路千千，欲到天边更有天。”', 1, 1),
(857, '神乎其神', 2, '呼', 'shén hū qí shén', '神：神妙；乎：语助词，表感叹。神秘奇妙到了极点。形容非常奇妙神秘。', '出 处\n《镜花缘》七十五回：“向日闻得古人有‘袖占一课’之说；真是神乎其神；我只当总是神仙所为；凡人不能会的。”', 2, 1),
(858, '微乎其微', 2, '忽', 'wēi hū qí wēi', '形容非常小或非常少。', '出 处清·杨伦《杜诗镜铨》眉批引蒋弱六云：“写妙技不觉说入自家语；微乎其微。”', 2, 1),
(859, '旁征博引', 2, '证', 'páng zhēng bó yǐn', '旁：广泛；征：寻求；博：广博；引：引证。指说话、写文章引用材料作为依据或例证。', '出 处\n清·王韬《淞隐漫录》：“生数典已穷；而女博引旁征；滔滔不竭；计女多于生凡十四则。”', 3, 1),
(860, '平心而论', 1, '凭', 'píng xīn ér lùn ', '平心：心情平和，不动感情；论：评论。平心静气地给予客观评价。', '出 处\n清·纪昀《阅微草堂笔记·滦阳消夏录一》:“平心而论，王弻始变旧说，为宋学之萌芽。”', 3, 1),
(861, '胜券在握', 2, '卷', 'shèng quàn zài wò', '胜券：指胜利的把握。指一定能取得胜利。', '近义词：成竹于胸、稳操胜券', 2, 1),
(862, '发人深省', 4, '㨘', 'fā rén shēn xǐng', '发：启发；省：醒悟。启发人深刻思考，有所醒悟。', '出 处\n唐·杜甫《游龙门奉先寺》诗：“欲觉闻晨钟；令人发深省。”', 2, 1),
(863, '草菅人命', 2, '管', 'cǎo jiān rén mìng', '\n草菅：野草。把人命看作野草。指任意残害人命。', '出 处\n明·凌濛初《初刻拍案惊奇》第十一卷：“所以说为官做吏的人；千万不要草菅人命；视同儿戏！”', 3, 1),
(864, '方枘圆凿', 2, '柄', 'fāng ruì yuán záo', '枘：榫头；凿：榫眼。方枘装不进圆凿。比喻格格不入，不能相合。', '出 处\n战国·楚·宋玉《九辨》:“圆凿而方枘兮，吾固知其龃龉而难入。”', 3, 1),
(865, '承先启后', 3, '起', 'chéng xiān qǐ hòu', '继承前代的，启发后代的。', '出 处\n清·王昶《湖海诗传·尹继善》：“文端公历任封疆，晚归台阁，岁历五十馀载，承先启后，三代平章。”', 3, 1),
(866, '无耻谰言', 3, '滥', 'wú chǐ lán yán', '谰言：诬蔑的话，毫无根据的话。指不知羞耻的无赖话。', '相关词语：诬谰、抵谰、诋谰', 3, 1),
(867, '恻隐之心', 1, '侧', 'cè yǐn zhī xīn', '恻隐：对别人的不幸表示同情。形容对人寄予同情。', '出 处\n《孟子·公孙丑上》：“恻隐之心；仁之端也。”', 3, 1),
(868, '继往开来', 1, '既', 'jì wǎng kāi lái', '继：继承；开：开辟。继承前人的事业，开辟未来的道路。', '出 处\n宋·朱熹《朱子全书·道统一·周子书》：“此先生之教；所以继往圣；开来学；而有大功于斯世也。”', 3, 1),
(869, '素昧平生', 2, '味', 'sù mèi píng shēng', '昧：不了解；平生：平素、往常。彼此一向不了解。指与某人从来不认识。', '出 处\n宋·洪迈《夷坚丁志》：“棠疑且惧；却之；曰：‘素昧平生；适未尝相犯；何遽耳？’”', 3, 1),
(870, '恰如其分', 4, '份', 'qià rú qí fèn', '指办事或说话正合分寸。', '出 处\n清·李绿园《歧路灯》第一百零八回：“赏分轻重；俱是阎仲端酌度；多寡恰如其分；无不欣喜。”', 3, 1),
(871, '苦心孤诣', 4, '义', 'kǔ xīn gū yì', '指苦心钻研，到了别人所达不到的地步。也指为寻求解决问题的办法而煞费苦心。', '近义词：苦心经营、煞费苦心', 3, 1),
(872, '昭然若揭', 1, '招', 'zhāo rán ruò jiē', '昭然：明显、显著的样子；揭：原意为高举，现也指揭开。形容真相全部暴露，一切都明明白白。', '出 处\n《庄子·达生》：“今汝饰知以惊愚；修身以明污；昭昭乎若揭日月行也。”', 3, 1),
(873, '气冲霄汉', 3, '宵', ' qì chōng xiāo hàn', '霄汉：指天空。形容魄力非常大。', '出 处\n元·陈以仁《存孝打虎》第二折：“便有那吐虹霓志气冲霄汉。”', 2, 1),
(874, '不骄不躁', 4, '燥', 'bù jiāo bù zào', '躁：急躁。不骄傲，不急躁。形容人态度谦逊，工作谨慎踏实。', '近义词：不卑不亢、泰而不骄', 3, 1),
(875, '先发制人', 3, '治', 'xiān fā zhì rén', '原指丢动手的牌主动地位，可以控制对方。后也泛指争取主动，先动手来制服对方。', '出 处\n《汉书·项籍传》：“先发制人；后发制于人。”', 2, 1),
(876, '抑扬顿挫', 1, '仰', 'yì yáng dùn cuò', '抑：降低；扬：升高；顿：停顿；挫：转折。指声音的高低起伏和停顿转折。', '出 处\n宋·张戒《岁寒堂诗话》卷上：“而子建（曹植）诗；委婉之情；洒落之韵；抑扬顿挫之气；固不可以优劣论也。”', 3, 1),
(877, '因势利导', 4, '道', ' yīn shì lì dǎo', '因：顺着；势：趋势；利导：引导。顺着事情发展的趋势，加以引导。', '出 处\n《史记·孙子吴起列传》：“善战者；因其势而利导之。”', 3, 1),
(878, '一枕黄粱', 4, '梁', 'yī zhěn huáng liáng', '原比喻人生虚幻。后比喻不能实现的梦想。', '出 处\n宋·李曾伯《送乔宾玉》：“一枕黄粱；满头白发；屈指旧游能几人。”', 3, 1),
(879, '金碧辉煌', 2, '壁', 'jīn bì huī huáng', '碧：翠绿色。形容建筑物装饰华丽，光彩夺目。', '出 处\n明·吴承恩《西游记》第四回：“绛纱衣；星辰灿烂；芙蓉冠；金碧辉煌。”', 3, 1),
(880, '唇枪舌剑', 4, '箭', 'chún qiāng shé jiàn', '舌如剑，唇像枪。形容辩论激烈，言词锋利，像枪剑交锋一样。', '出 处\n金·丘处机《神光灿（春一）》：“不在唇枪舌剑；人前斗；惺惺广学多知。”', 3, 1),
(881, '矫揉造作', 1, '娇', 'jiǎo róu zào zuò ', '矫：使弯的变成直的；揉：使直的变成弯的。比喻故意做作，不自然。', '出 处\n清·曹雪芹《红楼梦》第五十一回：“黛玉拦道：‘这宝姐姐也忒胶柱鼓瑟；矫揉造作了。’”', 3, 1),
(882, '罄竹难书', 1, '磬', 'qìng zhú nán shū', '罄：尽，完；竹：古时用来写字的竹简。形容罪行多得写不完。', '出 处\n《旧唐书·李密传》：“罄南山之竹；书罪无穷；决东海之波；流恶难尽。”', 3, 1),
(883, '委曲求全', 2, '屈', 'wěi qū qiú quán', '委曲：曲意迁就。勉强迁就，以求保全。也指为了顾全大局而让步。', '出 处\n宋·欧阳修《滁州谢上表》：“知臣幸逢主圣而敢危言；悯臣不顾身微而当众怨；始终爱惜；委曲保全。”', 3, 1),
(884, '共商国是', 4, '事', 'gòng shāng guó shì', '国是：国事；国家的大政方针。共同商量国家的政策和方针。', '出自汉·刘向《新序·杂事二》', 3, 1),
(885, '惩前毖后', 3, '毙', 'chéng qián bì hòu', '惩：警戒；毖：谨慎。指批判以前所犯的错误，吸取教训，使以后谨慎些，不致再犯。', '出 处\n《诗经·周颂·小毖》：“予其惩而毖后患。”', 3, 1),
(886, '炙手可热', 1, '灸', 'zhì shǒu kě rè', '手摸上去感到热得烫人。比喻权势大，气焰盛，使人不敢接近。', '出 处\n唐·杜甫《丽人行》：“炙手热；势绝伦；慎莫近前丞相嗔。”', 2, 1),
(887, '变幻莫测', 2, '换', 'biàn huàn mò cè', '变幻：变化不可测度。变化很多，不能预料。', '出 处\n明·许仲琳《封神演义》第四十四回：“王天君曰：‘吾“红水阵”内夺壬癸之精；藏天工之妙；变幻莫测。’”', 2, 1),
(888, '貌合神离', 2, '和', 'mào hé shén lí ', '貌：外表；神：内心。表面上关系很密切，实际上是两条心。', '出 处\n汉·黄石公《素书》：“貌合心离者孤；亲谗远忠者亡。”', 3, 1),
(889, '卑躬屈膝', 3, '曲', 'bēi gōng qū xī', '卑躬：低头弯腰；屈膝：下跪。形容没有骨气，低声下气地讨好奉承。', '出 处\n宋·魏了翁《江陵州丛兰精舍记》：“公卿大臣皆卑躬屈膝唯后；虽谢安石之贤也；而犹不能免。”', 3, 1),
(890, '煞费苦心', 2, '废', 'shà fèi kǔ xīn', '煞：委。形容费尽心思。', '出 处\n清·李伯元《中国现在记》：“办河工难除积弊；做清官煞费苦心。”', 3, 1),
(891, '推心置腹', 3, '至', 'tuī xīn zhì fù', '把赤诚的心交给人家。比喻真心待人。', '出 处\n《后汉书·光武帝纪上》：“降者更相语曰：‘萧王推赤心置腹中；安得不投死乎！’”', 3, 1),
(892, '因地制宜', 3, '治', 'yīn dì zhì yí', '因：依据；制：制定；宜：适当的措施。根据各地的具体情况，制定适宜的办法。', '出 处\n《吴越春秋·阖闾内传》：“夫筑城廓；立仓库；因地制宜。”', 2, 1),
(893, '一抔黄土', 2, '杯', 'yī póu huáng tǔ', '一抔：一捧。一捧黄土。借指坟墓。现多比喻不多的土地或没落、渺小的反动势力。', '出 处\n《史记·张释之列传》:“假令愚民取长陵一抔土，陛下何以加其法乎？”', 3, 1),
(894, '并行不悖', 4, '背', 'bìng xíng bù bèi ', '悖：违背，冲突。同时进行，不相冲突。', '出 处\n《礼记·中庸》：“万物并育而不相害；道并行而不相悖。”', 3, 1),
(895, '久负盛名', 3, '胜', 'jiǔ fù shèng míng', '负：承受，承担，引申为享有。长时期地享有好的名声。', '近义词：闻名遐迩', 3, 1),
(896, '揭竿而起', 2, '杆', 'jiē gān ér qǐ ', '揭：高举；竿：竹竿，代旗帜。砍了树干当武器，举起竹竿当旗帜，进行反抗。指人民起义。', '出 处\n汉·贾谊《过秦论》：“将数百之众；转而攻秦；斩木为兵；揭竿为旗”。', 3, 1),
(897, '陈词滥调', 3, '烂', 'chén cí làn diào', '陈：陈旧，陈腐；滥：浮泛不合实际。指陈腐、空泛的论调。', '出 处\n《闻一多全集·三·宫体诗的自赎》：“所以常常是那套褪色的陈词滥调。”', 3, 1),
(898, '巧夺天工', 4, '功', 'qiǎo duó tiān gōng ', '夺：胜过。人工的精巧胜过天然。形容技艺十分巧妙。', '出 处\n晋·郭璞《葬书》：“微妙在智；触类而长；玄通阴阳；巧夺造化。”', 3, 1),
(899, '要言不烦', 4, '繁', 'yào yán bù fán', '要：简要；烦：烦琐。指说话或写文章简单扼要，不烦琐。', '出 处\n《三国志·魏书·管辂传》：“裴松之注引《辂别传》：“辂寻声答之曰：‘夫善《易》者；不论《易》也。’晏含笑而赞之；‘可谓要言不烦也。’”', 3, 1),
(900, '水乳交融', 4, '溶', 'shuǐ rǔ jiāo róng', '交融：融合在一起。象水和乳汁融合在一起。比喻感情很融洽或结合十分紧密。', '出 处\n清·夏敬渠《野叟曝言》：“从前虽是亲热究有男女之分；此时则水乳交融矣。”', 3, 1),
(901, '关怀备至', 3, '倍', 'guān huái bèi zhì', '关心得无微不至。', '出 处\n刘白羽《海天集·伟大创业者》:“总理对人总是关怀备至，体贴入微。”', 3, 1),
(902, '兴高采烈', 3, '彩', 'xìng gāo cǎi liè', '原指文章志趣高尚，言词犀利。后多形容兴致高，精神饱满。', '出 处\n南朝梁·刘勰《文心雕龙·体性》:“步夜俊侠，故兴高而采烈。”', 3, 1),
(903, '坦荡如砥', 4, '坻', 'tǎn dàng rú dǐ', '平坦得像磨刀石一样。比喻人非常直率，不加犹豫·现多用来形容大面积的地方很平坦。', '近义词：周道如砥', 3, 1),
(904, '心悦诚服', 3, '臣', 'xīn yuè chéng fú', '悦：愉快，高兴；诚：硬实。由衷地高兴，真心地服气。指真心地服气或服从。', '出 处\n《孟子·公孙丑上》：“以力服人者；非心服也；为不赡也。以德服人者；中心悦而诚服也。”', 3, 1),
(905, '贪赃枉法', 2, '脏', 'tān zāng wǎng fǎ', '赃：赃物；枉：歪曲，破坏。贪污受贿，违犯法纪。', '出 处\n元·无名氏《陈州粜米》：“谁想那两个到的陈州；贪赃枉法；饮酒非为。”', 3, 1),
(906, '大有裨益', 3, '稗', 'dà yǒu bì yì', '裨益：益处、好处。形容益处很大。', '出 处\n《北齐书·唐邕传》:“比及武平之末，府藏渐虚，邕度支取金，大有裨益。”', 3, 1),
(907, '稗官野史', 1, '裨', 'bài guān yě shǐ', '稗官：古代的一种小官，专给帝王搜集街谈巷语，道听途说，以供省览，后称小说或小说家为稗官。指旧时的小说和私人编撰的史书。', '出 处\n清·李汝珍《镜花缘》第五十回：“倘能遇一文士；把这事迹铺叙起来；做一部稗官野史；也是千秋佳话。”', 3, 1),
(908, '断壁颓垣', 4, '桓', 'duàn bì tuí yuán ', '颓垣：倒了的矮墙。坍塌的墙壁，残毁的矮墙。形容残败的景象。', '出 处\n清·吴趼人《二十年目睹之怪现状》第一百八回:“走到也是园滨文述农门首，抬头一看，只见断壁颓垣，荒凉满目，看那光景是被火烧的。”', 3, 1),
(909, '迭挫强敌', 1, '跌', 'dié cuò qiáng dí', '迭，多次。多次打败强大的对手', '近义词：迭挫劲旅', 3, 1),
(910, '自命不凡', 2, '鸣', 'zì mìng bù fán', '自命：自认为；凡：平凡。自以为不平凡，比别人高明。', '出 处\n清·蒲松龄《聊斋志异》：“大洪杨先生涟；微时为楚名儒；自命不凡。”', 3, 1),
(911, '伸张正义', 1, '申', 'shēn zhāng zhèng yì', '形容坚持，不放弃，同时宣传正义的精神。', '近义词：除恶扬善、除暴安良', 3, 1),
(912, '直截了当', 2, '接', 'zhí jié liǎo dàng', '形容说话做事爽快、干脆。', '出 处\n清·李汝珍《镜花缘》：“紫芝妹妹嘴虽利害；好在心口如一；直截了当；倒是一个极爽快的。”', 3, 1),
(913, '一筹莫展', 2, '愁', 'yī chóu mò zhǎn', '筹：筹划、计谋；展：施展。一点计策也施展不出，一点办法也想不出来。', '出 处\n清·孔尚任《桃花扇》：“下官史可法；日日经略中原；究竟一筹莫展。”', 3, 1),
(914, '口诛笔伐', 2, '殊', 'kǒu zhū bǐ fá', '诛：痛斥，责罚；伐：声讨，攻打。从口头和书面上对坏人坏事进行揭露和声讨。', '出 处\n明·汪廷讷《三祝记·同谪》：“他捐廉弃耻；向权门富贵贪求；全不知口诛笔伐是诗人句；陇上　墦间识者羞。”', 3, 1),
(915, '按部就班', 2, '步', ' àn bù jiù bān ', '部、班：门类，次序；就：归于。按照一定的步骤、顺序进行。也指按老规矩办事，缺乏创新精神。', '出 处\n清·石玉昆《三侠五义》第九十四回：“只好是按部就班慢慢叙下去；自然有个归结。”', 3, 1),
(916, '不徇私情', 2, '循', 'bù xùn sī qíng', '徇：曲从。不曲从私人交情。指为人公正，秉公处事。', '近义词：大公无私、秉公执法', 3, 1),
(917, '屈指可数', 1, '曲', 'qū zhǐ kě shǔ', '形容数目很少，扳着手指头就能数过来。', '出 处\n唐·韩愈《忆昨行和张十一》：“自期殒命在春序；屈指数日怜婴孩。”', 3, 1),
(918, '针砭时弊', 2, '贬', 'zhēn biān shí bì', '砭：古代治病刺穴的石针，后泛指金针治疗和砭石出血。像医病一样，指出时代和社会问题，又针又砭，求得改正向善。', '语出《后汉书》，原指品评人物，现常用于文雅地说长论短。', 3, 1),
(919, '水泄不通', 2, '泻', 'shuǐ xiè bù tōng', '\n泄：排泄。像是连水也流不出去。形容拥挤或包围的非常严密。', '出 处\n宋·释普济《五灯会元·慧明禅师》：“佛法若也不泄不通；便教上座无安身立命处。楞伽峰顶谁能措足；少室岩前水泄不通。”', 3, 1),
(920, '有恃无恐', 2, '侍', 'yǒu shì wú kǒng', '恃：倚仗，依靠；恐：害怕。因为有所依杖而毫不害怕，或毫无顾忌。', '出 处\n《左传·僖公二十六年》：“齐侯曰：‘室如悬罄；野无青草；何恃而不恐？’对曰：‘恃先王之命’。”', 3, 1),
(921, '瑕不掩瑜', 4, '玉', 'xiá bù yǎn yú', '瑕：玉上面的斑点，比喻缺点；掩：遮盖；瑜：美玉的光泽，比喻优点。比喻缺点掩盖不了优点，缺点是次要的，优点是主要的。', '出 处\n《礼记·聘义》：“瑕不掩瑜；瑜不掩瑕；忠也。”', 3, 1),
(922, '销声匿迹', 1, '消', 'xiāo shēng nì jì', '销：通“消”，消失；匿：隐藏；迹：踪迹。指隐藏起来，不公开露面。', '出 处\n宋·孙光宪《北梦琐言》：“宗生避地；……然畏颖川知之；遂旅游资中郡；销声敛迹；唯恐人知。”', 3, 1),
(923, '原形毕露', 3, '必', 'yuán xíng bì lù', '原形：原来的形状；毕：完全。本来面目完全暴露。指伪装被彻底揭开。', '出 处\n清·钱泳《履园丛话》：“（狐女曰）将衣求印；原冀升天；讵意被其一火；原形已露；骨肉仅存；死期将至。”', 3, 1),
(924, '蜕化变质', 1, '退', 'tuì huà biàn zhì', '蜕化：虫类脱皮变化。比喻人堕落变坏。', '出 处\n魏巍《东方》第六部第13章：“最后还说我是什么蜕化变质分子，被糖衣炮弹击中的分子，把我一脚踢出门外。”', 3, 1),
(925, '漫不经心', 1, '慢', 'màn bù jīng xīn', '漫：随便。随随便便，不放在心上。', '出 处\n明·朱国祯《诵幢小品·存问》：“近见使者至城外；仅主家周旋；有司漫不经心。”', 3, 1),
(926, '轻歌曼舞', 3, '慢', 'qīng gē màn wǔ', '音乐轻快，舞姿优美。', '出 处\n《群音类选·玉如意记·赏月登仙》：“助人间才子佳人兴；轻歌慢舞；任星移斗横。”', 3, 1),
(927, '明辨是非', 2, '辩', 'míng biàn shì fēi', '分清楚是和非、正确和错误。', '出 处\n《礼记·中庸》:“慎思之，明辨之，笃行之。”', 3, 1),
(928, '相形见绌', 4, '拙', 'xiāng xíng jiàn chù ', '形：对照；绌：不够，不足。和同类的事物相比较，显出不足。', '出 处\n清·李绿园《歧路灯》：“谭绍闻……见娄朴；同窗共砚；今日相形见绌。难说心中不鼓动么？”', 3, 1),
(929, '弄巧成拙', 4, '绌', 'nòng qiǎo chéng zhuō', '本想耍弄聪明，结果做了蠢事。', '出 处\n宋·黄庭坚《拙轩颂》：“弄巧成拙；为蛇画足。”', 3, 1),
(930, '呕心沥血', 1, '沤', 'ǒu xīn lì xuè', '呕：吐；沥：一滴一滴。比喻用尽心思。多形容为事业、工作、文艺创作等用心的艰苦。', '出 处\n唐·韩愈《归彭城》诗：“刳肝以为纸；沥血以书辞。”', 3, 1),
(931, '既往不咎', 4, '究', 'jì wǎng bù jiù ', '咎：责怪。原指已经做完或做过的事，就不必再责怪了。现指对以往的过错不再责备。', '出 处\n《论语·八佾》：“成事不说；遂事不谏；既往不咎。”', 3, 1),
(932, '乌烟瘴气', 3, '障', 'wū yān zhàng qì', '乌烟：黑烟；瘴气：热带山林中的一种湿热空气，旧时认为是瘴疠的病原。比喻环境嘈杂、秩序混乱或社会黑暗。', '出 处\n清·文康《儿女英雄传》：“如今闹是闹了个乌烟瘴气；骂是骂了个破米糟糠。”', 3, 1),
(933, '亟待解决', 1, '急', 'jí dài jiě jué', '急切的需要使问题有一定结果。', '多音字：亟 jí 急切：亟亟。亟待解决。亟须纠正。 亟 qì 屡次：亟请（屡次请求）。亟来问讯。', 3, 1),
(934, '如火如荼', 4, '茶', 'rú huǒ rú tú', '荼：茅草的白花。像火那样红，像荼那样白。原比喻军容之盛。现用来形容大规模的行动气势旺盛，气氛热烈。', '出 处\n清·吴趼人《二十年目睹之怪现状》：“正是：如火如荼；军容何盛；疑神疑鬼；草木皆兵。”', 3, 1),
(935, '不寒而栗', 4, '粟', 'bù hán ér lì', '栗：畏惧，发抖。不冷而发抖。形容非常恐惧。', '出 处\n《史记·酷吏列传》：“是日皆报杀四百余人；其后郡中不寒而栗。”', 3, 1),
(936, '拾金不昧', 4, '味', ' shí jīn bù mèi ', '金：原指钱财，现泛指各种贵重物品；昧：隐藏。拾到东西并不隐瞒下来据为己有。指良好的仆人道德和社会风尚。', '出 处\n清·李绿园《歧路灯》：“把家人名分扯倒；又表其拾金不昧。”', 3, 1),
(937, '一如既往', 3, '即', 'yī rú jì wǎng', '一：完全；既往：从前，已往。指态度没有变化，完全像从前一样。', '近义词：自始至终、萧规曹随', 3, 1),
(938, '一望无垠', 4, '银', 'yī wàng wú yín', '辽远广阔，看不到边际。', '近义词：一览无余', 3, 1),
(939, '自以为是', 4, '事', 'zì yǐ wéi shì ', '是：对。总以为自己是对的。形容主观，不虚心。', '出 处\n《荀子·荣辱》:“凡斗者必自以为是，而以人为非也。”《孟子·尽心下》:“众皆悦之，自以为是。”', 3, 1),
(940, '不可思议', 4, '义', 'bù kě sī yì', '原有神秘奥妙的意思。现多指无法想象，难以理解。', '出 处\n北魏·杨衒之《洛阳伽蓝记·城内永宁寺》：“佛事精妙；不可思议。”', 3, 1),
(941, '出类拔萃', 4, '粹', 'chū lèi bá cuì', '拔：超出；类：同类；萃：原为草丛生的样子，引伸为聚集。超出同类之上。多指人的品德才能。', '出 处\n《孟子·公孙丑上》：“圣人之于民；亦类也；出于其类；拔乎其萃。”', 3, 1),
(942, '和蔼可亲', 2, '霭', 'hé ǎi kě qīn ', '和蔼：和善。态度温和，容易接近。', '出 处\n明·李开先《闲居集·驾邑令贺洪滨奖异序》：第五卷：“迄今才八阅月；绝丛生之文法；除苛细之科条；虽若凛不可犯；而实蔼然可亲。”', 3, 1),
(943, '记忆犹新', 3, '尤', 'jì yì yóu xīn', '犹：还。过去的事，至今印象还非常清楚，就像刚才发生的一样。', '出 处\n宋·刘克庄《后村全集跋章南举千藁》：“仆曩官健上；多识其士；友去之数十年；犹记忆如新相知；今屈指故友存者十无一二。”', 3, 1),
(944, '脍炙人口', 2, '灸', 'kuài zhì rén kǒu', '脍：切细的肉；炙：烤熟的肉。脍和炙都是人们爱吃的食物。指美味人人爱吃。比喻好的诗文受到人们的称赞和传诵。', '出 处\n五代·王定保《唐摭言·卷十海叙不遇》：“李涛；长沙人也。篇咏甚著；如‘水声长在耳；山色不离门’……皆脍炙人口。”', 3, 1),
(945, '厉行节约', 1, '励', 'lì xíng jié yuē', '厉：严格。严格地实行节约。', '反义词：铺张浪费', 3, 1),
(946, '摩拳擦掌', 1, '磨', 'mó quán cā zhǎng', '形容战斗或劳动之前，人们精神振奋，跃跃欲试的样子。', '出 处\n明·罗贯中《三国演义》：“众兵将得令；一个个摩拳擦掌；准备厮杀。”', 3, 1),
(947, '破釜沉舟', 2, '斧', 'pò fǔ chén zhōu', '比喻下决心不顾一切地干到底。', '出 处\n明·陈孝逸《与罗杓庵书》：“秋间姑且破釜沉舟；持三日粮；为射贼擒王计；必不败；而后杜门却轨。”', 3, 1),
(948, '天花乱坠', 4, '堕', 'tiān huā luàn zhuì ', '传说梁武帝时有个和尚讲经，感动了上天，天上纷纷落下花来。形容说话有声有色，极其动听（多指夸张而不符合实际）。', '出 处\n宋·释普济《五灯会元·翠微学禅师法嗣》：“聚徒一千二千；说法如云如雨；听得天花乱坠；只成个邪说争竟是非；去佛法太远。”', 3, 1),
(949, '遮天蔽日', 3, '敝', 'zhē tiān bì rì', '遮蔽天空和太阳。形容事物体积庞大、数量众多或气势盛大。', '出 处\n明·施耐庵《水浒传》第八十三回:“远远望见辽兵盖地而来，黑洞洞遮天蔽日，都是皂雕旗。”', 3, 1),
(950, '开诚布公', 2, '城', 'kāi chéng bù gōng', '开诚：敞开胸怀，显示诚意。指以诚心待人，坦白无私。', '出 处\n《三国志·蜀志·诸葛亮传》：“诸葛亮之为相国也……开诚心；布公道。”', 3, 1),
(951, '奋发图强', 1, '愤', 'fèn fā tú qiáng', '图：谋求。振作精神，以求强盛。', '出 处\n郭沫若《科学的春天》:“我祝愿中年一代的科学工作者奋发图强，革命加拼命，勇攀世界科学高峰。”', 3, 1),
(952, '一鼓作气', 2, '股', 'yī gǔ zuò qì', '一鼓：第一次击鼓；作：振作；气：勇气。第一次击鼓时士气振奋。比喻趁劲头大的时候鼓起干劲，一口气把工作做完。', '出 处\n《左传·庄公十年》：“夫战；勇气也；一鼓作气；再而衰；三而竭。”', 3, 1),
(953, '万事亨通', 3, '享', 'wàn shì hēng tōng', '亨通：通达顺利。一切事情都很顺利。', '出 处\n清·李绿园《歧路灯》：“那孔方兄运出万事亨通的本领；先治了关格之症。”', 3, 1),
(954, '裹足不前', 4, '迁', 'guǒ zú bù qián', '裹：缠。停步不前，好像脚被缠住了一样。', '出 处\n秦·李斯《谏逐客书》：“使天下之士；退而不敢西向；裹足不入秦。”', 3, 1),
(955, '不容置喙', 4, '缘', 'bù róng zhì huì', '不容许插嘴。', '近义词：不容置辩、不由分说', 3, 1),
(956, '暴殄天物', 2, '珍', 'bào tiǎn tiān wù', '暴：损害，糟蹋；殄：灭绝；天物：指自然生物。原指残害灭绝天生万物。后指任意糟蹋东西，不知爱惜。', '出 处\n《尚书·武成》：“今商王受无道；暴殄天物；害虐烝民。”', 2, 1),
(957, '别出心裁', 3, '新', 'bié chū xīn cái', '别：另外；心裁：心中的设计、筹划。另有一种构思或设计。指想出的办法与众不同。', '出 处\n明·李贽《水浒全书发凡》：“今别出新裁；不依旧样。”', 3, 1),
(958, '不假思索', 2, '加', 'bù jiǎ sī suǒ', '假：假借，依靠。形容做事答话敏捷、熟练，用不着考虑。', '出 处\n宋·黄榦《黄勉斋文集》第四卷：“戒惧谨独；不待勉强；不假思索；只是一念之间；此意便在。”', 3, 1),
(959, '重蹈覆辙', 3, '复', 'chóng dǎo fù zhé', '蹈：踏；覆：翻；辙：车轮辗过的痕迹。重新走上翻过车的老路。比喻不吸取教训，再走失败的老路。', '出 处\n《后汉书·窦武传》：“今不虑前事之失；复循覆车之轨。”', 3, 1),
(960, '纷至沓来', 3, '踏', 'fēn zhì tà lái ', '纷：众多，杂乱；沓：多，重复。形容接连不断的到来。', '出 处\n宋·楼钥《攻媿集》第五十二集：“禅位之诏；登极之赦；尊号改元等文；纷至沓来。”', 3, 1),
(961, '精兵简政', 3, '减', 'jīng bīng jiǎn zhèng', '精减人员，缩减机构。', '出 处\n《南史·陈暄传》：“徐陵为吏部尚史；精简人物。”', 3, 1),
(962, '流言蜚语', 3, '非', 'liú yán fēi yǔ', '毫无根据的话。指背后散布的诽谤性的坏话。', '出 处\n《明史·马孟桢传》：“臣子分流别户；入主出奴；爱憎由心；雌黄信口；流言蜚语；腾入禁庭；此士习可虑也。”', 3, 1),
(963, '毛骨悚然', 3, '耸', 'máo gǔ sǒng rán', '悚然：害怕的样子。汗毛竖起，脊梁骨发冷。形容十分恐惧。', '出 处\n明·冯梦龙《东周列国志》第九十七回:“秦王闻之，不觉毛骨悚然。”', 3, 1),
(964, '美轮美奂', 2, '仑', 'měi lún měi huàn', '形容新屋高大美观，也形容装饰。布置等美好漂亮（轮：高大；奂：文采鲜明', '出 处\n《礼记·檀弓下》:“晋献文子成室，晋大夫发焉。张老曰:‘美哉轮焉，美哉奂焉。’”', 3, 1),
(965, '明火执仗', 4, '杖', 'míng huǒ zhí zhàng', '明：点明；执：拿着；仗：兵器。点着火把，拿着武器。形容公开抢劫或肆无忌惮地干坏事。', '出 处\n明·施耐庵《水浒》：“今日见他每明火执仗；不知他底细……。”', 3, 1),
(966, '弱不禁风', 3, '经', 'ruò bù jīn fēng', '禁：承受。形容身体娇弱，连风吹都经受不起。', '出 处\n宋·陆游《六月二十四日夜分梦范致能、李知己、尤延之同集江亭》：“白菡萏香初过雨；红蜻蜓弱不禁风。”', 3, 1),
(967, '危如累卵', 3, '垒', 'wēi rú lěi luǎn', '比喻形势非常危险，如同堆起来的蛋，随时都有塌下打碎的可能。', '出 处\n《梁书·侯景传》：“复言仆‘众不足以自强；危如累卵。’然纣有亿兆夷人；卒降十乱；桀之百克；终自无后。”', 3, 1),
(968, '向隅而泣', 2, '偶', 'xiàng yú ér qì', '向：对着；隅：墙角；泣：小声地哭。一个人面对墙脚哭泣。形容没有人理睬，非常孤立，只能绝望地哭泣。', '出 处\n汉·刘向《说苑》：“今有满堂饮酒者；有一个独索然向隅而泣；则一堂之人皆不乐矣。”', 3, 1),
(969, '心心相印', 4, '映', 'xīn xīn xiāng yìn', '心：心意，思想感情；印：符合。彼此的心意不用说出，就可以互相了解。形容彼此思想感情完全一致。', '出 处\n《六祖大师法宝坛经》:“吾传佛心印，安敢违于佛经。”《黄蘖传心法要》:“迦叶以来，以心印心，心心不异。”', 2, 1),
(970, '虚左以待', 2, '座', 'xū zuǒ yǐ dài', '虚：空着；左：古时以左为尊；待：等待。空着尊位恭候别人。', '出 处\n《史记·魏公子列传》:“公子从车骑，虚左，自迎夷门侯生。”', 3, 1),
(971, '煊赫一时', 1, '炫', 'xuān hè yī shí', '在一段时期内名声威势很盛，含贬意。', '近义词：烜赫一时', 3, 1),
(972, '湮没无闻', 1, '淹', 'yān mò wú wén', '湮：埋没；无闻：没有知道。名声被埋没，没人知道。', '出 处\n《晋书·羊祜传》:“由来贤达胜士，登此远望，如我与卿者多矣！皆湮灭无闻，使人悲伤。”', 3, 1),
(973, '倚老卖老', 1, '以', 'yǐ lǎo mài lǎo', '卖：卖弄。仗着岁数大，摆老资格。', '出 处\n元·无名氏《谢金吾诉拆清风府》：“我尽让你说几句便罢；则管里倚老卖老；口里唠唠叨叨的说个不了。”', 3, 1),
(974, '源远流长', 1, '渊', 'yuán yuǎn liú cháng', '源头很远，水流很长。比喻历史悠久。', '出 处\n《明史·徐贞羽传》：“卢沟发源于桑乾；滹沱发源于泰戏；源远流长。”', 3, 1),
(975, '纵横捭阖', 3, '俾', 'zòng héng bǎi hé', '纵横：合纵连横；捭阖：开合，战国时策士游说的一种方法。指在政治或外交上运用手段进行分化或拉拢。', '出 处\n宋·李文叔《书战国策后》：“战国策所载；大抵皆纵横捭阖谲诳相轻倾夺之说也。”', 3, 1),
(976, '自出机杼', 4, '抒', 'zì chū jī zhù', '机杼：本指织布机上的筘，织布时每条经线都要从筘齿间穿过，比喻心思、心意。比喻写文章能创造出新的风格和体裁。', '出 处\n《魏书·祖莹传》:“文章须自出机杼，成一家风骨，何能共人同生活也。”', 3, 1),
(977, '佶屈聱牙', 3, '骜', 'jí qū áo yá', '佶屈：曲折；聱牙：不顺口。指文章读起来不顺口。', '出 处\n唐·韩愈《进学解》：“周《诰》《殷》《盘》；佶屈聱牙。”', 3, 1),
(978, '安邦定国', 2, '帮', 'ān bāng dìng guó', '邦：泛指国家。使国家安定巩固。', '出 处\n《元曲选外编·无名氏〈衣袄车〉第一折》：“老将军无比阵云收；若题着安邦定国；受赏封侯。”', 3, 1),
(979, '气势磅礴', 3, '滂', 'qì shì páng bó', '磅礴：广大无边的样子。形容气势雄伟壮大。', '出 处\n宋·文天祥《文山集·指南后录·正气歌》第十四卷：“是气所磅礴；凛冽万古存。”', 3, 1),
(980, '艰苦备尝', 3, '倍', 'jiān kǔ bèi cháng ', '受尽了艰难困苦。', '近义词：备尝艰苦\n反义词：一帆风顺', 3, 1),
(981, '杯水车薪', 1, '抔', 'bēi shuǐ chē xīn', '用一杯水去救一车着了火的柴草。比喻力量太小，解决不了问题。', '出 处\n《孟子·告子》：“今之为仁者；犹以一杯水救一车薪之火也。”', 2, 1),
(982, '刚愎自用', 2, '腹', 'gāng bì zì yòng', '形容一个人过分自信，完全听取不了别人的意见，十分固执。', '出 处\n《左传·宣公十二年》：“刚愎不仁；未肯用命。”', 3, 1),
(983, '锋芒毕露', 3, '必', 'fēng máng bì lù', '毕露：完全显露。锐气和才华全都显露出来。多指人好表现自己。', '出 处\n《后汉书·袁绍传》：“瓒亦枭夷；故使锋芒挫缩；厥图不果。”', 3, 1),
(984, '民生凋敝', 4, '蔽', 'mín shēng diāo bì', '民生：人民的生计；凋敝：衰败，艰苦。社会穷困，经济衰败，人民生活极端困苦。', '出 处\n《汉书·循吏传序》：“孝武之世……民用彫敝；奸宄不禁。”', 3, 1),
(985, '惨无人道', 1, '残', 'cǎn wú rén dào', '惨：狠毒，残暴。残酷狠毒到极点，如野兽一样。', '出 处\n蔡东藩《唐史演义》：“将妃、主等人；一一剖心致祭；惨无人道。”', 2, 1),
(986, '扬长而去', 2, '常', 'yáng cháng ér qù', '大模大样地径自走了。', '出 处\n清·曹雪芹《红楼梦》第十二回:“（道士）道:‘……千万不可照正面，只照背面，要紧，要紧！三日后我来收取，管叫你病好。’说毕，徉长而去。”', 2, 1),
(987, '老生常谈', 3, '长', 'lǎo shēng cháng tán', '老书生经常说的话。比喻人们听惯了的没有新鲜意思的话。', '近义词：旧话重提、千篇一律', 3, 1),
(988, '天崩地坼', 4, '拆', 'tiān bēng dì chè ', '崩：倒塌；坼：裂开。象天塌下、地裂开那样。比喻重大的事变。也形容巨大的声响。', '出 处\n《战国策·赵策三》：“天崩地坼，天子下席。”', 3, 1),
(989, '清澈见底', 2, '沏', 'qīng chè jiàn dǐ', '湖水或海水很清澈透明，可以看到底。', '多用于形容湖水', 2, 1),
(990, '称心如意', 1, '秤', 'chèn xīn rú yì', '形容心满意足，事情的发展完全符合心意。', '出 处\n宋·朱敦儒《樵歌·感皇恩》：“称心如意；剩活人间几岁？”', 2, 1),
(991, '良辰美景', 2, '晨', 'liáng chén měi jǐng', '良：美好；辰：时辰。美好的时光和景物。', '出 处\n《陈书·孙霤传》：“每良辰美景；宾僚并集；泛长江而置酒；亦一时之胜赏焉。”', 3, 1),
(992, '计日程功', 3, '成', 'jì rì chéng gōng', '计：计算；程：估量，考核；功：成效。工作进度或成效可以按日计算。形容进展快，有把握按时完成。', '出 处\n梁启超《中国理法学发达史论》：“法治国虽进不必骤；而得寸进尺；计日程功。”', 3, 1),
(993, '瞠目结舌', 1, '瞋', 'chēng mù jié shé ', '瞠：瞪着眼；结舌：说不出话来。瞪着眼睛说不出话来。形容窘困或惊呆的样子。', '出 处\n清·霁园主人《夜谭随录》：“因耳语其故；公子大骇；入舱隐叩细君；细君结舌瞠目。”', 2, 1),
(994, '人所不齿', 4, '耻', 'rén suǒ bù chǐ', '人品或行为卑劣被人所不屑。', '近义词：遗臭万年、遗臭万代', 3, 1),
(995, '充耳不闻', 1, '冲', 'chōng ěr bù wén', '充：塞住。塞住耳朵不听。形容有意不听别人的意见。', '出 处\n《诗经·邶风·旄丘》:“叔兮伯兮，褎如充耳。”', 3, 1),
(996, '椎心泣血', 1, '捶', 'chuí xīn qì xuè', '椎心：捶胸脯；泣血：哭得眼中流血。捶拍胸膛，哭泣出血。形容非常悲痛。', '出 处\n汉·李陵《答苏武书》：“何图志未立而怨已成；计未从而骨肉受刑；此陵所以仰天椎心而泣血也。”', 3, 1),
(997, '义不容辞', 4, '词', 'yì bù róng cí', '容：允许；辞：推托。道义上不允许推辞。', '出 处\n明·罗贯中《三国演义》：“可差人往鲁子敬处；教急发书到荆州；使玄德用力拒曹……且玄德既为东吴之婿；亦义不容辞。”', 3, 1),
(998, '强词夺理', 2, '辞', 'qiǎng cí duó lǐ', '强词：强辩；夺：争。指无理强辩，明明没理硬说有理。', '出 处\n明·罗贯中《三国演义》：“座上一人忽曰：‘孙明所言；皆强词夺理；均非正论；不必再言。’”', 3, 1),
(999, '信口雌黄', 3, '辞', 'xìn kǒu cí huáng', '信：任凭，听任；雌黄：即鸡冠石，黄色矿物，用作颜料。古人用黄纸写字，写错了，用雌黄涂抹后改写。比喻不顾事实，随口乱说。', '出 处\n南北朝·刘孝标《广绝交论》：“雌黄出其唇吻。”', 3, 1),
(1000, '感恩戴德', 3, '载', 'gǎn ēn dài dé', '戴：尊奉，推崇。感激别人的恩惠和好处。', '出 处\n《三国志·吴志·骆统传》：“令皆感恩戴义；怀欲报之心。”', 3, 1),
(1001, '殚精竭虑', 1, '惮', 'dān jīng jié lǜ', '殚：竭尽；虑：思虑。形容用尽心思。', '出 处\n明·胡应麟《诗薮》：“若《子夜》等什；其用总之工；传情之文宛；有唐人竭精殚力不能追步者。”', 3, 1),
(1002, '肆无忌惮', 4, '殚', ' sì wú jì dàn ', '肆：放肆；忌：顾忌；惮：害怕。非常放肆，一点没有顾忌。', '出 处\n《礼记·中庸》：“小人之中庸也；小人而无忌惮。”宋·朱熹注：“小人不知有此；则肆欲妄行；而无所忌惮矣。”', 3, 1),
(1003, '腾挪跌宕', 3, '迭', 'téng nuó diē dàng', '表示起伏动作大，气势雄浑。', '造句：极尽情节腾挪跌宕之能事。', 3, 1),
(1004, '循规蹈矩', 3, '韬', 'xún guī dǎo jǔ', '循、蹈：遵循，依照。规、矩是定方圆的标准工具，借指行为的准则。原指遵守规矩，不敢违反。现也指拘守旧准则，不敢稍做变动。', '出 处\n宋·朱熹《答方宾生书》：“循途守辙；犹言循规蹈矩云尔。”', 3, 1),
(1005, '一语破的', 4, '地', 'yī yǔ pò dì', '的：箭靶的中心。一句话就说中要害。', '出 处\n唐·李欣《放歌行答从弟墨卿》：“吾家令弟才不羁；五言破的人共推。”', 3, 1),
(1006, '掉以轻心', 1, '调', 'diào yǐ qīng xīn', '对事情采取轻率的漫不经心的态度；不认真当回事。', '出 处\n唐·柳宗元《答韦中立论师道书》', 2, 1),
(1007, '趋炎附势', 3, '赴', 'qū yán fù shì', '趋：奔走；炎：热，比喻权势。奉承和依附有权有势的人。', '出 处\n宋·陈善《扪虱新话》：“盖趋炎附势；自古然矣。”', 3, 1),
(1008, '牵强附会', 3, '赴', 'qiān qiǎng fù huì', '把本来没有某种意义的事物硬说成有某种意义。也指把不相关联的事物牵拉在一起，混为一谈。', '出 处\n清·曾朴《孽海花》：“后儒牵强附会；费尽心思；不知都是古今学不分明的缘故。”', 3, 1),
(1009, '无以复加', 3, '附', 'wú yǐ fù jiā ', '不可能再增加。指程度达到了极点。', '出 处\n《汉书·王莽传下》：“宜崇其制度；宣视海内；且令万世之后无以复加也。”', 3, 1),
(1010, '三番五次', 2, '畨', 'sān fān wǔ cì', '番：遍数。一再，多次。', '出 处\n清·吴敬梓《儒林外史》：“三番五次；缠的老和尚急了；说道：‘你是何处光棍；敢来闹我们！……’”', 3, 1),
(1011, '幡然悔悟', 1, '番', 'fān rán huǐ wù', '思想转变很快，彻底悔悟。', '近义词：翻然改悔、如梦方醒', 3, 1),
(1012, '半途而废', 4, '费', 'bàn tú ér fèi', '废：停止。指做事不能坚持到底，中途停顿，有始无终。', '近义词：半途而返、因噎废食', 3, 1),
(1013, '安分守己', 4, '份', 'ān fèn shǒu jǐ', '分：本分。规矩老实，守本分，不做违法的事。', '出 处\n《喻世明言》卷三十六：“如今再说一个富家；安分守己；并不惹是生非。”', 3, 1),
(1014, '匪夷所思', 1, '诽', ' fěi yí suǒ sī', '匪：不是；夷：平常。指言谈行动离奇古怪，不是一般人根据常情所能想象的。', '出 处\n《周易·涣》：“涣有丘；匪夷所思。”', 3, 1),
(1015, '英雄气概', 4, '慨', 'yīng xióng qì gài', '形容一个人非常英武，很有力量和气势。', '', 3, 1),
(1016, '鬼斧神工', 4, '功', 'guǐ fǔ shén gōng', '像是鬼神制作出来的。形容艺术技巧高超，不是人力所能达到的。', '出 处\n《庄子·达生》：“梓庆削木为；成；见者惊犹鬼神。', 3, 1),
(1017, '异曲同工', 4, '功', 'yì qǔ tóng gōng', '工：细致，巧妙；异：不同的。不同的曲调演得同样好。比喻话的说法不一而用意相同，或一件事情的做法不同而都巧妙地达到目的。', '出 处\n唐·韩愈《进学解》：“子云相如；同工异曲。”', 3, 1),
(1018, '事必躬亲', 3, '恭', 'shì bì gōng qīn', '躬亲：亲自。不论什么事一定要亲自去做，亲自过问。形容办事认真，毫不懈怠。', '出 处\n唐·张九龄《谢赐大麦面状》：“伏以周人之礼；唯有籍田；汉氏之荐；但闻时果；则未有如陛下严祗于宗庙；勤俭于生人；事必躬亲；动合天德。”', 3, 1),
(1019, '提心吊胆', 3, '掉', 'tí xīn diào dǎn', '形容十分担心或害怕。', '出 处\n《西游记》十七回：“众僧闻得此言；一个个提心吊胆；告天许愿。”', 2, 1),
(1020, '待价而沽', 4, '估', 'dài jià ér gū', '沽：卖。等有好价钱才卖。比喻谁给好的待遇就替谁工作。', '出 处\n《论语·子罕》：“‘有美玉于斯；韫椟而藏诸？求善贾而沽诸？’子曰：‘沽之哉！沽之哉！我待贾者也。’”', 3, 1),
(1021, '依然故我', 3, '固', 'yī rán gù wǒ', '形容自己一切跟从前一样，没有变得更好。', '出 处\n宋·陈著《贺新郎·次韵戴时芳》：“谁料腥埃妨阔步；孤瘦依然故我。”', 3, 1),
(1022, '蛊惑人心', 1, '盅', 'gǔ huò rén xīn', '蛊惑：迷惑。指用欺骗引诱等手段迷惑人，搞乱人的思想。', '出 处\n《元史·刑法志》：“诸阴阳家者流；辄为人燃灯祭星；蛊惑人心者；禁之。”', 3, 1),
(1023, '羽扇纶巾', 3, '伦', 'yǔ shàn guān jīn', '拿着羽毛扇子，戴着青丝绶的头巾。形容态度从容。', '出 处\n宋·苏轼《念奴娇·赤壁怀古》词：“小乔初嫁了，雄姿英发。羽扇纶巾，谈笑间，强虏灰飞烟灭。”', 3, 1),
(1024, '恶贯满盈', 2, '惯', 'è guàn mǎn yíng ', '贯：穿钱的绳子；盈：满。罪恶之多，犹如穿线一般已穿满一根绳子。形容罪大恶极，到受惩罚的时候了。', '出 处\n《尚书·泰誓》：“商罪贯盈；天命诛之。”', 3, 1),
(1025, '一仍旧贯', 4, '惯', 'yī réng jiù guàn', '一：都，全；仍：因袭，依照；贯：习惯的办法。执照老规矩办事，没有丝毫改变。', '出 处\n先秦·孔子《论语·先进》：“仍旧贯，如之何？何必改作？”', 3, 1),
(1026, '步入正轨', 4, '规', 'bù rù zhèng guǐ', '步步进入正当的道路，指改邪归正。', '正轨：1.犹正规，正常的法度。 2.正道;正当的途径。', 3, 1),
(1027, '食不果腹', 3, '裹', 'shí bù guǒ fù', '果：充实。不果腹：吃不饱肚子。食：吃。吃不饱肚子。形容生活贫困。', '出  处\n《庄子·逍遥游》：“适莽苍者，三餐而反，腹犹果然。”', 3, 1),
(1028, '米珠薪桂', 3, '新', 'mǐ zhū xīn guì', '珠：珍珠。米贵得像珍珠，柴贵得像桂木。形容物价昂贵，人民生活极其困难。', '出 处\n《战国策·楚策三》:“楚国之食贵于玉，薪贵于桂。”', 3, 1),
(1029, '明知故犯', 3, '固', 'míng zhī gù fàn', '明明知道不能做，却故意违犯。', '出 处\n《续传灯录》：“师曰：‘知而故犯’。”', 3, 1),
(1030, '发扬光大', 3, '广', 'fā yáng guāng dà', '发扬：发展，提倡；光大：辉煌而盛大。使好的作风、传统等得到发展和提高。', '出 处\n《周易·坤》：“坤厚载物；德合无疆；含弘光大；品物咸享。”', 3, 1),
(1031, '皓首穷经', 1, '晧', 'hào shǒu qióng jīng', '皓：白；首：头发；穷经：专心研究经书和古籍。一直到年老头白之时还在深入钻研经书和古籍。', '出 处\n唐·韩偓《赠易卜崔江处士》诗：“白首穷经通秘义；青山养老度危时。”', 3, 1),
(1032, '曲高和寡', 3, '合', 'qǔ gāo hè guǎ', '曲调高深，能跟着唱的人就少。旧指知音难得。现比喻言论或作品不通俗，能了解的人很少。', '出 处\n战国·楚·宋玉《对楚王问》：“是其曲弥高；其和弥寡。”', 3, 1),
(1033, '惨绝人寰', 4, '环', 'cǎn jué rén huán', '人寰：人世。世界上再没有比这更惨痛的事。形容惨痛到了极点。', '出 处\n南北朝·鲍照《舞鹤赋》：“去帝乡之岑寂；归人寰之宣卑。”', 3, 1),
(1034, '一模一样', 4, '羊', 'yī mú yī yàng', '样子完全相同。', '近义词：如出一辙、毫无二致', 1, 1),
(1035, '千言万语', 4, '宇', 'qiān yán wàn yǔ', '形容说得话很多。', '出 处\n唐·郑谷《燕》诗:“千言万语无人会，又逐流莺过短墙。”', 1, 1),
(1036, '一心一意', 2, '新', 'yī xīn yī yì', '心思，意念专一。', '近义词：全心全意、一心一路', 1, 1),
(1037, '一生一世', 2, '圣', 'yī shēng yī shì', '一辈子。', '出 处\n清·曹雪芹《红楼梦》第九十三回:“他倒拿定一个主意:说是人生婚配，关系一生一世的事，不是混闹得的。”', 1, 1),
(1038, '是是非非', 1, '事', 'shì shì fēi fēi', '把对的认为是对的，把错的认为是错的。比喻是非、好坏分得非常清楚。', '出 处\n《荀子·修身》:“是是非非谓之知，非是是非谓之愚。”', 1, 1),
(1039, '有心无力', 4, '里', 'yǒu xīn wú lì', '有愿望和打算，但没有力量付诸实现。', '出 处\n南朝·梁·惠皎《高僧传·义解·竺法旷》:“贫道必当尽诚上答，正恐有心无力耳。”', 1, 1),
(1040, '七上八下', 4, '卞', 'qī shàng bā xià', '形容无所适从或心神不宁；指不上不下，处于中等位置；形容杂乱不整齐。', '出 处\n宋·宗杲说《大慧普觉禅师语录》：“方寸里七上八下；如咬生铁橛；没滋味时；切莫退志。”', 1, 1),
(1041, '朝三暮四', 4, '西', 'zhāo sān mù sì ', '原指玩弄手法欺骗人。后用来比喻常常变卦，反复无常。', '出 处《庄子·齐物论》：“狙公赋芧曰：‘朝三而莫（暮）四。’众狙皆怒。”', 1, 1),
(1042, '大同小异', 2, '童', 'dà tóng xiǎo yì', '大体相同，略有差异。', '出 处\n北魏·杨衒之《洛阳伽蓝记·闻义里》：“惠生在乌场国二年；西胡风俗；大同小异；不能具录。”', 1, 1),
(1043, '一诺千金', 4, '劲', 'yī nuò qiān jīn', '诺：许诺。许下的一个诺言有千金的价值。比喻说话算数，极有信用。', '出 处\n《史记·季布栾布列传》:“得黄金百斤，不如得季布一诺。”', 1, 1),
(1044, '一文不值', 2, '纹', 'yī wén bù zhí', '指毫无价值。', '出 处\n明·毕魏《三报恩·骂佞》:“最可悲年少科名，弄得一文不值。”', 1, 1),
(1045, '一贫如洗', 2, '平', 'yī pín rú xǐ', '穷得像用水洗过似的，什么都没有。形容十分贫穷。', '出 处\n元·关汉卿《窦娥冤》：“小生一贫如洗；流落在这楚州居住。”', 1, 1),
(1046, '两肋插刀', 4, '箭', 'liǎng lèi chā dāo', '两边肋骨插上刀，表示不怕死。比喻承担极大的牺牲。', '出 处\n蒋子龙《乔厂长上任记》:“让老乔先撤，你为他两肋插刀顶上一阵。”', 2, 1),
(1047, '两败俱伤', 4, '丧', 'liǎng bài jù shāng', '俱：都。斗争双方都受到损伤，谁也没得到好处。', '出 处\n宋·汪应辰《文定集·答梁子铺》：“东汉之君子必欲与小人立敌；终于两败俱伤；而国随以亡。”', 1, 1),
(1048, '一落千丈', 4, '障', 'yī luò qiān zhàng', '原指琴声陡然降落。后用来形容声誉、地位或经济状况急剧下降。', '出 处\n唐·韩愈《听颖师弹琴》：“跻攀分寸不可上；失势一落千丈强。”', 1, 1),
(1049, '万众一心', 1, '方', 'wàn zhòng yī xīn', '千万人一条心。形容团结一致。', '出 处\n《后汉书·朱擕传》:“万人一心，犹不可当，况十万乎！”', 1, 1),
(1050, '千方百计', 2, '芳', 'qiān fāng bǎi jì', '想尽或用尽一切办法。', '出 处\n《朱子语类·论语十七》:“譬如捉贼相似，须是着起气力精神，千方百计去赶他。”', 1, 1),
(1051, '九霄云外', 3, '晕', 'jiǔ xiāo yún wài ', '九霄：高空。在九重天的外面。比喻无限远的地方或远得无影无踪。', '近义词：烟消云散、无影无踪', 1, 1),
(1052, '十拿九稳', 4, '闻', 'shí ná jiǔ wěn', '比喻很有把握。', '出 处\n清·文康《儿女英雄传》：“如此一行；只怕这事例有个十拿九稳也不见得。”', 1, 1),
(1053, '千秋万代', 4, '带', 'qiān qiū wàn dài', '一千年，一万代。指世世代代，时间久长。', '近义词：世世代代、百岁千秋', 1, 1),
(1054, '千真万确', 2, '针', 'qiān zhēn wàn què', '形容情况非常确实。', '近义词：无可置疑、言之凿凿', 1, 1),
(1055, '万无一失', 4, '室', 'wàn wú yī shī', '失：差错。指非常有把握，绝对不会出差错。', '近义词：十拿九稳、稳操胜券', 1, 1),
(1056, '干干净净', 3, '尽', 'gàn gān jìng jìng ', '没有污垢、尘土、杂质。', '近义词：一干二净、清清爽爽', 1, 1),
(1057, '自言自语', 2, '严', 'zì yán zì yǔ', '自己一个人低声嘀咕。', '出 处\n元·无名氏《桃花女》第四折:“你这般鬼促促的，在这自言自语，莫不要出城去砍那桃树吗？”', 1, 1),
(1058, '东拼西凑', 4, '揍', 'dōng pīn xī còu ', '比喻零乱地加以拼凑。', '近义词：七拼八凑、东挪西凑', 1, 1),
(1059, '天南地北', 3, '底', 'tiān nán dì běi', '一在天之南，一在地之北。形容地区各不相同。也形容距离极远。', '出 处\n元·关汉卿《沉醉东风》：“咫尺的天南地北；要时间月缺花飞。”', 1, 1),
(1060, '东拉西扯', 4, '止', 'dōng lā xī chě', '一会儿说东，一会儿说西。指说话条理斋乱，没有中心。', '近义词：胡拉乱扯、说东道西', 1, 1),
(1061, '天诛地灭', 4, '没', 'tiān zhū dì miè', '诛：杀死。比喻罪恶深重，为天地所不容。', '出 处\n宋·朱晖《绝倒录》：“不使丁香、木香合，则天诛地灭。”', 1, 1),
(1062, '东奔西走', 3, '茜', 'dōng bēn xī zǒu', '到处奔波。多指为生活所迫或为某一目的四处奔走活动。', '近义词：东奔西跑、走南闯北', 1, 1),
(1063, '天罗地网', 4, '往', 'tiān luó dì wǎng', '天罗：张在空中捕鸟的网。天空地面，遍张罗网。指上下四方设置的包围圈。比喻对敌人、逃犯等的严密包围。', '出 处\n元·无名氏《锁魔镜》三折：“天兵下了天罗地网者；休走了两洞妖魔。”', 1, 1),
(1064, '有备无患', 4, '换', 'yǒu bèi wú huàn ', '患：祸患，灾难。事先有准备，就可以避免祸患。', '近义词：积谷防饥、未雨绸缪', 1, 1),
(1065, '千奇百怪', 2, '齐', 'qiān qí bǎi guài', '形容各种各样奇怪的事物。', '出 处\n宋·释惟白《续传灯录》：“如人在州县住；或闻或见；千奇百怪；他总将作寻常。”', 1, 1),
(1066, '无情无义', 2, '晴', 'wú qíng wú yì', '没有一点情义。形容冷酷无情。', '出 处\n清·曹雪芹《红楼梦》第八十二回:“好！宝玉，我今日才知道你是个无情无义的人了！”', 1, 1),
(1067, '平易近人', 3, '仅', 'píng yì jìn rén', '对人和蔼可亲，没有架子，使人容易接近。也指文字浅显，容易了解。', '出 处\n《史记·鲁周公世家》：“平易近民；民必归之。”', 1, 1),
(1068, '宽宏大度', 2, '弘', ' kuān hóng dà dù', '形容度量大，能容人。', '出 处\n元·戴善夫《风光好》第三折:“学士宽宏大度，何所不容。”', 2, 1),
(1069, '冰清玉洁', 3, '王', 'bīng qīng yù jié', '像冰那样清澈透明，像玉那样洁白无瑕。比喻人的操行清白（多用于女子）。', '出 处\n汉·司马迁《与挚伯陵书》：“伏唯伯陵材能绝人；高尚其志；以善厥身；冰清玉洁；不以细行。”', 1, 1),
(1070, '持之以恒', 4, '横', 'chí zhī yǐ héng ', '持：坚持；恒：恒心。长久坚持下去。', '出 处\n宋·楼钥《攻媿集·雷雨应诏封事》：“凡应天下之事；一切行之以诚；持之以久。”', 1, 1),
(1071, '锲而不舍', 1, '契', 'qiè ér bù shě', '锲：镂刻；舍：停止。不断地镂刻。比喻有恒心，有毅力。', '出 处\n《荀子·劝学》：“锲而舍之；朽木不折；锲而不舍；金石可镂。”', 2, 1),
(1072, '废寝忘食', 1, '非', 'fèi qǐn wàng shí', '废：停止。顾不得睡觉，忘记了吃饭。形容专心努力。', '近义词：发愤忘食、夜以继日', 1, 1),
(1073, '大义凛然', 3, '林', 'dà yì lǐn rán', '大义：正义；凛然：严肃、或敬畏的样子。由于胸怀正义而神态庄严，令人敬畏。', '出 处\n宋·曹铺《唐颜文忠公新庙记》：“大义凛然；奋裾首倡。”', 1, 1),
(1074, '不屈不挠', 2, '区', 'bù qū bù náo', '屈：屈服；挠：弯曲。比喻在压力和困难面前不屈服，表现十分顽强。', '出 处\n《汉书·叙传下》：“乐昌笃实；不桡（挠）不离（屈）。”', 1, 1),
(1075, '死而后已', 4, '己', 'sǐ ér hòu yǐ', '已：停止。死了以后才罢手。形容为完成一种责任而奋斗终身。', '出 处\n《论语·泰伯》:“士不可以不弘毅，任重而道远。仁以为己任，不亦重乎？死而后已，不亦远乎？”', 2, 1),
(1076, '料事如神', 1, '抖', 'liào shì rú shén', '料：预料。预料事情象神仙一样准确。形容预料事情非常准确。', '出 处\n宋·杨万里《提刑徽猷检正王公墓志铭》：“公器识宏深；襟度宽博；议论设施加人数等；料事如神；物无遁情。”', 1, 1),
(1077, '足智多谋', 4, '某', 'zú zhì duō móu', '足：充实，足够；智：聪明、智慧；谋：计谋。富有智慧，善于谋划。形容人善于料事和用计。', '出 处\n元·无名氏《连环计》第一折:“此人足智多谋，可与共事。”', 1, 1),
(1078, '学贯中西', 2, '惯', 'xué guàn zhōng xī', '形容学问贯通了中国和西方的种种知识。', '出 处\n清·吴趼人《二十年目睹之怪现状》第八十一回:“本领事久闻这位某观察，是曾经某制军保举过他留心时务、学贯中西的。”', 2, 1),
(1079, '博古通今', 1, '搏', 'bó gǔ tōng jīn', '通：通晓；博：广博，知道得多。对古代的事知道得很多，并且通晓现代的事情。形容知识丰富。', '出 处\n《孔子家语·观周》：“吾闻老聃博古通今。”', 1, 1),
(1080, '才华横溢', 3, '恒', 'cái huá héng yì', '才华：表现于外的才能。多指文学艺术方面而言，很有才华。', '例 句\n这里人才济济，有许多～的画家、记者。', 1, 1),
(1081, '博大精深', 4, '探', 'bó dà jīng shēn', '博：广，多。形容思想和学识广博高深。', '出 处\n明·姜世昌《逸周书》：“迄今读之；若揭日月而行千载；其博大精深之旨；非晚世学者所及。”', 1, 1),
(1082, '集思广益', 4, '义', 'jí sī guǎng yì', '集：集中；思：思考，意见；广：扩大。指集中群众的智慧，广泛吸收有益的意见。', '出 处\n三国·蜀·诸葛亮《教与军师长史参军掾属》：“夫参署者；集众思；广忠益也。”', 2, 1),
(1083, '憨态可掬', 1, '敢', 'jí sī guǎng yì', '集：集中；思：思考，意见；广：扩大。指集中群众的智慧，广泛吸收有益的意见。', '出 处\n三国·蜀·诸葛亮《教与军师长史参军掾属》：“夫参署者；集众思；广忠益也。”', 1, 1),
(1084, '文质彬彬', 2, '智', 'wén zhì bīn bīn', '文：文采；质：实质；彬彬：形容配合适当。原形容人既文雅又朴实，后形容人文雅有礼貌。', '出 处\n《论语·雍也》：“质胜文则野；文胜质则史。文质彬彬；然后君子。”', 1, 1),
(1085, '风度翩翩', 2, '杜', 'ēng dù piān piān', '风度：风采气度，指美好的举止姿态；翩翩：文雅的样子。举止文雅优美。', '出 处\n《史记·平原君列传》:“平原君，翩翩浊世之佳公子也。”《新唐书·张九龄传》:“风度能若张九龄乎？”', 1, 1),
(1086, '相貌堂堂', 2, '茂', 'xiàng mào táng táng', '形容人的仪表端正魁梧。', '出 处\n明·吴承恩《西游记》第五十四回:“御弟相貌堂堂，丰姿英俊，诚是天朝上国之男儿，南赡中华之人物。”', 1, 1),
(1087, '落落大方', 4, '放', 'luò luò dà fāng', '落落：坦率，开朗的样子。形容言谈举止自然大方。', '出 处\n郭沫若《蔡文姬》第四幕:“对于我们也是非常宽大的。还有他的夫人也落落大方。”', 1, 1),
(1088, '斗志昂扬', 3, '仰', 'dòu zhì áng yáng', '昂扬：情绪高涨。斗争的意志旺盛。', '出 处\n毛泽东《介绍一个合作社》:“从来也没有看见人民群众象现在这样精神振奋，斗志昂扬，意气风发。”', 1, 1),
(1089, '意气风发', 3, '凤', 'yì qì fēng fā', '意气：意志和气概；风发：像风吹一样迅猛。形容精神振奋，气概豪迈。', '出 处\n三国·魏·曹植《魏德论》：“武皇之兴也，以道凌残，义气风发。”', 1, 1),
(1090, '威风凛凛', 1, '危', 'wēi fēng lǐn lǐn', '威风：威严的气概；凛凛：严肃，可敬畏的样子。形容声势或气派使人敬畏。', '出 处\n元·费唐臣《贬黄州》：“见如今御台威风凛凛；怎敢向翰林院文质彬彬。”', 2, 1),
(1091, '容光焕发', 1, '荣', 'róng guāng huàn fā', '容光：脸上的光彩；焕发：光彩四射的样子。形容身体好，精神饱满。', '出 处\n清·蒲松龄《聊斋志异》：“母亦喜；为女盥濯；竟妆；容光焕发。”', 1, 1),
(1092, '神采奕奕', 1, '甚', 'shén cǎi yì yì', '奕奕：精神焕发的样子。形容精神饱满，容光焕发。', '出 处\n明·沈德符《万历野获编·玩具》：“细视良久；则笔意透出绢外；神采奕奕。”', 1, 1),
(1093, '悠然自得', 1, '优', 'yōu rán zì dé', '悠然：闲适的样子；自得：内心得意舒适。形容悠闲而舒适。', '出 处\n明·袁宏道《满井游记》：“凡曝沙之鸟；呷浪之鳞；悠然自得；毛羽鳞鬓之间；皆有喜色。”', 1, 1),
(1094, '喜笑颜开', 3, '言', 'xǐ xiào yán kāi', '颜开：脸面舒开，指笑容。形容心里高兴，满面笑容。', '出 处\n清·李汝珍《镜花缘》第九十九回:“穿过牌楼，人来人往，莫不喜笑颜开。”', 1, 1),
(1095, '欣喜若狂', 1, '辛', 'xīn xǐ ruò kuáng', '欣喜：快乐；若：好像；狂：失去控制。形容高兴到了极点。', '出 处\n唐·杜甫《闻官军收河南河北》：“却看妻子愁何在；漫卷诗书喜欲狂。”', 1, 1),
(1096, '勃然大怒', 1, '脖', 'bó rán dà nù ', '勃然：突然。突然变脸大发脾气。', '出 处\n《汉书·谷永传》：“是故皇天勃然发怒。”', 1, 1),
(1097, '能说会道', 4, '到', 'néng shuō huì dào', '形容很会讲话。', '出 处\n元·无名氏《渔樵闲话》：“但甜瓜软处偏捏。蜡枪头会道能说。”', 1, 1),
(1098, '巧舌如簧', 4, '黄', 'qiǎo shé rú huáng', '舌头灵巧，像簧片一样能发出动听的乐音。形容花言巧语，能说会道。', '出 处\n唐·刘兼《诫是非》：“巧舌如簧总莫听；是非多自爱憎生。三人告母虽投杼；百犬闻风只吠声。”', 1, 1),
(1099, '能言善辩', 3, '擅', 'néng yán shàn biàn', '能：善于。形容能说会道，有辩才。', '出 处\n元·无名氏《气英布》：“若得能言巧辩之士；说他归降。”', 2, 1),
(1100, '出口成章', 4, '张', 'chū kǒu chéng zhāng', '说出话来就成文章。形容文思敏捷，口才好。', '出 处\n《诗经·小雅·都人士》：“出言有章。”', 1, 1),
(1101, '语惊四座', 4, '坐', 'yǔ jīng sì zuò', '形容发言独特、新奇，使人震惊。', '该词语不属于典故，所以没有出处。', 1, 1),
(1102, '娓娓而谈', 4, '弹', 'wěi wěi ér tán', '连续不倦地谈论着。', '出 处\n鲁迅《且介亭杂文二集·〈中国新文学大系〉小说二集序》:“然而他并不“拙笨”，却也不矫揉造作，只如熟人相对，娓娓而谈。”', 1, 1),
(1103, '妙语连珠', 2, '雨', 'miào yǔ lián zhū', '连珠：串珠。巧妙风趣的话一个接一个。', '例 句\n在学校的辩论会上，他～的发言赢来了大家的掌声。', 1, 1),
(1104, '口若悬河', 3, '具', 'kǒu ruò xuán hé', '若:好像；悬河:激流倾泻。讲起话来滔滔不绝，像瀑布不停地奔流倾泻。形容能说会辩，说起来没个完。', '近义词：喋喋不休、悬河泻水', 1, 1),
(1105, '铁杵成针', 2, '许', 'tiě chǔ chéng zhēn', '比喻只要有毅力，肯下苦功，事情就能成功。', '出 处\n明·郑之珍《目连救母·四·刘氏斋尼》：“好似铁杵磨针；心坚杵有成针日。”', 1, 1),
(1106, '四面楚歌', 4, '哥', 'sì miàn chǔ gē', '比喻陷入四面受敌、孤立无援的境地。', '出 处\n梁启超《中国国会制度私议》：“殆陷于四面楚歌之中；反恃解释条文以持其说。”', 1, 1),
(1107, '负荆请罪', 2, '棘', 'fù jīng qǐng zuì', '负：背着；荆：荆条。背着荆条向对方请罪。表示向人认错赔罪。', '出 处\n《史记·廉颇蔺相如列传》记载：“廉颇闻之；肉袒负荆；因宾客至蔺相如门谢罪。曰：‘鄙贱之人；不知将军宽之至此也。’”', 1, 1),
(1108, '精忠报国', 2, '钟', 'jīng zhōng bào guó', '为国家竭尽忠诚，牺牲一切。', '出 处\n《北史·颜之仪传》：“公等备受朝恩；当尽忠报国；奈何一旦欲以神器假人！”', 1, 1),
(1109, '凿壁偷光', 2, '璧', 'záo bì tōu guāng', '原指西汉匡衡凿穿墙壁引邻舍之烛光读书。后用来形容家贫而读书刻苦。', '近义词：囊萤映雪、悬梁刺股', 1, 1),
(1110, '扶老携幼', 4, '幻', 'fú lǎo xié yòu', '携：拉着，带领。搀着老人，领着小孩。\n', '出 处\n《战国策·齐策四》：“孟尝君就国于薛。未至百里；民扶老携幼；迎（孟尝）君道中。”', 1, 1),
(1111, '手舞足蹈', 4, '稻', 'shǒu wǔ zú dǎo', '蹈：顿足踏地。两手舞动，两只脚也跳了起来。形容高兴到了极点。也手乱舞、脚乱跳的狂态。', '出 处\n《孟子·离娄上》：“乐则生矣；全则恶可已也。恶可已；则不知足之蹈之；手之舞之。”', 1, 1),
(1112, '促膝谈心', 3, '弹', 'cù xī tán xīn', '促：靠近；促膝：膝碰膝，坐得很近。形容亲密地谈心里话。', '出 处\n明·冯梦龙《喻世明言》：“大郎置酒相待；促膝谈心；甚是款洽”。', 1, 1),
(1113, '张牙舞爪', 4, '瓜', 'zhāng yá wǔ zhǎo', '张：张开；舞：挥舞。形容猛兽凶恶可怕。也比喻猖狂凶恶。', '近义词：凶相毕露、金刚怒目', 1, 1),
(1114, '平易近人', 2, '一', 'píng yì jìn rén', '对人和蔼可亲，没有架子，使人容易接近。也指文字浅显，容易了解。', '出 处\n《史记·鲁周公世家》：“平易近民；民必归之。”', 1, 0),
(1115, '平易近人', 1, '瓶', 'píng yì jìn rén', '对人和蔼可亲，没有架子，使人容易接近。也指文字浅显，容易了解。', '出 处\n《史记·鲁周公世家》：“平易近民；民必归之。”', 1, 0),
(1116, '平易近人', 4, '仁', 'píng yì jìn rén', '对人和蔼可亲，没有架子，使人容易接近。也指文字浅显，容易了解。', '出 处\n《史记·鲁周公世家》：“平易近民；民必归之。”', 1, 0),
(1117, '哄堂大笑', 1, '轰', 'hōng táng dà xiào', '形容全屋子的人同时大笑。', '出 处\n宋·欧阳修《归田录》第一卷：“冯徐举其右足曰：‘此亦九百。’于是烘（哄）堂大笑。”', 2, 1),
(1118, '洪福齐天', 1, '鸿', 'hóng fú qí tiān', '洪：大。旧时颂扬人福气极大。', '出 处\n《西游记》第六十三回：“二郎道：‘一则是那国王洪福齐天；二则是贤昆玉神通无量；我何功之有！’”', 2, 1),
(1119, '鸿篇巨制', 1, '宏', 'hóng piān jù zhì', '鸿：巨，大。形容工程大，功夫深的著作。', '出 处\n明·胡应麟《少室山房笔丛》：“四者（按：此处系指经、史、子、集）之中；各为门户；古今鸿钜（同“巨”）；罕得二三。”', 2, 1),
(1120, '侯门似海', 1, '候', 'hóu mén sì hǎi', '王公贵族的门庭像大海那样深邃。旧时豪门贵族、官府的门禁森严，一般人不能轻易进入。也比喻旧时相识的人，后因地位悬殊而疏远。', '出 处\n唐·崔郊《赠去婢》:“公子王孙逐后尘，绿珠垂泪滴罗中；侯门一入深如海，从此萧郎是路人。”', 2, 1),
(1121, '精神涣散', 3, '焕', 'jīng shén huàn sàn', '精神：神志，心神；涣散：分散，散漫。形容精神分散不集中。', '出 处\n汉·焦延寿《易林》第14卷：“精神涣散，离其躬身。”', 2, 1),
(1122, '风云变幻', 4, '换', 'fēng yún biàn huàn', '像风云那样变化不定。比喻时局变化迅速，动向难以预料。', '近义词：风谲云诡、瞬息万变', 2, 1),
(1123, '荒谬绝伦', 1, '谎', ' huāng miù jué lún', '绝伦：超过同类。没有比这更荒唐更不合情理的了。', '出 处\n清·龚自珍《语录》：“此等依托；乃得罪孔子之尤；荒谬绝伦之作；作者可醢也。”', 2, 1),
(1124, '心灰意冷', 2, '恢', 'xīn huī yì lěng', '灰心失望，意志消沉。', '出 处\n清·梁启超《湖南时务学堂学约》：“非有坚定之力，则一经挫折，心灰意冷。”', 2, 1),
(1125, '风雨如晦', 4, '悔', 'fēng yǔ rú huì', '指白天刮风下雨，天色暗得像黑夜一样。形容政治黑暗，社会不安。', '出 处\n清·汪琬《来虞先生年谱后序》：“先生严禁境内不得擅建生祠。风雨如晦；鸡鸣不已。”', 2, 1),
(1126, '直言不讳', 4, '违', 'zhí yán bù huì', '讳：避忌，隐讳。说话坦率，毫无顾忌。', '出 处\n《晋书·刘波传》：“臣鉴先征；窃惟今事；是以敢肆狂瞽；直言无讳。”', 2, 1),
(1127, '浑身是胆', 1, '混', 'hún shēn shì dǎn', '形容胆量大，无所畏惧。', '出 处\n宋·陈著《宝鼎现·寿京尹曾留远侍郎渊子》词：“最是满腹精神；担负处；浑身是胆。”', 2, 1),
(1128, '插科打诨', 4, '浑', 'chā kē dǎ hùn', '科：指古典戏曲中的表情和动作；诨：诙谐逗趣的话。戏曲、曲艺演员在表演中穿插进去的引人发笑的动作或语言。', '出 处\n明·高明《琵琶记·报告戏情》：“休论插科打诨；也不寻宫数调；只看子孝又妻贤。”', 2, 1),
(1129, '疾风劲草', 1, '急', 'jí fēng jìng cǎo', '在猛烈的大风中，只有坚韧的草才不会被吹倒。比喻只有经过严峻的考验，才知道谁真正坚强。', '出 处\n《东观汉记·王霸传》：“颍川从我者皆逝，而子独留，始验疾风知劲草。”', 2, 1),
(1130, '若即若离', 2, '及', 'ruò jí ruò lí', '形容对人保持一定距离。', '出 处\n清·文康《儿女英雄传》：“这边两个新人在新房里乍来乍去；如蛱蝶穿花；若即若离；似蜻蜓点水。”', 2, 1),
(1131, '痛心疾首', 3, '击', 'tòng xīn jí shǒu', '疾首：头痛。形容痛恨到了极点。', '出 处\n《左传·成公十三年》：“诸侯备闻此言；斯是痛心疾首；昵就寡人。”', 2, 1),
(1132, '不计其数', 2, '记', 'bù jì qí shù', '没法计算数目。形容很多。', '出 处\n宋·周密《武林旧事·西湖游赏》：“其余则不计其数。”', 2, 1),
(1133, '丰功伟绩', 4, '迹', 'fēng gōng wěi jì', '丰：大。伟大的功绩。', '出 处\n宋·包拯《天章阁对策》：“睿谋神断；丰功伟绩　；历选明辟；未之前闻。”', 2, 1),
(1134, '缄口不言', 1, '箴', 'jiān kǒu bù yán', '缄：封闭。封住嘴巴，不开口说话。', '出 处\n《明史·何遵传》：“正德间；给事、御史挟势凌人；趋权择便；凡朝廷大阙失；群臣大奸恶；缄口不言。”', 2, 1),
(1135, '口腹蜜剑', 4, '箭', 'kǒu fù mì jiàn', '口蜜腹剑”这则成语的意思是比喻口头上说话好听，像蜜一样甜，肚子里却怀着暗害人的阴谋。', '近义词：口腹蜜饯', 2, 1),
(1136, '截长补短', 1, '接', ' jié cháng bǔ duǎn', '截取长的，补充短的。比喻用长处补短处。', '出 处\n宋·度正《条奏便民五事》：“旧城堙废之余；截长补短；可得十之五；为工约二万余工；为缗约五千余缗；而城可成矣。”', 2, 1),
(1137, '目不交睫', 4, '捷', 'mù bù jiāo jié', '交睫：上下睫毛相交接，即闭眼。没有合上眼皮。形容夜间不睡觉或睡不着。', '出 处\n汉·荀悦《汉纪·文帝纪上》：“陛下在代时，太后尝病三年，陛下目不交睫，睡不解衣冠。”', 2, 1),
(1138, '耳根清净', 4, '静', 'ěr gēn qīng jìng', '耳边无事噪聒。指无事打扰。', '出 处\n《圆觉经》上卷：“闻清净故，耳根清净，根清净故，耳识清净。”', 2, 1),
(1139, '龙盘虎踞', 4, '据', 'lóng pán hǔ jù', '盘：曲折环绕；踞：蹲、坐。好像盘绕的龙，蹲伏的虎。特指南京。亦形容地势雄伟险要。', '出 处\n汉·刘胜《文本赋》：“条枝摧折；既剥且刊；见其文章；或如龙盘虎踞；复似鸾集凤翔。”', 2, 1),
(1140, '细大不捐', 4, '涓', 'xì dà bù juān', '细：微，小；捐：舍弃。小的大的都不抛弃。形容包罗一切，没有选择。', '出 处\n唐·韩愈《进学解》:“贪多务得，细大不捐。”', 2, 1),
(1141, '豆蔻年华', 2, '寇', 'dòu kòu nián huá', '豆蒄：多年生草本植物，比喻处女。指女子十三四岁时。', '出 处\n唐·杜牧《赠别》：“娉娉袅袅十三余；豆蔻梢头二月初。”', 2, 1),
(1142, '功亏一篑', 4, '溃', 'gōng kuī yī kuì', '亏：欠缺；篑：盛土的筐子。堆九仞高的山，只缺一筐土而不能完成。比喻做事情只差最后一点没能完成。', '出 处\n《尚书·旅獒》：“为山九仞；功亏一篑。”', 2, 1),
(1143, '利令智昏', 1, '理', 'lì lìng zhì hūn', '令：使；智：理智；昏：昏乱，神智不清。因贪图私利而失去理智，把什么都忘了。', '出 处\n《史记·平原君虞卿列传赞》：“鄙语曰：‘利令智昏’。平原君贪冯亭邪说；使赵陷长平兵四十余万众；邯郸几亡。”', 2, 1),
(1144, '戮力同心', 4, '戳', 'lù lì tóng xīn', '戮力：并力；同心：齐心。齐心合力。', '出 处\n《左传·成公十三年》：“昔逮我献公及穆公相好；戮力同心；申之以盟誓；重之以婚姻。”', 2, 1),
(1145, '据为己有', 1, '居', 'jù wéi jǐ yǒu', '将别人的东西拿来作为自己的。', '出 处\n明·冯梦龙《醒世恒言》：“我故倡为析居之议；将大宅良田；强奴巧婢；悉据为己有。度五弟素敦爱敬；决不争竞。”', 2, 1),
(1146, '高屋建瓴', 4, '领', 'gāo wū jiàn líng', '建：倒水，泼水；瓴：盛水的瓶子。把瓶子里的水从高层顶上倾倒。比喻居高临下，不可阻遏。', '出 处\n西汉·司马迁《史记·高祖本纪》：“地势便利，其以下兵于诸侯，譬犹居高屋之上建瓴水也。”', 2, 1),
(1147, '语无诠次', 3, '论', 'yǔ wú quán cì', '言辞未加选择和斟酌。', '语无诠次和语无伦次是近义词，此处选项是“论”而不是“伦”，所以应该选择语无诠次。', 3, 1),
(1148, '满腹经纶', 4, '伦', 'mǎn fù jīng lún', '经纶：整理丝缕，引伸为人的才学、本领。形容人极有才干和智谋。', '出 处\n明·冯惟敏《海浮山堂词稿·商调集贤宾·题春园·浪里束煞》：“论英雄何必老林泉？满腹经纶须大展；休负了苍生之愿。”', 2, 1),
(1149, '流芳百世', 1, '留', 'liú fāng bǎi shì', '流：流传；芳：香，指好名声；百世：时间久远。好的名声永远流传下去。', '出 处\n南北朝·刘义庆《世说新语》：“桓公卧语曰：‘作此寂寞；将为文景所笑。’既而屈起坐曰：‘既不能流芳百世；亦不足复遗臭万载耶？’”', 2, 1),
(1150, '脉络分明', 2, '胳', 'mài luò fēn míng', '比喻有条有理或做事有条不紊。', '出 处\n宋·朱熹《中庸章句集注》', 2, 1),
(1151, '门可罗雀', 4, '鹊', 'mén kě luó què', '罗：张网捕捉。大门之前可以张起网来捕麻雀。形容十分冷落，宾客稀少。', '出 处\n《史记·汲郑传赞》：“始翟公为廷尉；宾客阗门；及废；门外可设雀罗。”', 2, 1),
(1152, '凤毛麟角', 3, '鳞', 'fèng máo lín jiǎo', '凤凰的羽毛，麒麟的角。比喻珍贵而稀少的人或物。', '出 处\n明·何良俊《四友斋丛说》：“康对山之文；天下慕向之；如凤毛麟角。”', 2, 1),
(1153, '巧言令色', 3, '厉', 'qiǎo yán lìng sè', '巧言：花言巧语；令色：讨好的表情。形容花言巧语，虚伪讨好。', '出 处\n《书·皋陶谟》:“何畏乎巧言令色孔壬。”', 2, 1),
(1154, '心狠手辣', 4, '棘', 'xīn hěn shǒu là', '心肠凶狠，手段毒辣。', '出 处\n清·藤谷古香《轰天雷》：“唐敬宗之于刘克明；未尝欲诛之也；而克明卒弑之于饮酒烛灭时矣。刑余之人；心狠手辣；自古然也。”', 2, 1),
(1155, '粗制滥造', 3, '乱', 'cū zhì làn zào', '滥：过多，不加节制。写文章或做东西马虎草率，只求数量，不顾质量。', '出 处\n鲁迅《花边文学·高贾的批评》：“不过也要有一点常识；用一点苦工；要不然；就是‘杂文’也不免更进一步的‘粗制滥造’；只剩下笑柄。”', 2, 1),
(1156, '宁缺毋滥', 4, '烂', 'nìng quē wú làn', '宁：宁愿；毋：不；滥：过度。选拔人才或挑选事物，宁可少一些，也不要不顾质量贪多凑数。', '出 处\n清·李绿园《歧路灯》第五回：“即令宁缺勿滥；这开封是一省首府；祥符是开封首县；却是断缺不得的。”', 2, 1),
(1157, '利害得失', 1, '厉', 'lì hài dé shī ', '好处和坏处，得益和损失。', '近义词：成败得失', 2, 1),
(1158, '变本加厉', 4, '利', 'biàn běn jiā lì', '厉：猛烈。指比原来更加发展。现指情况变得比本来更加严重。', '出 处\n南朝·梁·萧统《文选序》：“盖踵其事而增华；变其本而加厉；物既有之；文亦宜然。”', 2, 1),
(1159, '冠冕堂皇', 2, '勉', ' guān miǎn táng huáng', '冠冕：古代帝王、官吏的帽子；堂皇：很有气派的样子。形容外表庄严或正大的样子。', '出 处\n清·李宝嘉《官场现形记》第五十六回；“有一些老一辈人见他话说得冠冕堂皇；都说；某人虽有嗜好；尚还有自爱之心。”', 2, 1),
(1160, '死不瞑目', 3, '暝', 'sǐ bù míng mù', '瞑目：闭眼。死了也不闭眼。原指人死的时候心里还有放不下的事。现常用来形容极不甘心。', '出 处\n《三国志·孙坚传》：“卓逆天无道；荡覆王室；今不夷汝三族；悬示四海；则吾死不瞑目。”', 2, 1),
(1161, '勉为其难', 1, '免', 'miǎn wéi qí nán', '勉：勉强；为：做。勉强去做能力所不及或不愿去做的事。', '出 处\n梁信《从奴隶到将军》下集第四章:“可是，情况尚不分明，我怎样迎敌？好吧，勉为其难吧。”', 2, 1),
(1162, '漠不关心', 1, '莫', 'mò bù guān xīn', '漠：冷淡。态度冷淡，毫不关心。', '出 处\n明·朱之瑜《与冈骑昌纯书二首》：“至于一身之荣瘁；禄食之厚薄；则～；故惟以得行其道为悦。”', 2, 1),
(1163, '助纣为虐', 4, '谑', 'zhù zhòu wéi nüè', '比喻帮助坏人干坏事。', '出 处\n《史记·留侯世家》：“今始入秦；即安其乐；此所谓助桀为虐。”', 2, 1),
(1164, '俗不可耐', 4, '奈', 'sú bù kě nài', '俗：庸俗；耐：忍受得住。庸俗得使人受不了。', '出 处\n清·蒲松龄《聊斋志异·沂水秀才》：“一美人置白金一铤；可三四两许；秀才掇内袖中。美人取巾；握手笑出曰：‘俗不可耐。’”', 2, 1),
(1165, '无可奈何', 3, '耐', 'wú kě nài hé', '奈何：如何，怎么办。指感到没有办法，只有这样了。', '出 处\n《史记·周本纪》：“太史伯阳曰：‘祸成矣；无可奈何！’”', 2, 1),
(1166, '罪不及孥', 4, '奴', 'zuì bù jí nú', '治罪止于本人，不累及妻和子女。', '孥指子女，亦指妻子和儿女。', 2, 1),
(1167, '强弩之末', 2, '驽', 'qiáng nǔ zhī mò', '强弩所发的矢，飞行已达末程。比喻强大的力量已经衰弱，起不了什么作用。', '出 处\n汉·司马迁《史记·韩安国列传》：“强弩之末；矢不能穿鲁缟。”', 2, 1),
(1168, '金瓯无缺', 2, '殴', 'jīn ōu wú quē', '金瓯：盛酒器，比喻国土。金瓯没有残缺。比喻国土完整。', '出 处\n明·徐宏祖《徐霞客游记·黔游日记》：“但各州之地，俱半错卫屯，半沦苗孽，似非当时金瓯无缺矣。”', 2, 1),
(1169, '无独有偶', 4, '隅', 'wú dú yǒu ǒu', '独：一个；偶：一双。不只一个，竟然还有配对的。表示两事或两人十分相似。', '出 处\n清·壮者《扫迷帚》：“闻简某系蜀人；而此女亦是蜀人；可谓无独有偶。', 2, 1),
(1170, '蓬荜生辉', 1, '篷', 'péng bì shēng huī', '蓬荜：编蓬草、荆竹为门，形容穷苦人家。使寒门增添光辉（多用作宾客来到家里，或赠送可以张挂的字画等物的客套话）。', '出 处\n宋·王柏《回赵星诸书》：“专使远临；俯授宝帖；联题累牍；蓬荜生光。”', 2, 1),
(1171, '披沙拣金', 1, '批', 'pī shā jiǎn jīn', '拨开沙子来挑选金子。比喻从大量的东西中选取精华。', '出 处\n唐·刘知几《史通·直书》：“然则历考前史；征诸直词；虽古人糟粕；真伪相乱；而披沙拣金；时有获宝。”', 2, 1),
(1172, '虚无缥缈', 3, '飘', 'xū wú piāo miǎo', '虚无：空虚；缥缈：隐隐约约，若有若无的样子。形容空虚渺茫。', '出 处\n唐·白居易《长恨歌》:“忽闻海上有仙山，山在虚无缥缈间。”', 2, 1),
(1173, '心怀叵测', 3, '巨', 'xīn huái pǒ cè', '心怀：居心，存心；叵：不可。指存心险恶，不可推测。', '出 处\n明·罗贯中《三国演义》第五十七回:“曹操心怀叵测，叔父若往，恐遭其害。”', 2, 1),
(1174, '东施效颦', 4, '频', 'dōng shī xiào pín', '效：仿效；颦：皱眉头。比喻胡乱模仿，效果极坏。', '近义词：亦步亦趋、鹦鹉学舌', 2, 1),
(1175, '星罗棋布', 3, '旗', 'xīng luó qí bù', '罗：罗列；布：分布。像天空的星星和棋盘上的棋子那样分布着。形容数量很多，分布很广。', '出 处\n汉·班固《西京赋》：“列卒周币；星罗云布。”', 2, 1),
(1176, '修葺一新', 2, '茸', 'xiū qì yī xīn', '修理建筑物，使它如新。', '近义词：焕然一新', 3, 1),
(1177, '一窍不通', 2, '窃', 'yī qiào bù tōng', '窍：洞，指心窍。没有一窍是贯通的。比喻一点儿也不懂。', '出 处\n元·张国宝《罗李郎大闹相国寺》：“啊；这老爹一窍也不通。”', 2, 1),
(1178, '却之不恭', 4, '躬', 'què zhī bù gōng', '却：推却。指对别人的邀请、赠与等，如果拒绝接受，就显得不恭敬。', '出 处\n明·沈德符《万历野获编》：“此贤妃敬贤之礼；却之不恭；是当谅其心矣。”', 2, 1),
(1179, '当仁不让', 2, '人', 'dāng rén bù ràng', '原指以仁为任，无所谦让。后指遇到应该做的事就积极主动去做，不推让。', '出 处\n《论语·卫灵公》：“子曰：‘当仁不让于师。’”', 2, 1),
(1180, '繁文缛节', 3, '褥', 'fán wén rù jié', '文：规定、仪式；缛：繁多；节：礼节。过分繁琐的仪式或礼节。也比喻其他繁琐多余的事项。', '出 处\n宋·苏轼《上圆丘合祭卞议》：“议者必又曰：‘省去繁文末节；则一岁可以再郊。’”', 2, 1),
(1181, '不辨菽麦', 3, '椒', 'bù biàn shū mài', '菽：豆子。分不清哪是豆子，哪是麦子。形容愚笨无知。后形容缺乏实际生产知识。', '出 处三国·陈琳《檄吴将校部曲文》：“孙权小子；未辨菽麦。”', 3, 1),
(1182, '夙兴夜寐', 1, '宿', 'sù xīng yè mèi', '夙：早；兴：起来；寐：睡。早起晚睡。形容勤奋。', '出 处\n《诗经·卫风·氓》：“夙兴夜寐；靡有朝矣。”', 2, 1),
(1183, '歃血为盟', 1, '插', 'shà xuè wéi méng', '歃血：古代会盟，把牲畜的血涂在嘴唇上，表示诚意；盟：宣誓缔约。。泛指发誓订盟。', '出 处\n唐·苏安恒《请则天皇后复位于皇子》：“歃血为盟；指河为誓；非李氏不王；非功臣不封。”', 2, 1),
(1184, '礼尚往来', 2, '上', 'lǐ shàng wǎng lái', '尚：注重。指礼节上应该有来有往。现也指以同样的态度或做法回答对方。', '出 处\n宋·胡寅《斐然集》：“礼尚往来思报玖；情深吸引屡抛砖。”', 2, 1),
(1185, '孤芳自赏', 4, '常', 'gū fāng zì shǎng', '孤芳：独秀一时的香花。把自己比做仅有的香花而自我欣赏。比喻自命清高。', '出 处\n宋·张孝祥《念奴娇·过洞庭》：“应念岭表经年；孤芳自赏；肝胆皆冰雪。”', 2, 1),
(1186, '喜上眉梢', 4, '捎', 'xǐ shàng méi shāo', '喜悦的心情从眉眼上表现出来。', '出 处\n清·文康《儿女英雄传》：“思索良久；得了主意；不觉喜上眉梢。”', 2, 1),
(1187, '谈笑风生', 4, '声', 'tán xiào fēng shēng', '有说有笑，兴致高。形容谈话谈得高兴而有风趣。', '出 处\n宋·辛弃疾《念奴娇·赠夏成玉》：“遐想后日蛾眉；西山横黛；谈笑风生颊。”', 2, 1),
(1188, '盛气凌人', 1, '神', 'shèng qì líng rén', '盛气：骄横的气焰；凌：欺凌。以骄横的气势压人。形容傲慢自大，气势逼人。', '出 处\n清·曾国藩《求阙斋语》：“今日我以盛气凌人；预想他日人亦以盛气凌我。”', 2, 1),
(1189, '舍生取义', 2, '全', 'shě shēng qǔ yì', '舍：舍弃；生：生命；取：求取；义：正义。舍弃生命以取得正义。指为正义而牺牲生命。', '出 处\n《晋书·梁王肜传》：“肜位为宰相……而临大节；无不可夺之志；当危事；不能舍生取义。”', 2, 1),
(1190, '名落孙山', 3, '深', 'míng luò sūn shān', '名字落在榜末孙山的后面。指考试或选拔没有录取。', '出 处\n清·李宝嘉《官场现形记》第五十四回：“等到出榜；名落孙山；心上好不懊恼。”', 2, 1),
(1191, '视死如归', 1, '见', 'shì sǐ rú guī', '把死看得像回家一样平常。形容不怕牺牲生命。', '出 处\n《管子·小匡》：“平原广牧；车不结辙；士不旋踵；鼓之而三军之士视死如归；臣不如王子城父。”', 2, 1),
(1192, '舐犊情深', 1, '鸪', 'shì dú qíng shēn', '比喻对子女的慈爱。', '出 处\n\n《后汉书·杨彪传》：“犹怀老牛舐犊之爱。”', 2, 1),
(1193, '手不释卷', 3, '失', 'shǒu bù shì juàn', '释：放下；卷：指书籍。书本不离手。形容勤奋好学。', '出 处\n《三国志》裴松之注引《江表传》：“光武当兵马之务；手不释卷。”', 2, 1),
(1194, '各抒己见', 2, '书', 'gè shū jǐ jiàn', '抒：抒发，发表。各人充分发表自己的意见。', '出 处\n唐·李翱《李文权文集·陵庙日时朔祭议》:“先儒穿凿，各伸己见，皆托古圣贤之名以信其语，故其所记各不同也。”', 2, 1),
(1195, '肆无忌惮', 1, '肄', 'sì wú jì dàn', '肆：放肆；忌：顾忌；惮：害怕。非常放肆，一点没有顾忌。', '出 处\n《礼记·中庸》：“小人之中庸也；小人而无忌惮。”宋·朱熹注：“小人不知有此；则肆欲妄行；而无所忌惮矣。”', 2, 1),
(1196, '昙花一现', 1, '坛', 'tán huā yī xiàn', '昙花：即优昙钵花，开放时间很短。比喻美好的事物或景象出现了一下，很快就消失。', '出 处\n《妙法莲华经·方便品》：“佛告舍利弗；如是妙法；诸佛如来；时乃说之；如优昙钵花；时一现耳。”', 2, 1),
(1197, '恬不知耻', 1, '括', 'tián bù zhī chǐ', '做了坏事满不在乎，一点儿也不感到羞耻。', '出 处\n宋·钱时《两汉笔记》：“谏不行；言不听；膏泽不下于民；而但缄默固位；恬不知耻；又可谓贤乎？”', 2, 1),
(1198, '花天酒地', 2, '田', 'huā tiān jiǔ dì', '形容沉湎在酒色之中。花，指妓女。', '出 处\n《官场现形记》第二十七回：“贾某总办河工；浮开报销；滥得报举。到京之后；又复花天酒地；任意招摇。”', 2, 1),
(1199, '出人头地', 3, '投', 'chū rén tóu dì', '指高人一等。形容德才超众或成就突出。', '出 处\n宋·欧阳修《与梅圣俞书》：“老夫当避路；放他出一头地也。”', 2, 1),
(1200, '混为一谈', 4, '团', 'hùn wéi yī tán', '把不同的事物混在一起，当作同样的事物谈论。', '出 处\n唐·韩愈《平淮西碑》：“万口和附；并为一谈。”', 2, 1),
(1201, '韬光养晦', 1, '滔', 'tāo guāng yǎng huì', '指隐藏才能，不使外露。', '出 处\n《旧唐书·宣宗记》:“历太和会昌朝，愈事韬晦，群居游处，未尝有言。”', 2, 1),
(1202, '走投无路', 2, '头', 'zǒu tóu wú lù', '投：投奔。无路可走，已到绝境。比喻处境极困难，找不到出路。', '出 处\n元·杨显之《潇湘雨》：“淋的我走投无路；知他这沙门岛是何处酆都。”', 2, 1),
(1203, '轻举妄动', 3, '忘', 'qīng jǔ wàng dòng', '轻：轻率；妄：任意。指不经慎重考虑，轻率地采取行动。', '出 处\n《韩非子·解老》：“众人之轻弃道理而易妄举动者；不知其祸福之深大而道阔远若是也。”', 2, 1),
(1204, '名门望族', 3, '旺', 'míng mén wàng zú', '1.高贵的、地位显要的家庭。\n2.有特权的家族。', '近义词：名门世族、名门贵族', 2, 1),
(1205, '置若罔闻', 3, '惘', 'zhì ruò wǎng wén', '置：放，摆；若：好像。放在一边，好像没有听见似的。指不予理睬。', '出 处\n明·朱国祯《涌幢小品》：“当中书言时；沈宜厉声力折；只因心中恼他；置若罔闻。”', 2, 1),
(1206, '甘冒不韪', 4, '违', 'gān mào bù wěi', '不韪：不是，错误。去干普天下的人都认为不对的事情。指不顾舆论的谴责而去干坏事。', '出 处\n《左传·隐公十一年》：“犯五不韪而以伐人，其丧师也，不亦宜乎？”', 2, 1),
(1207, '蔚然成风', 1, '尉', 'wèi rán chéng fēng', '蔚然：草木茂盛的样子。指一件事情逐渐发展盛行，形成一种良好风气。', '出 处\n范文澜《中国通史》第三编第七章第八节:“日本国内，自望族以至一般文士，摹仿唐诗蔚然成风。”', 2, 1);
INSERT INTO `t_word` (`id`, `word`, `mix_num`, `mix_char`, `pinyin`, `intro`, `caution`, `level`, `status`) VALUES
(1208, '步履维艰', 3, '惟', 'bù lǚ wéi jiān', '指行走困难行动不方便。', '出 处\n清·刘坤一《奏疏》：“臣自上年秋间；时患腰痛；两骽无力；步履维艰。”', 2, 1),
(1209, '萎靡不振', 1, '痿', 'wěi mǐ bù zhèn', '萎靡：颓丧。形容精神不振，意志消沉。', '出 处\n宋·马永卿《元城先生语录》：“至嘉祐末年；天下之事似乎舒缓；委靡不振；当时士大夫亦自厌之；多有文字论列。”', 2, 1),
(1210, '运筹帷幄', 4, '握', 'yùn chóu wéi wò', '筹：计谋、谋划；帷幄：古代军中帐幕。指拟定作战策略。引申为筹划、指挥。', '出 处\n汉·司马迁《史记·高祖本纪》：“夫运筹帷幄之中；决胜于千里之外；吾不如子房。”', 2, 1),
(1211, '黯然销魂', 3, '消', 'àn rán xiāo hún', '黯然：心怀沮丧、面色难看的样子；销魂：灵魂离开肉体。心怀沮丧得好像丢了魂似的。形容非常悲伤或愁苦。', '出 处\n南朝·梁·江淹《别赋》：“黯然销魂者；惟别而已矣。”', 2, 1),
(1212, '独辟蹊径', 3, '溪', 'dú pì xī jìng', '自己开辟一条路。比喻独创一种风格或新的方法。', '出 处\n《晏子春秋；内篇杂上》：“昔者婴之治阿也；筑蹊径。”', 2, 1),
(1213, '自顾不暇', 4, '瑕', 'zì gù bù xiá ', '暇：空闲。光顾自己还来不及。指没有力量再照顾别人。', '出 处\n《晋书·刘聪载记》：“彼方忧自固；何暇来耶！”', 2, 1),
(1214, '目不暇接', 3, '瑕', 'mù bù xiá jiē', '指东西多，眼睛都看不过来。', '出 处\n清·郑燮《潍县署中与舍弟墨之二》：“见其扬羽军振彩；倏往倏来；目不暇给。”', 2, 1),
(1215, '瑕瑜互见', 1, '暇', 'xiá yú hù jiàn', '见：通“现”，显现。比喻优点、缺点都有。', '出 处\n清·平步青《霞外捃屑》：“升庵论文；瑕瑜互见。”', 2, 1),
(1216, '喧宾夺主', 1, '宣', 'xuān bīn duó zhǔ', '喧：声音大。客人的声音压倒了主人的声音。比喻外来的或次要的事物占据了原有的或主要的事物的位置。', '出 处\n清·阮葵生《茶余客话》：“余仿为之；香则喷鼻而酒味变矣。不论酒而论香；是为喧宾夺主。”', 2, 1),
(1217, '骁勇善战', 1, '侥', 'xiāo yǒng shàn zhàn', '勇猛，善于战斗。', '出 处\n《南齐书·戴僧静传》：“其党辅国将军孙昙瓘骁勇善战；每荡一合；辄大杀伤；官军死者百于人。”', 2, 1),
(1218, '歪风邪气', 3, '斜', 'wāi fēng xié qì', '歪、邪：不正当，不正派。指不良的作风和风气。', '近义词：歪门邪道、不正之风', 2, 1),
(1219, '一泻千里', 2, '泄', 'yī xiè qiān lǐ', '泻：水往下直注。形容江河奔流直下，流得又快又远。也比喻文笔或乐曲气势奔放。也形容价格猛跌不止。', '出 处\n唐·李白《赠从弟宣州长史昭》诗:“长川豁中流，千里泻吴会。”宋·陈亮《与辛幼安殿撰书》:“大江大河，一泻千里。”', 2, 1),
(1220, '休养生息', 1, '修', 'xiū yǎng shēng xī ', '休养：休息保养；生息：人口繁殖。指在战争或社会大动荡之后，减轻人民负担，安定生活，恢复元气。', '出 处\n唐·韩愈《平淮西碑》：“高宗中睿；休养生息；至于玄宗；受报收功；积极而丰。”', 2, 1),
(1221, '欢欣鼓舞', 2, '心', 'huān xīn gǔ wǔ ', '欢欣：欣喜；鼓舞：振奋。形容高兴而振奋。', '出 处\n宋·苏轼《上知府王龙图书》:“自公始至，释其重荷……是故莫不欢欣鼓舞之至。”', 2, 1),
(1222, '杳无音信', 4, '言', 'yǎo wú yīn xìn', '音信：消息，回信。没有一点消息。', '出 处\n宋·黄孝迈《水龙吟》词：“惊鸿去后；轻抛素袜；杳无音信。', 2, 1),
(1223, '以身殉职', 3, '徇', 'yǐ shēn xùn zhí', '殉：为实现某一目标而献出生命。为忠于本职工作而献出生命。', '出 处\n《梁书·韦粲传》：“（粲）谓仲礼曰：‘下官才非御侮；直欲以身殉国。’”', 2, 1),
(1224, '以身作则', 4, '侧', 'yǐ shēn zuò zé', '则：准则，榜样。以自己的行动做出榜样。', '出 处\n《论语·子路》：“其身正；不令而行；其身不正；虽令不从。”', 2, 1),
(1225, '徇私舞弊', 1, '殉', 'xùn sī wǔ bì', '徇：曲从；舞：舞弄，耍花样。为了私人关系而用欺骗的方法做违法乱纪的事。', '出 处\n明·施耐庵《水浒》：“谁想这伙官员；贪滥无厌；徇私作弊；克减酒肉。”', 2, 1),
(1226, '循序渐进', 2, '绪', 'xún xù jiàn jìn', '指学习工作等按照一定的步骤逐渐深入或提高。', '出 处\n《论语·宪问》：“不怨天；不尤人；下学而上达。”朱熹注：“……此但自言其反己自修；循序渐进耳。”', 2, 1),
(1227, '意气用事', 1, '义', 'yì qì yòng shì', '意气：主观偏激的情绪；用事：行事。缺乏理智，只凭一时的想法和情绪办事。', '出 处\n清·吴敬梓《儒林外史》第四十六回:“这是事势相逼，不得不尔。至今想来，究竟还是意气用事，并不曾报效得朝廷，倒惹得同官心中不快活，却也悔之无及。”', 2, 1),
(1228, '巍然屹立', 3, '迄', 'wēi rán yì lì', '巍然：极高的样子；屹立：山势直立高耸。比喻像高山一样直立地上，不可动摇。', '出 处\n孙世恺《雄伟的人民大会堂》:“在天安门右前方，巍然耸立着一坐雄伟壮丽的大厦，这就是人民大会堂。”', 2, 1),
(1229, '偃旗息鼓', 1, '揠', 'yǎn qí xī gǔ', '偃：仰卧，引申为倒下。放倒旗子，停止敲鼓。原指行军时隐蔽行踪，不让敌人觉察。现比喻事情终止或声势减弱。', '出 处\n《三国志·赵云传》：“裴松之注引《赵云别传》：“而云入营　；更大门开；偃旗息鼓；公（曹操）军疑云有伏兵；引去。”', 2, 1),
(1230, '溢于言表', 1, '益', 'yì yú yán biǎo', '超出言语以外，指某种思想感情虽未说明却能使人体会出来。', '出 处\n明·朱舜水《答安东守约书三十首》：“来书十读；不忍释手；真挚之情；溢于言表。”', 2, 1),
(1231, '声势赫奕', 4, '弈', 'shēng shì hè yì ', '声威气势盛大显赫。', '出 处\n《醒世恒言·三孝廉让产立高名》：“許氏 三兄弟，都做了大官，雖然他不以富貴驕人，自然聲勢赫奕。”', 2, 1),
(1232, '怨天尤人', 3, '犹', ' yuàn tiān yóu rén', '天：天命，命运；尤：怨恨，归咎。指遇到挫折或出了问题，一味报怨天，责怪别人。', '出 处\n《论语·宪问》：“不怨天；不忧人。”', 2, 1),
(1233, '过犹不及', 2, '尤', 'guò yóu bù jí', '过：过分；犹：像；不及：达不到。事情做得过头，就跟做得不够一样，都是不合适的。', '出 处\n《论语·先进》：“子曰：‘过犹不及。’”', 2, 1),
(1234, '竭泽而渔', 4, '鱼', 'jié zé ér yú', '泽：池、湖。掏干了水塘捉鱼。比喻取之不留余地，只图眼前利益，不作长远打算。也形容反动派对人民的残酷剥削。', '出 处\n《吕氏春秋·义赏》：“竭泽而渔；岂不获得；而明年无鱼。”', 2, 1),
(1235, '坐收渔利', 3, '鱼', 'zuò shōu yú lì', '比喻利用别人的矛盾而从中获利。', '出 处\n明·凌濛初《二刻拍案惊奇》：“他日可以在里头看景生情；得些渔人之利。”', 2, 1),
(1236, '鬼蜮伎俩', 2, '魅', 'guǐ yù jì liǎng', '鬼蜮：阴险害人之物；伎俩：花招，手段。比喻用心险恶，暗中伤人的卑劣手段。', '出 处\n清·李绿园《歧路灯》：“这些衙役鬼魅伎俩；千人一状；原也不必挂齿。”', 2, 1),
(1237, '忠贞不渝', 4, '逾', 'zhōng zhēn bù yú', '忠：忠诚；贞：有操守；渝：改变。忠诚坚定，永不改变。', '出 处\n张扬《第二次握手》:“我始终期望着，有朝一日，把自己的学识、才能献给祖国；同时把自己忠贞不渝的感情，完美无缺地献给你。”', 2, 1),
(1238, '元气大伤', 1, '原', 'yuán qì dà shāng ', '比喻人或国家、社会团体的生命力受到了致命的打击。', '元气是指天地未分前的混沌之气。', 2, 1),
(1239, '无缘无故', 2, '原', 'wú yuán wú gù', '没有一点原因。', '出 处\n清·曹雪芹《红楼梦》四四回：“（平儿）因又说道：‘好好的；从哪里说起！无缘无故白受了一场气！’”', 2, 1),
(1240, '殒身不恤', 1, '损', 'yǔn shēn bù xù', '殒：牺牲；恤：顾惜。牺牲生命也不顾惜。', '近义词：慷慨赴义、慷慨捐生', 2, 1),
(1241, '赞叹不已', 4, '己', 'zàn tàn bù yǐ', '已：止，完。连声赞赏不止。', '出 处\n清·吴敬梓《儒林外史》第三十四回：“庄绍光看了；赞叹不已。”', 2, 1),
(1242, '逼不得已', 4, '己', 'bī bù dé yǐ', '指迫不得已。', '出 处\n宋·张君房《云笈七签》第85卷：“欲此求方，终不可得，云伟骨未应得之，逼不得已，妻尸解而去。”', 2, 1),
(1243, '身不由己', 4, '已', 'shēn bù yóu jǐ', '由：听从。身体不由自己作主。', '出 处\n《宋元戏文辑佚·陈巡检梅岭失妻》：“瓜期信通；为着功名；奔走西东。见说出路自觉心慵；身不由己；意冲冲。”', 2, 1),
(1244, '履险如夷', 4, '宜', 'lǚ xiǎn rú yí', '履：踩踏；夷：平坦。走在危险的地方就象走在平地一样。比喻平安地渡过困境。', '出 处\n汉·刘协《喻郭汜诏》:“今得东移，望远若近，视险如夷。”《晋书·姚苌载记》:“董率大众，履险若夷，上下咸允，人尽死力。”', 2, 1),
(1245, '开门揖盗', 3, '缉', ' kāi mén yī dào', '揖：拱手作礼。开门请强盗进来。比喻引进坏人，招来祸患。', '出 处\n《三国志·吴志·孙权传》：“况今奸宄竞逐；豺狼满道；乃欲哀亲戚；顾礼制；是犹开门而揖盗；未可以为仁也。”', 2, 1),
(1246, '自怨自艾', 2, '恕', 'zì yuàn zì yì', '怨：怨恨，悔恨；艾：割草，比喻改正错误。原意是悔恨自己的错误，自己改正。现在只指悔恨自己的错误。', '出 处\n《孟子·万章上》：“太甲悔过；自怨自艾；于桐处仁迁义。”', 2, 1),
(1247, '贻笑大方', 1, '抬', 'yí xiào dà fāng', '贻笑：让人笑话；大方：原指懂得大道的人，后泛指见识广博或有专长的人。指让内行人笑话。', '出 处\n清·李汝珍《镜花缘》：“但愧知识短浅；诚恐贻笑大方；所以不敢冒昧进谒。”', 2, 1),
(1248, '游必有方', 4, '房', 'yóu bì yǒu fāng', '要是出游，必须要告知去处。', '出 处\n《论语·里仁》:“父母在，不远游，游必有方。”', 2, 1),
(1249, '据义履方', 3, '覆', 'jù yì lǚ fāng', '根据正道立身行事。', '', 3, 1),
(1250, '争妍斗艳', 2, '颜', 'zhēng yán dòu yàn', '指竞相比美。', '近义词：争妍斗奇、争奇斗艳', 2, 1),
(1251, '塞翁失马', 1, '赛', 'sài wēng shī mǎ', '塞：边界险要之处；翁：老头。比喻一时虽然受到损失，也许反而因此能得到好处。也指坏事在一定条件下可变为好事。', '出 处\n宋·魏泰《东轩笔录》：“鲁公有柬别之；略曰：‘寒翁失马；今未足悲；楚相断蛇；后必为福。’”', 2, 1),
(1252, '寒蝉仗马', 3, '杖', 'hán chán zhàng mǎ', '仗马：皇宫仪仗中的立马。象皇宫门外的立仗马和寒天的知了一样。比喻一句话也不敢说。', '出 处\n《新唐书·李林甫传》:“君等独不见立仗马乎？终日无声而饫三品刍豆，一鸣则黜之矣。”', 3, 1),
(1253, '万籁俱寂', 2, '濑', 'wàn lài jù jì ', '籁：从孔穴中发出的声音；万籁：自然界中万物发出的各种声响；寂：静。形容周围环境非常安静，一点儿声响都没有。', '出 处\n唐·常建《题破山寺后禅院》：“万籁此俱寂；但余钟磐音。”', 2, 1),
(1254, '人声鼎沸', 4, '费', 'rén shēng dǐng fèi', '鼎:古代煮食器；沸:沸腾。形容人群的声音吵吵嚷嚷，就像煮开了锅一样。', '出 处\n明·冯梦龙《醒世恒言》：“一日午后；刘方在店中收拾；只听得人声鼎沸。”', 2, 1),
(1255, '沸反盈天', 3, '赢', 'fèi fǎn yíng tiān ', '沸：滚翻；盈：充满。声音像水开锅一样沸腾翻滚，充满了空间。形容人声喧闹，乱成一片。', '出 处\n清·夏敬渠《野叟曝言》：“只见外面的人雪片打进来；沸反盈天；喊声不绝。”', 2, 1),
(1256, '不求甚解', 3, '堪', 'bù qiú shèn jiě', '甚：很，极。只求知道个大概，不求彻底了解。常指学习或研究不认真、不深入。', '出 处\n晋·陶潜《五柳先生传》：“好读书；不求甚解；每有会意；便欣然忘食。”', 2, 1),
(1257, '含英咀华', 3, '组', 'hán yīng jǔ huá', '咀：细嚼，引伸为体味；英、华：这里指精华。比喻读书吸取其精华。', '出 处\n唐·韩愈《进学解》：“沉浸郁；含英咀华；作为文章；其书满家。”', 2, 1),
(1258, '穷原竟委', 3, '竞', 'qióng yuán jìng wěi', '比喻深入探求事物的始末。', '出 处\n西汉·戴圣《礼记·学记》：“三王之祭川也，皆先河而后海，或源也，或委也，此之谓务本。”', 3, 1),
(1259, '从容不迫', 1, '丛', 'cóng róng bù pò', '从容：不慌不忙，很镇静；不迫：不急促。不慌不忙，沉着镇定。', '出 处\n《庄子·秋水》：“鲦鱼出游从容；是鱼之乐也。”', 2, 1),
(1260, '封妻荫子', 3, '阴', 'fēng qī yìn zǐ', '君主时代功臣的妻得到封赠，子孙世袭官爵。旧时指为官的荣耀。', '出 处\n元·无名氏《杀狗劝夫》：“便是他封妻荫子；也讲不得《毛　诗》念不得《孟子》。”', 3, 1),
(1261, '势如破竹', 1, '誓', 'shì rú pò zhú', '势：气势，威力。形势就像劈竹子，头上几节破开以后，下面各节顺着刀势就分开了。比喻节节胜利，毫无阻碍。', '出 处\n《晋书·杜预传》：“今军威已振；譬如破竹；数节之后；皆迎刃而解。”', 3, 1),
(1262, '在劫难逃', 2, '动', 'zài jié nán táo', '旧时迷信的人认为命里注定要遭受的灾难是无法逃脱的。现有时也用来指某种灾害不可避免。', '出 处\n元·无名氏《冯玉兰夜月泣江舟》：“那两个是船家将钱觅到；也都在劫数里不能逃。”', 2, 1),
(1263, '矢在弦上', 2, '弓', 'shǐ zài xián shàng', '箭已搭在弦上。比喻为形势所迫，不得不采取某种行动。', '出 处\n三国·魏·陈琳《为袁绍檄豫州》注引《魏志》：“矢在弦上，不可不发。”', 2, 1),
(1264, '始作俑者', 3, '佣', 'shǐ zuò yǒng zhě', '俑：古代殉葬用的木制或陶制的俑人。开始制作俑的人。比喻首先做某件坏事的人。', '出 处\n先秦·孟轲《孟子·梁惠王上》：“始作俑者，其无后乎！”', 2, 1),
(1265, '蜂拥而上', 2, '涌', 'fēng yōng ér shàng', '形容许多人一起涌上来。', '出 处\n清·曹雪芹《红楼梦》第九回：“墨雨遂掇起一根门闩；扫红、锄药手中都是马鞭子；蜂拥而上。”', 2, 1),
(1266, '言犹在耳', 2, '尤', 'yán yóu zài ěr', '犹：还。说的话还在耳边。比喻说的话还清楚地记得。', '出 处\n《左传·文公七年》：“今君虽终；言犹在耳。”', 2, 1),
(1267, '言之过甚', 1, '严', 'yán zhī guò shèn', '话说得太过头了。', '出 处\n茅盾《追求》四:“自然外边人是言之过甚。但是，空穴来风，仲翁，你也是太登多了。以后总得注意。”', 2, 1),
(1268, '声名藉甚', 3, '籍', 'shēng míng jiè shèn', '名声显赫。指人在社会上流传的评价极高。', '出 处\n北周 庾信《周车骑大将军赠小司空宇文显和墓志铭》：“公稟山嶽之靈，擅風雲之氣，容止矜莊，聲名藉甚。”', 2, 1),
(1269, '良莠不齐', 2, '秀', 'liáng yǒu bù qí', '莠：狗尾草，很像谷子，常混在禾苗中。好人坏人都有，混杂在一起。', '出 处\n清·纪昀《阅微草堂笔记》：“至我辈之中；好丑不一；亦如人类之内；良莠不齐。”', 2, 1),
(1270, '扑朔迷离', 3, '谜', 'pū shuò mí lí ', '指难辨兔的雌雄。形容事情错综复杂，难以辨别清楚。', '出 处\n古乐府《木兰诗》：“雄兔脚扑朔；雌兔眼迷离；双兔傍地走；安能辨我是雄雌？”', 2, 1),
(1271, '才华横溢', 4, '益', 'cái huá héng yì', '才华：表现于外的才能。多指文学艺术方面而言，很有才华。', '近义词：才高八斗、学富五车', 2, 1),
(1272, '宏儒硕学', 3, '博', 'hóng rú shuò xué', '指学问渊博的人。', '近义词：博才多学、硕学通儒', 3, 1),
(1273, '否极泰来', 1, '丕', 'pǐ jí tài lái', '否、泰：《周易》中的两个卦名。否：卦不顺利；泰：卦顺利；极：尽头。逆境达到极点，就会向顺境转化。指坏运到了头好运就来了。', '出 处\n汉·赵晔《吴越春秋·勾践入臣外传》：“时过于期；否终则泰。”', 2, 1),
(1274, '乐极生悲', 2, '及', 'lè jí shēng bēi', '高兴到极点时，发生使人悲伤的事。', '出 处\n《淮南子·道应训》：“夫物盛而衰；乐极则悲。”', 2, 1),
(1275, '枯木逢春', 1, '古', 'kū mù féng chūn', '逢：遇到。枯干的树遇到了春天，又恢复了活力。比喻垂危的病人或事物重新获得生机。', '出 处\n宋·释道原《景德传灯录·卷二十三·唐州大乘山和尚》：“问：‘枯树逢春时如何？’师曰：‘世间希有。’”', 2, 1),
(1276, '六畜兴旺', 1, '大', 'liù chù xīng wàng', '六畜：牛、马、羊、猪、鸡、狗。指各种牲畜、家禽繁衍兴旺。', '近义词：五谷丰登', 2, 1),
(1277, '凶年饥岁', 3, '肌', 'xiōng nián jī suì ', '凶年：年成很坏。指荒年。', '出 处\n《孟子·梁惠王下》:“凶年饥岁，君之民，老弱转乎沟壑，壮者散而之四方者，几千人矣。”', 2, 1),
(1278, '学海无涯', 4, '崖', 'xué hǎi wú yá', '学海：知识。学问的海洋无边无际。', '出 处\n明·张岱《小序》：“学海无边；书囊无底。世间书怎读得尽。”', 2, 1),
(1279, '孜孜以求', 3, '依', 'zī zī yǐ qiú', '不知疲倦地探求。', '孜孜：勤勉的样子。', 2, 1),
(1280, '声气相求', 1, '生', 'shēng qì xiāng qiú', '指志同道合，意气相投。', '出 处\n明·冯梦龙《警世通言·俞伯牙摔琴谢知音》：“腹心相照者，谓之知心；声气相求者，谓之知音。”', 2, 1),
(1281, '声如洪钟', 1, '生', 'shēng rú hóng zhōng', '洪：大。形容说话或歌唱的声音洪亮，如同敲击大钟似的。', '出 处\n明·冯梦龙《东周列国志》第七十二回：“忆胥目如闪电，声如洪钟。”', 2, 1),
(1282, '天马行空', 3, '形', 'tiān mǎ xíng kōng', '1.神马在空中奔腾飞驰，多形容诗文、书法、言行等气势豪放，不受拘束。\n2.形容说话做事不着边际。', '出 处\n元·刘廷振《萨天锡诗集序》:“其所以神化而超出于众表者，殆犹天马行空而步骤不凡。”', 2, 1),
(1283, '天壤王郎', 2, '攮', 'tiān rǎng wáng láng', '天壤：指天地之间，即人世间；王郎：指晋王凝之。天地间竟有这种人。原是谢道蕴轻视其丈夫王凝之的话。后比喻对丈夫不满意。', '出 处\n南朝·宋·刘义庆《世说新语·贤媛》:“一门叔父，则有阿大中郎；群从兄弟，则有封、胡、遏、末，不意天壤之中，乃有王郎。”', 3, 1),
(1284, '居高临下', 3, '淋', 'jū gāo lín xià', '居：站在，处于；临：面对。占据高处，俯视下面。形容占据的地势非常有利。', '出 处\n《魏书·财安王》：“缴山立栅；分为数处；居高临下；隔水为营。”', 2, 1),
(1285, '睚眦必报', 1, '涯', 'yá zì bì bào', '睚眦：发怒时瞪眼睛，借指极小的仇恨。像瞪一下眼睛那样极小的怨仇也要报复。比喻心胸极狭窄。', '出 处\n宋·苏辙《论吕惠卿》：“盖其凶悍猜忍如蝮蝎；万一复用；睚眦必报。”', 2, 1),
(1286, '五彩斑斓', 4, '澜', 'wǔ cǎi bān lán', '斑斓：颜色驳杂，灿烂多彩。表示颜色非常好看，色彩相当丰富。', '近义词：色彩斑斓、五光十色', 2, 1),
(1287, '东兔西乌', 4, '鸟', 'dōng tù xī wū', '兔、乌：古代神话传说中说，月亮里有玉兔，太阳里有三足金乌，所以用乌、兔代表日月。月亮东升，太阳西落。表示时光不断流逝。', '出 处宋·吴潜《瑞鹤仙》：“愁高怅远。身世事，但难准。况禁他，东兔西乌相逐，古古今今不问。”', 3, 1),
(1288, '饮鸩止渴', 2, '鸠', 'yǐn zhèn zhǐ kě', '鸩：传说中的毒鸟，用它的羽毛浸的酒喝了能毒死人。喝毒酒解渴。比喻用错误的办法来解决眼前的困难而不顾严重后果。', '出 处\n晋·葛洪《抱朴子》：“咀漏脯以充饥；酣鸩酒以止渴。”', 3, 1),
(1289, '崭露头角', 1, '暂', 'zhǎn lù tóu jiǎo', '崭：突出；露：显露。头上的角已明显地突出来了。指初显露优异的才能。', '出 处\n唐·韩愈《昌黎集·卷三十二·柳子厚墓志铭》：“虽少年；已自成人；能取进士第；崭然见头角。”', 2, 1),
(1290, '不露锋芒', 3, '峰', 'bù lù fēng máng', '锋芒：比喻锐气或才干。不显露出锐气或才干。多指有意地将自己的才能、抱负等加以掩饰。', '出 处\n宋·吕祖谦《吕东莱文集·杂说》第二十卷：“语有力而不露锋芒者；善言也。”', 2, 1),
(1291, '不可开交', 1, '丕', 'bù kě kāi jiāo', '开：打开，解开；交：相错，纠缠。形容没法解开或摆脱。', '出 处\n清·李宝嘉《官场现形记》第二回：“吴赞善听到这里；便气得不可开交了。”', 1, 1),
(1292, '井然有序', 4, '绪', 'jǐng rán yǒu xù', '井然：整齐不乱的样子。序：次序。整整齐齐，次序分明，条理清楚。', '出 处\n清·王夫之《夕堂永日绪论外编》：“如尤公瑛《寡人之于国也》章文；以制产、重农、救荒分三事……井然有序。”', 2, 1),
(1293, '有条不紊', 4, '稳', 'yǒu tiáo bù wěn ', '紊：乱。形容有条有理，一点不乱。', '出 处\n《尚书·盘庚上》：“若网在纲；有条而不紊。”', 2, 1),
(1294, '励精图治', 4, '制', 'lì jīng tú zhì', '励：奋勉；图：设法；治：治理好国家。振奋精神，想办法治理好国家。', '出 处\n《宋史·神宗纪赞》：“厉（励）精图治；将大有为。”', 2, 1),
(1295, '奋发蹈厉', 4, '历', 'fèn fā dǎo lì', '奋：振作；发：激励；蹈：踩，引伸为做，实行；厉：猛烈，迅疾。精神振奋，行动迅猛。', '出 处\n邹韬奋《抗战以来·自动奋发的千万青年》:“且有整千整百的女青年奋发蹈厉地走出家庭，奔赴前线，不让男同胞专美。”', 3, 1),
(1296, '体贴入微', 4, '徽', ' tǐ tiē rù wēi ', '体贴：细心体谅别人的心情和处境，给予关心和照顾；入微：达到细微的程度。形容对人照顾或关怀非常细心、周到。', '近义词：关怀备至、无微不至', 2, 1),
(1297, '心宽体胖', 4, '盘', 'xīn kuān tǐ pán', '原指人心胸开阔，外貌就安详。后用来指心情愉快，无所牵挂，因而人也发胖。', '出 处\n西汉·戴圣《礼记·大学》：“富润屋，德润身，心广体胖。”', 2, 1),
(1298, '浅尝辄止', 3, '澈', 'qiǎn cháng zhé zhǐ', '辄：就。略微尝试一下就停下来。指不深入钻研。', '出 处\n清·鼓养鸥《黑籍冤魂》：“此物非不可尝；苟文人墨客；浅尝辄止；用以悦性陶情；有何不可？”', 2, 1),
(1299, '即景生情', 1, '既', 'jí jǐng shēng qíng', '对眼前的情景有所感触而产生某种思想情感。', '出 处\n清·李渔《闲情偶寄·词曲部·词采第二》:“善咏物者，妙在即景生情。”', 3, 1),
(1300, '浮光略影', 3, '琼', 'fú guāng lüè yǐng', '水面的光和掠过的影子，一晃就消逝。比喻观察不细致，学习不深入，印象不深刻。', '出 处\n唐·褚亮《临高台》诗：“浮光随日度；漾影逐波深”。', 2, 1),
(1301, '事过境迁', 3, '竟', 'shì guò jìng qiān', '境：境况；迁：改变。事情已经过去，情况也变了。', '出 处\n清·颐琐《黄绣球》：“如此歇了好几日；黄绣球与黄通理事过境迁；已不在心上。”', 2, 1),
(1302, '念兹在兹', 1, '恋', 'niàn zī zài zī ', '念：思念；兹：此，这个。泛指念念不忘某一件事情。', '出 处\n《尚书·大禹谟》：“帝念哉；念兹在兹；释兹在兹。', 3, 1),
(1303, '束之高阁', 2, '至', 'shù zhī gāo gé', '高阁：储藏器物的高架。捆起来以后放在高高的架子上。比喻放着不用。', '出 处\n《晋书·庾翼传》：“此辈宜束之高阁；俟天下太平；然后议其任耳。”', 2, 1),
(1304, '束手受毙', 2, '首', 'shù shǒu shòu bì', '毙：死。捆起手来等死。比喻遇到困难不积极想办法，坐着等失败。同“束手待斃”。', '出 处\n宋 秦观《进策·盗贼上》：“與其嬰錮金木，束手而受斃，孰若遯逸山海，脱身而求生。”', 2, 1),
(1305, '困兽犹斗', 3, '尤', 'kùn shòu yóu dòu ', '被围困的野兽还要作最后挣扎。比喻在绝境中还要挣扎抵抗。', '出 处\n《左传·宣公十二年》：“得臣犹在；忧未歇也。困兽犹斗；况国相乎！”', 2, 1),
(1306, '人寿年丰', 3, '连', 'rén shòu nián fēng', '人长寿，年成也好。形容太平兴旺的景象。', '出 处\n《文选·潘岳〈藉田赋〉》：“宜其民和年登。”李善注引作“人和年丰。”', 2, 1),
(1307, '声色犬马', 4, '乌', 'shēng sè quǎn mǎ', '声：歌舞；色：女色；犬：养狗；马：骑马。泛指旧时统治阶级的淫乐方式。亦作“声色狗马”。', '出 处\n清·蒲松龄《聊斋志异·续黄梁》：“声色狗马，昼夜荒淫，国计民生，罔存念虑。”', 2, 1),
(1308, '风樯阵马', 2, '墙', 'fēng qiáng zhèn mǎ ', '樯：船上用的桅杆。风中的樯帆，阵上的战马。比喻气势雄壮，行动迅速。', '出 处\n唐·杜牧《李贺诗序》:“风樯阵马，不足为其勇也，瓦棺篆鼎，不足为其古也。”', 2, 1),
(1309, '洗兵牧马', 1, '冼', 'xǐ bīng mù mǎ', '洗擦兵器，喂养战马。指做好作战准备。', '近义词：厉兵秣马', 3, 1),
(1310, '厉世摩钝', 1, '励', 'lì shì mó dùn', '厉：劝勉；钝：鲁钝。指磨砺世人，使笨拙的人奋发有为。', '出 处\n《汉书·梅福传》:“故爵禄束帛者，天下之砥石。高祖所以厉世摩钝也。”', 3, 1),
(1311, '石破天惊', 2, '泼', ' shí pò tiān jīng ', '原形容箜篌的声音，忽而高亢，忽而低沉，出人意外，有难以形容的奇境。后多比喻文章议论新奇惊人。', '出 处\n唐·李贺诗《李凭箜篌引》:“女娲炼石补天处，石破天惊逗秋雨。”', 1, 1),
(1312, '边尘不惊', 2, '尖', 'biān chén bù jīng', '比喻边境安定无战事。', '出 处\n《资治通鉴·唐太宗贞观十五年》:“上曰:‘隋炀帝劳百姓，筑长城以备突厥，卒无所益。朕唯置李世勣于晋阳而边尘不惊，其为长城，岂不壮哉！”', 2, 1),
(1313, '栈山航海', 1, '浅', 'zhàn shān háng hǎi', '指跋山涉水，逾越险阻。', '出 处\n南朝宋颜延之《三月三日曲水诗序》：“栈山航海，逾沙轶漠之贡，府无虚月。”', 2, 1),
(1314, '不遗余力', 3, '佘', 'bù yí yú lì ', '遗：留；余力：剩下的力量。把全部力量都使出来，一点不保留。', '出 处\n《战国策·赵策三》：“秦之攻我也；不遗余力矣。”', 2, 1),
(1315, '不矜不伐', 2, '衿', 'bù jīn bù fá', '矜、伐：自夸自大。不自经为了不起，不为自己吹嘘。形容谦逊。', '出 处\n宋·程颐《河南程氏遗书》：“禹又分明如汤、武；观舜称其不矜不伐；与孔子言‘无间然’之事；又却另有一个气象。”', 2, 1),
(1316, '变贪厉薄', 3, '簿', 'biàn tān lì bó', '指改变、劝勉贪图财利、行为轻薄的人使之廉洁忠厚。', '出 处\n《孟子·尽心下》：“圣人百世之师也，伯夷、柳下惠是也。”宋·孙奭疏：“此章言伯夷、柳下惠变贪厉薄，千载闻之，犹有感激。”', 2, 1),
(1317, '变风易俗', 2, '凤', 'biàn fēng yì sú', '指改变旧的风气和习俗。', '出 处\n《史记·平津侯主父列传》:“向使秦缓其刑罚，薄赋倒敛……变风易俗，化于海内，则世世必安矣。”', 2, 1),
(1318, '口干舌燥', 4, '躁', 'kǒu gān shé zào', '燥：干。口舌都干了。形容说话太多。', '出 处\n三国·曹植《善哉行》：“来日大难；口燥唇干；今日相乐；皆当喜欢。”', 2, 1),
(1319, '生发未燥', 4, '躁', 'shēng fà wèi zào', '胎发未干。用以指孩童之时。', '出 处\n《宋书·索虏传》：“焘大怒，谓奇曰：‘我生头发未燥，便闻河南是我家地。’”', 2, 1),
(1320, '矢口狡赖', 1, '失', 'shǐ kǒu jiǎo lài', '死也不肯承认。', '近义词：矢口否认', 2, 1),
(1321, '尘羹涂饭', 3, '余', 'chén gēng tú fàn', '涂：泥。尘做的羹，泥做的饭。指儿童游戏。比喻没有用处的东西。', '出 处\n清·钱谦益《答唐训导论文书》:“南宋以后之俗学，如尘羹涂饭，稍知滋味者，皆能唾而弃之。”', 3, 1),
(1322, '狡兔三窟', 1, '姣', 'jiǎo tù sān kū', '窟：洞穴。狡猾的兔子准备好几个藏身的窝。比喻隐蔽的地方或方法多。', '出 处\n《战国策·齐策四》：“狡兔有三窟；仅得其免死身；今君在一窟；未得高枕而卧也；请为君复凿二窟。”', 2, 1),
(1323, '哀感顽艳', 4, '燕', 'āi gǎn wán yàn', '顽：愚顽。原意是指内容凄切，文辞华丽，使愚笨和聪慧的人同样受感动。后多用来指艳情的小说、戏曲、电影中的感人情节。', '出 处\n三国·魏·繁钦《与魏文帝笺》：“凄入肝脾；哀感顽艳。”', 3, 1),
(1324, '别具匠心', 2, '俱', 'bié jù jiàng xīn', '匠心：巧妙的心思。指在技巧和艺术方面具有与众不同的巧妙构思。', '出 处\n唐·王士源《孟浩然集序》：“文不按古；匠心独妙。”', 2, 1),
(1325, '别出机杼', 4, '抒', 'bié chū jī zhù ', '别：另外；机杼：织布机，比喻诗文的构思和布局。指写作另辟途径，能够创新。', '出 处\n宋·洪迈《容斋诗话》第四卷：“诗文当有所本。若用古人语意，别出机杼，曲而畅之，自足以传示来世。”', 2, 1),
(1326, '匠心独运', 4, '蕴', 'jiàng xīn dú yùn', '匠心：工巧的心思。独创性地运用精巧的心思。', '出 处\n唐·王士源《孟浩然集序》：“文不按古；匠心独妙。”', 2, 1),
(1327, '梦寐以求', 2, '魅', 'mèng mèi yǐ qiú', '寐：睡着。做梦的时候都在追求。形容迫切地期望着。', '出 处\n《诗经·关雎》：“窈窕淑女；梦寐求之。”', 2, 1),
(1328, '道在屎溺', 4, '匿', 'dào zài shǐ nì', '比喻道之无所不在。', '出 处\n《庄子·知北游》:“曰:‘何其愈甚耶？’曰:‘在屎溺。’东郭子不应。”', 2, 1),
(1329, '不二法门', 3, '罚', 'bù èr fǎ mén', '不二：指不是两极端；法门：佧行入道的门径。原为佛家语，意为直接入道，不可言传的法门。后比喻最好的或独一无二的方法。', '出 处\n《维摩诘经·入不二法门品》：“如我意者；于一切法无言无说；无示无识；离诸问答；是为入不二法门。”', 2, 1),
(1330, '因噎废食', 3, '费', 'yīn yē fèi shí', '原意是说，因为有人吃饭噎死了，就想让天下人都不吃饭，这太荒谬了。比喻要做的事情由于出了点小毛病或怕出问题就索性不去干。', '出 处\n汉·刘向《说苑》：“一噎之故；绝谷不食。”', 2, 1),
(1331, '刖趾适屦', 1, '钥', 'yuè zhǐ shì jù ', '因为鞋小脚大，就把脚削去一块来凑和鞋的大小。比喻不合理的牵就凑合或不顾具体条件，生搬硬套。', '出 处\n《三国志·魏书·明帝纪》裴松之注引《魏略》:“刖趾适屦，刻肌伤骨，反更称说，自以为能。”', 2, 1),
(1332, '剖腹藏珠', 1, '解', 'pōu fù cáng zhū', '破开肚子把珍珠藏进去。比喻为物伤身，轻重颠倒。', '出 处\n宋·司马光《资治通鉴·唐太宗贞观元年》：“吾闻西域贾胡得美珠，剖身以藏之，有诸？”', 2, 1),
(1333, '夙兴夜寐', 4, '魅', 'sù xīng yè mèi', '夙：早；兴：起来；寐：睡。早起晚睡。形容勤奋。', '出 处\n《诗经·卫风·氓》：“夙兴夜寐；靡有朝矣。”', 2, 1),
(1334, '久假不归', 1, '九', 'jiǔ jiǎ bù guī', '假：借；归：归还。原指假借仁义的名义而不真正实行，后指长期借用而不归还。', '出 处\n先秦《孟子·尽心上》：“久假而不归；恶知其非有也。”', 2, 1),
(1335, '久别重逢', 4, '缝', 'jiǔ bié chóng féng', '指朋友或亲人在长久分别之后再次见面。', '出 处\n清·曾朴《孽海花》第三回:“多年不见了，说了几句久别重逢的话，招呼大家坐下，书僮送上茶来。”', 2, 1),
(1336, '不约而同', 2, '曰', 'bù yuē ér tóng', '约：相约。事先没有约定而相互一致。', '出 处\n《史记·主父偃传》：“应时而皆动；不谋而俱起；不约而同合。”', 2, 1),
(1337, '不敢苟同', 3, '芶', 'bù gǎn gǒu tóng', '苟：苟且。不敢随便地同意。指对人对事抱慎重态度。', '出 处\n明·王世贞《蔺相如完璧归赵论》:“蔺相如完璧归赵，人人都称赞他。但我不敢苟同这一看法。”', 2, 1),
(1338, '伐异党同', 2, '弈', 'fá yì dǎng tóng', '伐：讨伐，攻击。指结帮分派，偏向同伙，打击不同意见的人。', '出 处\n《后汉书·党锢传序》:“自武帝以后，崇尚儒学，怀经协术，所在雾会。至有石渠分争之论，党同伐异之说。”', 2, 1),
(1339, '伐功矜能', 2, '工', 'fá gōng jīn néng', '伐、矜：夸耀。指吹嘘自己的功劳和才能。形容居高自大，恃才傲物。', '出 处\n《史记·太史公自序》:“奉法循理之吏，不伐功矜能，百姓无称，亦无过行。”', 2, 1),
(1340, '嫉贤妒能', 1, '忌', 'jí xián dù néng', '对品德、才能比自己强的人心怀嫉妒。', '出 处\n汉·荀悦《汉纪·高祖纪三》：“项羽嫉贤妒能，有功者害之，贤者疑之。”', 2, 1),
(1341, '矢口猖言', 3, '狂', 'shǐ kǒu chāng yán', '犹言信口胡说。', '出 处\n清 魏源《＜书古微＞序》：“矢口猖言，不顧其後，其不可信者二。”', 3, 1),
(1342, '厚德载物', 3, '栽', 'hòu dé zài wù ', '旧指道德高尚者能承担重大任务。', '出 处\n《周易·坤》:“君子以厚德载物。”', 2, 1),
(1343, '傥来之物', 1, '尚', 'tǎng lái zhī wù', '傥来：偶然、意外得来的。无意中得到的或非本分应得的财物。', '出 处\n《庄子·缮性》:“物之傥来，寄者也。”', 2, 1),
(1344, '如释重负', 2, '试', 'rú shì zhòng fù', '释：放下；重负：重担子。像放下重担那样轻松。形容紧张心情过去以后的轻松愉快。', '出 处\n《煖梁传·昭公二十九年》：“昭公出奔；民如释重负。”', 2, 1),
(1345, '不可一世', 4, '事', 'bù kě yī shì', '一世：一时。认为当代的人都不行。形容目空一切、狂妄自大到了极点。', '出 处\n宋·罗大经《鹤林玉露补遗》第十五卷：“王荆公少年；不可一世士。”', 2, 1),
(1346, '旁若无人', 2, '如', 'páng ruò wú rén', '身旁好像没有人。形容态度傲慢，不把别人放在眼里。', '出 处\n《史记·荆轲传》：“高渐离击筑；荆轲和而歌子市中；相乐也。已而相泣；旁若无人者。”', 2, 1),
(1347, '古色古香', 4, '湘', 'gǔ sè gǔ xiāng', '形容器物书画等富有古雅的色彩和情调。', '出 处\n宋·陆游《小室》：“窗几穷幽致；图书发古香。”', 2, 1),
(1348, '事不师古', 1, '是', 'shì bù shī gǔ', '形容做事不吸取前人经验。', '出 处\n《书·说命下》：“事不师古，以克永世。”', 2, 1),
(1349, '事与愿违', 3, '意', 'shì yǔ yuàn wéi', '事实与愿望相反。指原来打算做的事没能做到。', '出 处\n三国·嵇康《幽愤》：“事与愿违；遘兹淹留。”', 2, 1),
(1350, '从心所欲', 1, '遂', 'cóng xīn suǒ yù', '按照自己的意思，想怎样便怎样。', '出 处\n《论语·为政》:“六十而耳顺，七十而从心所欲，不逾矩。”', 2, 1),
(1351, '绝圣弃智', 4, '志', 'jué shèng qì zhì', '圣、智：智慧，聪明。弃绝聪明才智，返归天真纯朴。这是古代老、庄的无为而治的思想。', '出 处\n《老子》第十九章:“绝圣弃智，民利百倍；绝仁弃义，民复孝慈；绿色通巧弃利，盗贼无有。”', 3, 1),
(1352, '竭忠尽智', 4, '志', 'jié zhōng jìn zhì', '毫无保留地献出一片忠诚和所有才智。', '出 处\n《屈原列传》：“屈平正道直行，竭忠尽智，以事其君。”', 3, 1),
(1353, '山崩川竭', 2, '迸', 'shān bēng chuān jié', '山岳崩塌，河川干枯。古代认为是重大事变或其征兆。亦作“山崩水竭”。', '近义词：山崩水竭', 3, 1),
(1354, '力殚财竭', 1, '立', 'lì dān cái jié', '殚：尽。力量和财物都已耗尽。', '出 处\n唐·白居易《止狱措刑》:“及秦之时，厚献以竭人财，远役以殚人力；力殚财竭，尽为完贼，群盗满山，赭衣塞路；故每岁断罪，数至十万。”', 2, 1),
(1355, '响遏行云', 2, '喝', 'xiǎng è xíng yún', '遏：阻止；行云：飘动的云彩。形容歌声嘹亮，高入云霄，连浮动着的云彩也被止住了。', '出 处\n《列子·汤问》：“饯于郊衢；抚节悲歌；声振林木；响遏行云。”', 2, 1),
(1356, '好谋善断', 4, '段', 'hào móu shàn duàn', '善：擅长；断：决断。形容人能不断思考，并善于判断。', '出 处\n晋·陆机《辨亡论》上：“畴咨俊茂，好谋善断。”', 2, 1),
(1357, '荒淫无度', 4, '渡', ' huāng yín wú dù', '荒：荒唐；淫：淫乱；度：限度。形容征逐酒色，生活糜烂。', '出 处\n汉·杨恽《报孙会宗书》：“荒淫无度；不知其不可也。”', 2, 1),
(1358, '不刊之论', 2, '堪', 'bù kān zhī lùn', '刊：削除，古代把字写在竹简上，有错误就削去。指正确的、不可修改的言论。', '出 处\n宋·郭若虚《图画见闻志·论曹吴体法》第一卷：“况唐室已（以）上；未立曹吴；岂显释寡要之谈；乱爱宾不刊之论。”', 2, 1),
(1359, '三足鼎立', 3, '顶', 'sān zú dǐng lì', '比喻三方面对立的局势。', '出 处\n《后汉书·窦融传》：“欲三分鼎；连衡合从；也宜以时定。”', 2, 1),
(1360, '渊亭山立', 3, '杉', 'yuān tíng shān lì', '比喻人品德如渊水深沉，如高山耸立。', '近义词：渊渟岳峙', 2, 1),
(1361, '哀毁骨立', 1, '艾', 'āi huǐ gǔ lì', '哀：悲哀；毁：损坏身体；骨立：形容极瘦，只剩下骨架。旧时形容在父母丧中因过度悲伤而瘦得只剩一把骨头。', '出 处\n南朝·宋·刘义庆《世说新语·德行》：“王戎虽不备礼；而哀毁骨立。”', 3, 1),
(1362, '改弦更张', 4, '章', 'gǎi xián gēng zhāng', '更：改换；张：给乐器上弦。改换、调整乐器上的弦，使声音和谐。比喻改革制度或变更计划、方法。', '出 处\n《魏书·高谦之传》：“且琴瑟不韵；知音改弦更张；骖未调；善御执辔成组。”', 2, 1),
(1363, '因循守旧', 1, '徇', 'yīn xún shǒu jiù ', '因循：沿袭；守旧：死守老的一套。死守老一套，缺乏创新的精神。', '出 处\n《汉书·循吏传序》：“光因循守职；无所改作。”', 2, 1),
(1364, '作茧自缚', 1, '做', 'zuò jiǎn zì fù', '蚕吐丝作茧，把自己裹在里面。比喻做了某件事，结果使自己受困。也比喻自己给自己找麻烦。', '出 处\n唐·白居易《江州赴中州至江陵以来舟中示舍弟五十韵》：“烛蛾谁救护；蚕茧自缠裹。”', 2, 1),
(1365, '重峦叠嶂', 4, '障', 'chóng luán dié zhàng ', '峦：连绵的山。山峰一个连着一个，连绵不断。', '出 处\n唐·徐光溥《题黄居寀秋山图》：“秋来奉诏写秋山，写在轻绡数幅间；高低向背无遗势，重峦叠嶂何孱颜。”', 2, 1),
(1366, '振聋发聩', 4, '溃', 'zhèn lóng fā kuì', '聩：天生耳聋，引申为不明事理。声音很大，使耳聋的人也听得见。比喻用语言文字唤醒糊涂麻木的人，使他们清醒过来。', '出 处\n清·袁枚《随园诗话补遗》：“此数言；振聋发聩；想当时必有迂儒曲士以经学谈诗者。”', 2, 1),
(1367, '错落有致', 4, '至', 'cuò luò yǒu zhì', '错落：参差不齐。致：情趣。形容事物的布局虽然参差不齐，但却极有情趣，使人看了有好感。', '出 处\n《晋书·卫恒》：“纤波浓点；错落其间。”', 2, 1),
(1368, '闲情逸致', 4, '智', 'xián qíng yì zhì', '逸：安闲；致：情趣。指悠闲的心情和安逸的兴致。', '出 处\n清·文康《儿女英雄传》：“老爷这趟出来；更是闲情逸致；正要问问沿途的景物。”', 2, 1),
(1369, '凄风苦雨', 1, '戚', 'qī fēng kǔ yǔ', '凄风：寒冷的风；苦雨：久下成灾的雨。形容天气恶劣。后用来比喻境遇悲惨凄凉。', '出 处\n明·贾三近《亟拯淮徐赤子以固中原疏》：“犹有二三遗黎；未就沟壑；日呻吟于凄风苦雨之下……”', 2, 1),
(1370, '浓妆艳抹', 4, '摸', 'nóng zhuāng yàn mǒ', '形容妇女妆饰打扮得十分艳丽。', '出 处\n明·施耐庵《水浒》：“原来这婆娘……每日只是浓妆艳抹；和西门庆做一处取乐。”', 2, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `t_heimingdan`
--
ALTER TABLE `t_heimingdan`
  ADD PRIMARY KEY (`id`),
  ADD KEY `nickname` (`nickname`);

--
-- Indexes for table `t_system_auth`
--
ALTER TABLE `t_system_auth`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `index_system_auth_title` (`title`) USING BTREE,
  ADD KEY `index_system_auth_status` (`status`) USING BTREE;

--
-- Indexes for table `t_system_auth_node`
--
ALTER TABLE `t_system_auth_node`
  ADD PRIMARY KEY (`id`),
  ADD KEY `index_system_auth_auth` (`auth`) USING BTREE,
  ADD KEY `index_system_auth_node` (`node`) USING BTREE;

--
-- Indexes for table `t_system_config`
--
ALTER TABLE `t_system_config`
  ADD PRIMARY KEY (`id`),
  ADD KEY `index_system_config_name` (`name`);

--
-- Indexes for table `t_system_log`
--
ALTER TABLE `t_system_log`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `t_system_menu`
--
ALTER TABLE `t_system_menu`
  ADD PRIMARY KEY (`id`),
  ADD KEY `index_system_menu_node` (`node`) USING BTREE;

--
-- Indexes for table `t_system_node`
--
ALTER TABLE `t_system_node`
  ADD PRIMARY KEY (`id`),
  ADD KEY `index_system_node_node` (`node`);

--
-- Indexes for table `t_system_sequence`
--
ALTER TABLE `t_system_sequence`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `index_system_sequence_unique` (`type`,`sequence`) USING BTREE,
  ADD KEY `index_system_sequence_type` (`type`),
  ADD KEY `index_system_sequence_number` (`sequence`);

--
-- Indexes for table `t_system_user`
--
ALTER TABLE `t_system_user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `index_system_user_username` (`username`) USING BTREE;

--
-- Indexes for table `t_whitelist`
--
ALTER TABLE `t_whitelist`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `appid` (`appid`);

--
-- Indexes for table `t_word`
--
ALTER TABLE `t_word`
  ADD PRIMARY KEY (`id`);

--
-- 在导出的表使用AUTO_INCREMENT
--

--
-- 使用表AUTO_INCREMENT `t_heimingdan`
--
ALTER TABLE `t_heimingdan`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `t_system_auth`
--
ALTER TABLE `t_system_auth`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;
--
-- 使用表AUTO_INCREMENT `t_system_auth_node`
--
ALTER TABLE `t_system_auth_node`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=240;
--
-- 使用表AUTO_INCREMENT `t_system_config`
--
ALTER TABLE `t_system_config`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=47;
--
-- 使用表AUTO_INCREMENT `t_system_log`
--
ALTER TABLE `t_system_log`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;
--
-- 使用表AUTO_INCREMENT `t_system_menu`
--
ALTER TABLE `t_system_menu`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=80;
--
-- 使用表AUTO_INCREMENT `t_system_node`
--
ALTER TABLE `t_system_node`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=299;
--
-- 使用表AUTO_INCREMENT `t_system_sequence`
--
ALTER TABLE `t_system_sequence`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT;
--
-- 使用表AUTO_INCREMENT `t_system_user`
--
ALTER TABLE `t_system_user`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10003;
--
-- 使用表AUTO_INCREMENT `t_whitelist`
--
ALTER TABLE `t_whitelist`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=2;
--
-- 使用表AUTO_INCREMENT `t_word`
--
ALTER TABLE `t_word`
  MODIFY `id` int(11) UNSIGNED NOT NULL AUTO_INCREMENT COMMENT '主键', AUTO_INCREMENT=1371;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
